help.org
#+PROPERTY: header-args :tangle "./.emacs.el" :results output silent

#  LocalWords:  YASnippet UTF defun PlantUML LanguageTool HELP's Eshell showeverything

#+STARTUP: showeverything

* README
  :PROPERTIES:
  :ID:       org_gcr_2017-05-12_mara:3DBC61FF-D790-471A-904F-DABFB0DABA1F
  :END:

Configure EMACS to for everything defined within this monolithic system.

Sysop is likely to use this constantly.

Start EMACS with this command:

#+BEGIN_EXAMPLE
emacs --debug-init --no-init-file --no-splash --background-color white --foreground-color black --vertical-scroll-bars --eval '(switch-to-buffer "*Messages*")' --name HLP-TEST --title HLP-TEST --load ~/src/help/.emacs.el &
#+END_EXAMPLE

EMACS values dynamic-scoping for now and in the future.

EMACS values lexical-scoping in the future.

There are pecuilar interactions between [[https://yoo2080.wordpress.com/2011/12/31/lexical-scoping-and-dynamic-scoping-in-emacs-lisp/][lexically and dynamically scope closures]]
and [[https://yoo2080.wordpress.com/2013/08/14/invasion-of-special-variables-in-emacs-lisp/][special variables]].

With the future in mind, make the switch now.

It is enabled with a non-nil buffer-local variable ~lexical-binding~. The variable
is inserted only here because it loads each of the child configurations.
Web.

Never compile this.

#+NAME: org_gcr_2017-05-12_mara_881EF8A4-92D9-452C-AACC-2A966497ABF6
#+BEGIN_SRC emacs-lisp :comments no
;; -*- lexical-binding: t; no-byte-compile: t; -*-
#+END_SRC

#+NAME: org_gcr_2017-05-12_mara_EE00DAED-88BD-4271-9CFE-34BDCEE68932
#+BEGIN_SRC emacs-lisp
;; Added by Package.el.  This must come before configurations of
;; installed packages.  Don't delete this line.  If you don't want it,
;; just comment it out by adding a semicolon to the start of the line.
;; You may delete these explanatory comments.
;(package-initialize)

(load-file "~/src/help/.org-mode-contribute.emacs.el")
#+END_SRC

** HELP Enables Literate Programming
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:73599C3B-39B0-4979-86C2-E4AC068AAC79
   :END:

*Setup*

1) [[http://orgmode.org/][Clone Org-Mode]] to =~/src/=
2) Go there.
   #+BEGIN_EXAMPLE
cd ~/src/org-mode
   #+END_EXAMPLE
3) Build it
   1) Without =Make=: [[http://orgmode.org/worg/org-hacks.html][Generating autoloads and Compiling Org without make]]
      1) As of <2016-01-19 Tue> this means doing this:
         #+BEGIN_EXAMPLE
  emacs -batch -Q -L lisp -l ../mk/org-fixup -f org-make-autoloads
       #+END_EXAMPLE
   2) With ~Make~ use ~make~.
4) [[https://github.com/punchagan/org2blog][Clone Org2Blog]] to =~/src/=.
5) [[https://github.com/jwiegley/use-package][Clone Use-Package]] to =~/src/=.
6) Install supporting software adding their exectuable location to the =PATH=.
   1) Install [[https://www.oracle.com/java/index.html][Oracle Java]].
   2) Install [[https://www.languagetool.org/][LanguageTool]] renaming it's folder to =LanguageTool=.
   3) Install PlantUML.
   4) Install Ditaa.
   5) Install [[https://tug.org/mactex/][MacTeX]].
7) Link:
   - The Eshell directory to HELP's.
     - =ln -s ~/src/help/eshell/ ~/.emacs.d/eshell=
   - The Initialization file to HELP's.
     - =ln -s ~/src/help/.emacs.el ~/.emacs.el=

