help.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2017-10-13 Fri 15:58 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>&lrm;</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Grant Rettke">
</head>
<body>
<div id="content">

<div id="outline-container-org5f16170" class="outline-2">
<h2 id="org5f16170"><span class="section-number-2">1</span> README</h2>
<div class="outline-text-2" id="text-1">
<pre class="example">
ID: org_gcr_2017-05-12_mara:3DBC61FF-D790-471A-904F-DABFB0DABA1F
</pre>

<p>
Configure EMACS to for everything defined within this monolithic system.
</p>

<p>
Sysop is likely to use this constantly.
</p>

<p>
Start EMACS with this command:
</p>

<pre class="example">
emacs --debug-init --no-init-file --no-splash --background-color white --foreground-color black --vertical-scroll-bars --eval '(switch-to-buffer "*Messages*")' --name HLP-TEST --title HLP-TEST --load ~/src/help/.emacs.el &amp;
</pre>

<p>
EMACS values dynamic-scoping for now and in the future.
</p>

<p>
EMACS values lexical-scoping in the future.
</p>

<p>
There are pecuilar interactions between <a href="https://yoo2080.wordpress.com/2011/12/31/lexical-scoping-and-dynamic-scoping-in-emacs-lisp/">lexically and dynamically scope closures</a>
and <a href="https://yoo2080.wordpress.com/2013/08/14/invasion-of-special-variables-in-emacs-lisp/">special variables</a>.
</p>

<p>
With the future in mind, make the switch now.
</p>

<p>
It is enabled with a non-nil buffer-local variable <code>lexical-binding</code>. The variable
is inserted only here because it loads each of the child configurations.
Web.
</p>

<p>
Never compile this.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org183f094"><span class="org-comment-delimiter">;; </span><span class="org-comment">-*- lexical-binding: t; no-byte-compile: t; -*-</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org58e9e09"><span class="org-comment-delimiter">;; </span><span class="org-comment">Added by Package.el.  This must come before configurations of</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">installed packages.  Don't delete this line.  If you don't want it,</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">just comment it out by adding a semicolon to the start of the line.</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">You may delete these explanatory comments.</span>
<span class="org-comment-delimiter">;</span><span class="org-comment">(package-initialize)</span>

(load-file <span class="org-string">"~/src/help/.org-mode-contribute.emacs.el"</span>)
</pre>
</div>
</div>

<div id="outline-container-orgb6ee6a3" class="outline-3">
<h3 id="orgb6ee6a3"><span class="section-number-3">1.1</span> HELP Enables Literate Programming</h3>
<div class="outline-text-3" id="text-1-1">
<pre class="example">
ID: org_gcr_2017-05-12_mara:73599C3B-39B0-4979-86C2-E4AC068AAC79
</pre>

<p>
<b>Setup</b>
</p>

<ol class="org-ol">
<li><a href="http://orgmode.org/">Clone Org-Mode</a> to <code>~/src/</code></li>
<li><p>
Go there.
</p>
<pre class="example">
cd ~/src/org-mode
</pre></li>
<li>Build it
<ol class="org-ol">
<li>Without <code>Make</code>: <a href="http://orgmode.org/worg/org-hacks.html">Generating autoloads and Compiling Org without make</a>
<ol class="org-ol">
<li><p>
As of <span class="timestamp-wrapper"><span class="timestamp">&lt;2016-01-19 Tue&gt; </span></span> this means doing this:
</p>
<pre class="example">
  emacs -batch -Q -L lisp -l ../mk/org-fixup -f org-make-autoloads
</pre></li>
</ol></li>
<li>With <code>Make</code> use <code>make</code>.</li>
</ol></li>
<li><a href="https://github.com/punchagan/org2blog">Clone Org2Blog</a> to <code>~/src/</code>.</li>
<li><a href="https://github.com/jwiegley/use-package">Clone Use-Package</a> to <code>~/src/</code>.</li>
<li>Install supporting software adding their exectuable location to the <code>PATH</code>.
<ol class="org-ol">
<li>Install <a href="https://www.oracle.com/java/index.html">Oracle Java</a>.</li>
<li>Install <a href="https://www.languagetool.org/">LanguageTool</a> renaming it&rsquo;s folder to <code>LanguageTool</code>.</li>
<li>Install PlantUML.</li>
<li>Install Ditaa.</li>
<li>Install <a href="https://tug.org/mactex/">MacTeX</a>.</li>
</ol></li>
<li>Link:
<ul class="org-ul">
<li>The Eshell directory to HELP&rsquo;s.
<ul class="org-ul">
<li><code>ln -s ~/src/help/eshell/ ~/.emacs.d/eshell</code></li>
</ul></li>
<li>The Initialization file to HELP&rsquo;s.
<ul class="org-ul">
<li><code>ln -s ~/src/help/.emacs.el ~/.emacs.el</code></li>
</ul></li>
</ul></li>
</ol>
</div>
</div>
