help.html

<div id="outline-container-org96be4da" class="outline-3">
<h3 id="org96be4da"><span class="section-number-3">1.2</span> Style Guide</h3>
<div class="outline-text-3" id="text-1-2">
<pre class="example">
ID: org_gcr_2017-05-12_mara:280391BE-63FC-4E2E-B734-AF18A449FA96
</pre>
<ul class="org-ul">
<li>Appearance.
<ul class="org-ul">
<li>Never override theme colors.</li>
<li>When the theme doesn&rsquo;t configure a face then submit a patch.</li>
</ul></li>
<li>Content
<ul class="org-ul">
<li>When importing update to conform with Style-Guide.</li>
<li>Keep tangled and weaved documents synchronized with their web.</li>
<li>Ask yourself:
<ul class="org-ul">
<li>Does it belong in this web?</li>
<li>Does it belong in this headline?</li>
</ul></li>
</ul></li>
<li>Dictionary
<dl class="org-dl">
<dt>Exemple Complet Minimal (ECM)</dt><dd>The minimal complete example of expected
versus actual behavior. <a href="http://orgmode.org/worg/org-faq.html">Source</a>.</dd>
<dt>Key-Bind</dt><dd>A verb. The act of creating a Key Binding.</dd>
<dt>Literate Programming (LP)</dt><dd>As Knuth intended.</dd>
<dt>Out of the Box (OOTB)</dt><dd>The default configuration.</dd>
<dt>Sysop</dt><dd>A proper noun. The System-Operator. The human operating this EMACS
based Org-Mode enabled literate programming system. The reader.</dd>
<dt>Tangle</dt><dd>A verb. Assemble a document for consumption by another program or
machine.</dd>
<dt>Weave</dt><dd>A verb. Prepare a document for consumption by a human.</dd>
<dt>Web</dt><dd>A document contained Source-Block definitions that define a system.</dd>
</dl></li>
<li>Encoding
<ul class="org-ul">
<li>Prefer Unicode characters over ASCII equivalents.
<ul class="org-ul">
<li>Note eventual switch form PDFLaTeX to LuaTeX.</li>
</ul></li>
<li>Consider Org-Mode automatic handling of ASCII to UTF-8 symbols.</li>
</ul></li>
<li>File/Package Loading
<ul class="org-ul">
<li>Load every one with <code>use-package</code> whether it came with EMACS OOTB or ELPA.
<ul class="org-ul">
<li><code>ensure t</code> tells the reader which one it came from.</li>
</ul></li>
<li>Binding definitions often live in Piano Lessons.</li>
<li>Configurations aren&rsquo;t meant to be fully transplant-able because this system
monolithic. In the interest of collaboration as much of the package
configuration lives in the <code>use-package</code> block as possible.</li>
</ul></li>
<li>Formatting
<ul class="org-ul">
<li>Code Snippet.
<ul class="org-ul">
<li>Key bindings</li>
<li>Programming language expressions
<ul class="org-ul">
<li>Variable names</li>
</ul></li>
<li>Emacs mode function name, package name or Github name. This is the most
technical name that you can and do use in scripts It is meant for computers.
<ul class="org-ul">
<li><code>org-mode</code></li>
</ul></li>
<li>Class and Object names</li>
<li>Shell commands that are executable</li>
<li>Executable for programming language compilers and interpreters. To
clarify these are either the executable names or the human names for
example <code>gcc versus ~C</code>.
<ul class="org-ul">
<li><code>gcc</code> and <code>python</code></li>
<li><code>bash</code> and <code>perl</code></li>
<li><code>scheme</code> and <code>java</code></li>
<li><code>GCC</code> and <code>Python</code></li>
<li><code>Bash</code> and <code>Perl</code></li>
<li><code>Scheme</code> and <code>Java</code></li>
</ul></li>
<li>Anything that you would read program or text</li>
<li>Use <code>code style</code> of tildaes</li>
</ul></li>
<li>Non-Code Snippet.
<ul class="org-ul">
<li>ALL PROPER NOUNS</li>
<li>File types</li>
<li>File names</li>
<li>Emacs mode name: THE HUMAN VERSION
<ul class="org-ul">
<li>Other stuff like function-name and package-name and Github name are
not how humans write about them. Humans write about them like any
other proper noun for example &ldquo;Coca Cola&rdquo; not &ldquo;coca cola&rdquo;.</li>
<li>Org-Mode is the best example</li>
</ul></li>
<li>Concepts like <code>Object Oriented Programming</code> or a <code>Immediately-invoked
      function expression</code></li>
<li>Use <code>verbatim</code> style of equal sign</li>
</ul></li>
<li>Package.
<ul class="org-ul">
<li>Same as Headline.</li>
<li>Dashes separate definition.</li>
<li>Acronyms are all upper case to distinguish from words for example &ldquo;GNU&rdquo;
vs &ldquo;Gnu&rdquo;.</li>
</ul></li>
</ul></li>
<li>Headline.
<ul class="org-ul">
<li>Be sure that every one has an <code>ID</code> property with a <code>UUID</code> value.
<ul class="org-ul">
<li><code>org-id-get-create</code> does this. So does code in Hacking/Org Mode/Utility.</li>
</ul></li>
<li>Capitalize: nouns, verbs, and adjectives.</li>
<li>Don&rsquo;t capitalize conjunctions unless they are starting the definition.</li>
<li>Sell this &ldquo;chapter&rdquo; to the reader.</li>
<li>Some headlines will be empty and significant; keep them.
<ul class="org-ul">
<li>Some modes don&rsquo;t require any configuration. The headline still needs to be
present to remind the reader to keep it in her cognitive landscape.
Configure other properties and modes taking it into account.</li>
<li>For every language under Hacking you should:
<ul class="org-ul">
<li>Only include it if it is valuable and you will invest adequate time to
configure this well and use it well. When reading Org-Mode examples you
will want to add Org-Mode language support because it is easy and fun
and then you are left with an insufficiently configured environment.
That is unacceptable.</li>
<li>Enable it in <code>org-babel-load-languages</code>.</li>
<li>Read the user manual for it.</li>
</ul></li>
<li>The <code>Prog-Mode</code> system configuration can result in Headlines that don&rsquo;t
need any configuration. The Headline still communicates the mode&rsquo;s
value to the reader even if it doesn&rsquo;t configure EMACS.</li>
</ul></li>
<li>It is important to include headlines that are empty and that you may not
even end up keeping. You need them to help you explore the cognitive
landscape with them present. In this one case, premature optimization is
<i>not</i> the root of all evil.</li>
<li>Sometimes headlines might better be:
<ul class="org-ul">
<li>List items.</li>
<li>Stand-alone bold text without punctuation.</li>
</ul></li>
</ul></li>
<li>Hyperlink.
<ul class="org-ul">
<li>External.
<ul class="org-ul">
<li>Exclude those easily found with a search-engine unless you are willing to
verify their existence frequently.</li>
<li>Include when they make the task at hand immensely easier.</li>
</ul></li>
<li>Internal.
<ul class="org-ul">
<li>Minimize usage.</li>
</ul></li>
</ul></li>
<li>Literate Programming.
<ul class="org-ul">
<li>Comments.
<ul class="org-ul">
<li>Exclude from tangle-blocks and rely on source-block for traceability.</li>
</ul></li>
<li>Noweb-Ref.
<ul class="org-ul">
<li>Same as Headline.</li>
<li>Replace spaces with dashes.</li>
<li>Probably the Heading name.</li>
<li>Keep depth shallow</li>
</ul></li>
<li>Weaver and mode configurations are tightly bound.</li>
</ul></li>
<li>Maintenance.
<ul class="org-ul">
<li>Frequently check spelling, grammar, and weasel-words.</li>
<li>Only keep working features in the system.</li>
</ul></li>
<li>Macros
<ul class="org-ul">
<li>Rendered as written-text.</li>
<li>Don&rsquo;t contain source code.</li>
<li>Create for ideas expressed more than 2 times.</li>
<li>Expanded during weaving, not during tangling.</li>
</ul></li>
<li>Plain List.
<ul class="org-ul">
<li>End single sentences with a period.</li>
</ul></li>
<li>Programming Language.
<ul class="org-ul">
<li>Emacs-Lisp.
<ul class="org-ul">
<li>Almost always use <code>defun</code> instead of <code>advice-add</code>.
<ul class="org-ul">
<li>Functions are more normal and predictable.</li>
<li>Advice can subtly break without you noticing.</li>
</ul></li>
<li>Parameter.
<ul class="org-ul">
<li><code>nil</code> for <code>FALSE</code>.</li>
<li><code>t</code> for <code>TRUE</code>.</li>
<li><code>n</code> for numerical values.</li>
</ul></li>
<li>Never <code>custom-set-variables</code>.</li>
<li>Always use relative file paths.</li>
<li>Byte-compile frequently to minimize System warnings.</li>
<li>Prefer to byte-compile all references by using <code>function</code>.
<ul class="org-ul">
<li>Fail-fast: it is better to know immediately if there are resolution
issues.</li>
</ul></li>
<li>Prefer to declare anonymous functions with <code>function</code>.</li>
<li><a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Using-Lexical-Binding.html#Using-Lexical-Binding">Quoted via</a>.</li>
<li>If a non-special variable appears outside of a let form, the byte-compiler
will warn about reference or assignment to a &ldquo;free variable&rdquo;. An
unused non-special variable binding within a let form provokes the
byte-compiler will warn about an &ldquo;unused lexical variable&rdquo;. The
byte-compiler will also issue a warning if you use a special variable as a
function argument.</li>
</ul></li>
</ul></li>
<li>Source Block
<ul class="org-ul">
<li>Be sure that every one has a <code>NAME</code> property with a <code>UUID</code> value.
<ul class="org-ul">
<li>YASnippet <code>sc</code> does this. So does code in Hacking/Org Mode/Utility.</li>
</ul></li>
<li>Tell the story in speech, and then in code.</li>
<li>Communicate the intent in written language as one paragraph and realize that
intent in the next paragraph as a source block. Separate the two paragraphs
like you would any other paragraph.
<ul class="org-ul">
<li>The exporter will probably separate the two as you would expect whether
you separate the two entities with a space or not</li>
</ul></li>
<li>When contained within a list:
<ul class="org-ul">
<li>Indent begin/end blocks with list content; this makes it clear to Org-Mode
to export it as a code block.</li>
</ul></li>
<li>Tangle <code>:file</code> should have the same <code>NAME</code>.</li>
<li>Virtually never edit the contents within buffer-of-origin.
<ul class="org-ul">
<li>Out of buffer edits:
<ul class="org-ul">
<li>Fast when spoken language.</li>
<li>Risky when LISP.</li>
</ul></li>
</ul></li>
<li>While similar to Org-Macro, the <code>RESULT</code> formatting indicates to the reader
that the value is the result of an evaluation.</li>
</ul></li>
<li>Spelling
<ul class="org-ul">
<li>Place <code>LocalWords</code> at the beginning of the document. That way it won&rsquo;t get
stomped on during development.</li>
</ul></li>
<li>Synonyms.
<ul class="org-ul">
<li>Document and System and Web.
<ul class="org-ul">
<li>A Web defines a system.</li>
<li>This document is a Web.</li>
</ul></li>
<li>Weave and Export.</li>
<li>Sysop and Reader.</li>
</ul></li>
<li>Tangling.
<ul class="org-ul">
<li>When ordering matters, rely on block-reuse to enforce correct order.</li>
</ul></li>
<li>Voice.
<ul class="org-ul">
<li>Provide answers; do not pose questions or observations.</li>
<li>Simple and detailed.</li>
<li>Pleasant conversation style.</li>
<li>Audience is Sysop; the author included.</li>
<li>Capture decisions that allow this system to move forward.</li>
</ul></li>
<li>Weaving.
<ul class="org-ul">
<li>Strive to keep the weaving in synchronization with the tangling.</li>
</ul></li>
<li>Word Choice.
<ul class="org-ul">
<li>Use Arabic numerals.</li>
<li>Instead of writing &ldquo;tells EMACS&rdquo;, communicate the result.</li>
<li>&ldquo;EMACS&rdquo; refers to the EMACS software</li>
<li>&ldquo;HELP&rdquo; refers to the system configured by tangling this we.</li>
<li>Never describe something as &ldquo;perfect&rdquo; or &ldquo;delightful&rdquo;. If it is part of this
system then it is perfect and delightful.</li>
</ul></li>
</ul>
</div>
</div>
