help.org
** History
:PROPERTIES:
:ID:       org_gcr_2017-06-25_mara:F917FFA6-077B-4A9A-B325-7E9A0CFF9720
:END:
*** Version 1: Sufficient And Slipshod
:PROPERTIES:
:ID:       org_gcr_2017-06-25_mara:2AE32991-F8DA-4205-822C-51A267EC81D6
:END:
Emacs never grew on me the first few times I tried using it. The first was out
of curiosity because a friend used ~jdee~. Five or ten years later I tried using
it for ~clojure~ and lost interest first in ~clojure~ and then in Emacs. The third
time was for ~ocaml~ and ~sml~. That worked pretty well but I didn't stick with
~sml~ so I didn't stick with Emacs either. At least five configuration files
came out of this time all hand-coded Elisp and they are all either lost or
hanging around in a SVN repository on a backup. I never had a sense of how
Emacs worked, found any of it interesting or a problem solved by it. That is a
reflection of what I did and what I brought to it. And I understand that.
*** Version 2: How to design a file conservator (HTDFC) or The Care and Conservation of Computer Files (TC3F)
:PROPERTIES:
:ID:       org_gcr_2017-06-25_mara:8BD93843-0D61-45FA-98F4-C3BBA0FFBB47
:END:
The second time around, VIM got me hooked on Emacs. /Growing up/ with VIM I had
returned to ~gvim~ and I was happy with plain old text files. For keeping todo
lists, meeting minutes and working in LaTeX both worked great. That process of
re-falling in love with plain old text files is what struck me. Once I heard
the Org-Mode tag line "your life in plain text" I knew I had to take a look.
And I did and it was delightful.

And I was hooked. The line pulled me into pure exploration. Reading the
manuals, blogs and other folks' configuration files was an boundless
adventure. This was entirely about learning different libraries and
configuration options. And it was pretty fun. It was still hand coded Elisp
and probably went through ten iterations until I was happy with it.

It meant so much to me that I started naming the configuration finally ending
up with [[https://raw.githubusercontent.com/grettke/home/master/TC3F.txt][TC3F]].
*** Version 3: ALEC'S A LANGUAGE FOR EXPRESSING CREATIVITY (ALEC)
:PROPERTIES:
:ID:       org_gcr_2017-06-25_mara:1D2B647B-DAEC-42FE-97C8-777CF8869C52
:END:
ALEC is the Cambrian Explosion of my cognitive model of Emacs. Creativity
abounded like never before. The technology reflected it, enabled and grew
into the finest external tool that I had ever known. The passages elaborate on
the technology, the thought processes and justification and go on much further
into the nature of creativity, cognition and their grand intersection.

That intersection was in the great plains, steaming jungles and snow capped
mountain peaks. It was everywhere and I was everywhere. This was the point
where I stopped pretending that it was written for anyone else other than me.
Part of that admission was finally understanding what it means to learn about
how we think and how we use that to craft, shape and hone our tools. Emacs is
referred to in the singular but it is really a collection of hundreds of
creative parts. The work here helped me start to narrow down what I was trying
to do and to think. And I thought that I wanted to learn Literate Programming.

So I did and I tried and it was a slow and confusing document because that is
how it lived in my mind. There were hundreds and hundreds of commits until I
was both happy enough with it and comfortable enough to share it. This was the
first time that I started to feel like I had some clue about what I was doing.
*** Version 4: HELP Enables Literate Programming
:PROPERTIES:
:ID:       org_gcr_2017-06-25_mara:64CA819C-71AD-4E6E-9091-4FFCA95AAF08
:END:
HELP was more than an attempt to create a recursive acronym. It
/really was helpful/. Every good idea from ALEC got simplified and moved in
here. Exploration of the tool and of creative processes were still part of it.
But the bigger part was learning, studying and practicing Literate Programming
(LP).

Donald Knuth wrote a lot /about/ LP and /wrote/ a lot /in/ LP. That is revealing. To
get the most about of LP you need to love programming. And you need to love
writing. Really you need to love writing in whatever form that takes for you.
And finally you need to love doing both together. Literate programmers are few
and far between simply because the combination the three desires are uncommon.
Despite that it is still fun to practice LP. And Org-Mode does LP so well.

Org-Mode's LP tools are stunning and flawless. They shine so brightly that it
can be difficult to take a look and see what is possible. HELP is my attempt
to take the options that configure them building the perfect LP environment
for me. Though HELP is still somewhat wild and unrefined the LP components are
both precisely configured /and/ understood. Probably only to me and I am fine
with that. Teaching LP with Org-Mode would be an entirely different task!

Mark my words for they are sure to change here and probably be struck down by
the idiom-zapper plugin that I've yet to write: this will be a stable version
of my Emacs configuration for a long time. All of my original desires are
satisfied. This fine tool, the infinite abacus, has sat in this hearth long
enough. Now it is time to carry it out into the wilderness and far above and
beyond the mountaintops to reveal the other side and the mysteries that they
reveal.
* Special Operating Procedure
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:A5B71AC0-1725-4416-AB50-86496180526A
   :END:

The following code and packages are special to this configuration. They provide
critical functionality for configuring the rest of the system. They provide
ideas that make the entire system usable, productive, expressive, and fast.

** Customize
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:C8E7E545-E716-4ACE-9536-B7278F843632
:END:

Easy Customization is great. Though most of the time I move the settings into
hand-coded Elisp, I still love it.

Store Customizations in another file. Avoids the
[[https://www.reddit.com/r/emacs/comments/53zpv9/how_do_i_get_emacs_to_stop_adding_custom_fields/][package-selected-packages]] portability issue.

#+NAME: org_gcr_2017-05-12_mara_289C017E-D5F0-4B8A-987F-A64696094359
#+BEGIN_SRC emacs-lisp
(setq custom-file "~/src/help/custom.el")
(load custom-file :noerror)
#+END_SRC

