help.html
<div id="outline-container-org39b9351" class="outline-3">
<h3 id="org39b9351"><span class="section-number-3">1.3</span> History</h3>
<div class="outline-text-3" id="text-1-3">
<pre class="example">
ID: org_gcr_2017-06-25_mara:F917FFA6-077B-4A9A-B325-7E9A0CFF9720
</pre>
</div>
<div id="outline-container-org63be2d0" class="outline-4">
<h4 id="org63be2d0"><span class="section-number-4">1.3.1</span> Version 1: Sufficient And Slipshod</h4>
<div class="outline-text-4" id="text-1-3-1">
<pre class="example">
ID: org_gcr_2017-06-25_mara:2AE32991-F8DA-4205-822C-51A267EC81D6
</pre>
<p>
Emacs never grew on me the first few times I tried using it. The first was out
of curiosity because a friend used <code>jdee</code>. Five or ten years later I tried using
it for <code>clojure</code> and lost interest first in <code>clojure</code> and then in Emacs. The third
time was for <code>ocaml</code> and <code>sml</code>. That worked pretty well but I didn&rsquo;t stick with
<code>sml</code> so I didn&rsquo;t stick with Emacs either. At least five configuration files
came out of this time all hand-coded Elisp and they are all either lost or
hanging around in a SVN repository on a backup. I never had a sense of how
Emacs worked, found any of it interesting or a problem solved by it. That is a
reflection of what I did and what I brought to it. And I understand that.
</p>
</div>
</div>
<div id="outline-container-orgf8bb59f" class="outline-4">
<h4 id="orgf8bb59f"><span class="section-number-4">1.3.2</span> Version 2: How to design a file conservator (HTDFC) or The Care and Conservation of Computer Files (TC3F)</h4>
<div class="outline-text-4" id="text-1-3-2">
<pre class="example">
ID: org_gcr_2017-06-25_mara:8BD93843-0D61-45FA-98F4-C3BBA0FFBB47
</pre>
<p>
The second time around, VIM got me hooked on Emacs. <i>Growing up</i> with VIM I had
returned to <code>gvim</code> and I was happy with plain old text files. For keeping todo
lists, meeting minutes and working in LaTeX both worked great. That process of
re-falling in love with plain old text files is what struck me. Once I heard
the Org-Mode tag line &ldquo;your life in plain text&rdquo; I knew I had to take a look.
And I did and it was delightful.
</p>

<p>
And I was hooked. The line pulled me into pure exploration. Reading the
manuals, blogs and other folks&rsquo; configuration files was an boundless
adventure. This was entirely about learning different libraries and
configuration options. And it was pretty fun. It was still hand coded Elisp
and probably went through ten iterations until I was happy with it.
</p>

<p>
It meant so much to me that I started naming the configuration finally ending
up with <a href="https://raw.githubusercontent.com/grettke/home/master/TC3F.txt">TC3F</a>.
</p>
</div>
</div>
<div id="outline-container-orge0ef81d" class="outline-4">
<h4 id="orge0ef81d"><span class="section-number-4">1.3.3</span> Version 3: ALEC&rsquo;S A LANGUAGE FOR EXPRESSING CREATIVITY (ALEC)</h4>
<div class="outline-text-4" id="text-1-3-3">
<pre class="example">
ID: org_gcr_2017-06-25_mara:1D2B647B-DAEC-42FE-97C8-777CF8869C52
</pre>
<p>
ALEC is the Cambrian Explosion of my cognitive model of Emacs. Creativity
abounded like never before. The technology reflected it, enabled and grew
into the finest external tool that I had ever known. The passages elaborate on
the technology, the thought processes and justification and go on much further
into the nature of creativity, cognition and their grand intersection.
</p>

<p>
That intersection was in the great plains, steaming jungles and snow capped
mountain peaks. It was everywhere and I was everywhere. This was the point
where I stopped pretending that it was written for anyone else other than me.
Part of that admission was finally understanding what it means to learn about
how we think and how we use that to craft, shape and hone our tools. Emacs is
referred to in the singular but it is really a collection of hundreds of
creative parts. The work here helped me start to narrow down what I was trying
to do and to think. And I thought that I wanted to learn Literate Programming.
</p>

<p>
So I did and I tried and it was a slow and confusing document because that is
how it lived in my mind. There were hundreds and hundreds of commits until I
was both happy enough with it and comfortable enough to share it. This was the
first time that I started to feel like I had some clue about what I was doing.
</p>
</div>
</div>
<div id="outline-container-orgda28389" class="outline-4">
<h4 id="orgda28389"><span class="section-number-4">1.3.4</span> Version 4: HELP Enables Literate Programming</h4>
<div class="outline-text-4" id="text-1-3-4">
<pre class="example">
ID: org_gcr_2017-06-25_mara:64CA819C-71AD-4E6E-9091-4FFCA95AAF08
</pre>
<p>
HELP was more than an attempt to create a recursive acronym. It
<i>really was helpful</i>. Every good idea from ALEC got simplified and moved in
here. Exploration of the tool and of creative processes were still part of it.
But the bigger part was learning, studying and practicing Literate Programming
(LP).
</p>

<p>
Donald Knuth wrote a lot <i>about</i> LP and <i>wrote</i> a lot <i>in</i> LP. That is revealing. To
get the most about of LP you need to love programming. And you need to love
writing. Really you need to love writing in whatever form that takes for you.
And finally you need to love doing both together. Literate programmers are few
and far between simply because the combination the three desires are uncommon.
Despite that it is still fun to practice LP. And Org-Mode does LP so well.
</p>

<p>
Org-Mode&rsquo;s LP tools are stunning and flawless. They shine so brightly that it
can be difficult to take a look and see what is possible. HELP is my attempt
to take the options that configure them building the perfect LP environment
for me. Though HELP is still somewhat wild and unrefined the LP components are
both precisely configured <i>and</i> understood. Probably only to me and I am fine
with that. Teaching LP with Org-Mode would be an entirely different task!
</p>

<p>
Mark my words for they are sure to change here and probably be struck down by
the idiom-zapper plugin that I&rsquo;ve yet to write: this will be a stable version
of my Emacs configuration for a long time. All of my original desires are
satisfied. This fine tool, the infinite abacus, has sat in this hearth long
enough. Now it is time to carry it out into the wilderness and far above and
beyond the mountaintops to reveal the other side and the mysteries that they
reveal.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org033597e" class="outline-2">
<h2 id="org033597e"><span class="section-number-2">2</span> Special Operating Procedure</h2>
<div class="outline-text-2" id="text-2">
<pre class="example">
ID: org_gcr_2017-05-12_mara:A5B71AC0-1725-4416-AB50-86496180526A
</pre>

<p>
The following code and packages are special to this configuration. They provide
critical functionality for configuring the rest of the system. They provide
ideas that make the entire system usable, productive, expressive, and fast.
</p>
</div>

<div id="outline-container-org36c2807" class="outline-3">
<h3 id="org36c2807"><span class="section-number-3">2.1</span> Customize</h3>
<div class="outline-text-3" id="text-2-1">
<pre class="example">
ID: org_gcr_2017-05-12_mara:C8E7E545-E716-4ACE-9536-B7278F843632
</pre>

<p>
Easy Customization is great. Though most of the time I move the settings into
hand-coded Elisp, I still love it.
</p>

<p>
Store Customizations in another file. Avoids the
<a href="https://www.reddit.com/r/emacs/comments/53zpv9/how_do_i_get_emacs_to_stop_adding_custom_fields/">package-selected-packages</a> portability issue.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org226b771">(<span class="org-keyword">setq</span> custom-file <span class="org-string">"~/src/help/custom.el"</span>)
(load custom-file <span class="org-builtin">:noerror</span>)
</pre>
</div>
</div>
</div>
