help.org
** Display
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:AC7B6F6A-EB1C-49AA-89F3-0B5DAC8BD759
   :END:

Make it easy to conditionally evaluate code when running with a graphical
display.

#+NAME: org_gcr_2017-05-12_mara_0A242AFE-3101-4F88-A2CB-F230FA19AC64
#+BEGIN_SRC emacs-lisp
(defmacro help/on-gui (statement &rest statements)
  "Evaluate the enclosed body only when run on GUI."
  `(when (display-graphic-p)
     ,statement
     ,@statements))

(defmacro help/not-on-gui (statement &rest statements)
  "Evaluate the enclosed body only when run on GUI."
  `(when (not (display-graphic-p))
     ,statement
     ,@statements))

#+END_SRC

** Hydra
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:96FBC635-B614-479C-BFA4-E9AE3D70EB8B
   :END:

#+NAME: org_gcr_2017-05-12_mara_D2A1FF8B-4A1A-4D25-A0CC-D86F3FFD7B28
#+BEGIN_SRC emacs-lisp
(use-package hydra
  :ensure t)

#+END_SRC

** Keyboard
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:63790E33-FB60-4C0E-A13E-907D5A175CEC
   :END:

Key-Chord mode is amazing. Piano-Lessons shows you how.

#+NAME: org_gcr_2017-05-12_mara_B25D3BDE-CB14-440D-8246-B833BD8F1C0B
#+BEGIN_SRC emacs-lisp
(use-package key-chord
  :ensure t
  :config
  (key-chord-mode t))
#+END_SRC

Echo keystrokes immediately.

#+NAME: org_gcr_2017-05-12_mara_6BB32DFA-105B-4712-BF6D-945A240C29E1
#+BEGIN_SRC emacs-lisp
(setq echo-keystrokes 0.02)
#+END_SRC

** Libraries
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:E1A8398D-E2F6-485B-83FB-CE52AE9A5D1B
   :END:

Lists.

#+NAME: org_gcr_2017-05-12_mara_12B73D47-AAFB-4271-92F2-98A18E19DC2A
#+BEGIN_SRC emacs-lisp
(use-package dash
  :ensure t
  :config
  (dash-enable-font-lock))
(use-package dash-functional
  :ensure t)
#+END_SRC

Files and directories.

#+NAME: org_gcr_2017-05-12_mara_D99938CC-B521-4A2D-8DAA-F023FFB1E21E
#+BEGIN_SRC emacs-lisp
(use-package f
  :ensure t)
#+END_SRC

Strings.

#+NAME: org_gcr_2017-05-12_mara_04215D1F-F7E8-46E2-A3BC-0D8DEE28B7E1
#+BEGIN_SRC emacs-lisp
(use-package s
  :ensure t)
#+END_SRC

Hash-tables.

#+NAME: org_gcr_2017-05-23_mara_5BAD0073-631D-4D4E-83CD-5B0CD0C7CAD6
#+BEGIN_SRC emacs-lisp
(use-package ht
  :ensure t)
#+END_SRC

Caching.

#+NAME: org_gcr_2017-05-12_mara_C063F7CE-637E-43F8-8E16-AFBC68CA7618
#+BEGIN_SRC emacs-lisp
(use-package persistent-soft
  :ensure t)
#+END_SRC

Namespacing without language support.

#+NAME: org_gcr_2017-05-12_mara_506BFAA8-1F72-4956-A85F-2C7ED59912D0
#+BEGIN_SRC emacs-lisp
(use-package names
  :ensure t)
#+END_SRC

Child process handling specifically for Magit.

#+NAME: org_gcr_2017-05-12_mara_C0E2C1E6-A271-47A1-84C3-BE9382235979
#+BEGIN_SRC emacs-lisp
(use-package with-editor
  :ensure t)
#+END_SRC

** Modeline
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:953129BC-045D-43B5-A194-904818E44FC7
   :END:

Reduce information about modes in the Modeline.

#+NAME: org_gcr_2017-05-12_mara_2FD3C2CA-508B-453E-A619-76D6EA4AAF71
#+BEGIN_SRC emacs-lisp
(use-package diminish)
#+END_SRC

Show the file size.

#+NAME: org_gcr_2017-05-12_mara_555EE82E-410B-4189-BE53-D33346F3F3BE
#+BEGIN_SRC emacs-lisp
(size-indication-mode)
#+END_SRC

Show the column number.

#+NAME: org_gcr_2017-05-12_mara_BC16CA62-6474-4848-880C-F1EDE2BB5616
#+BEGIN_SRC emacs-lisp
(column-number-mode t)
#+END_SRC

Configuration uses active theme.

#+NAME: org_gcr_2017-06-13_mara_7F117B6D-AFE7-479C-8313-3E9B6B4D967F
#+BEGIN_SRC emacs-lisp
(use-package smart-mode-line
  :ensure t)
#+END_SRC

Emacs mode for hiding the mode-line from [[https://emacs-doctor.com/emacs-hide-mode-line.html][Bastien]].

#+NAME: org_gcr_2017-11-15_mara_361908ED-32C9-4339-91AE-F02A2E017A87
#+BEGIN_SRC emacs-lisp
(defvar-local hidden-mode-line-mode nil)

(define-minor-mode hidden-mode-line-mode
  "Minor mode to hide the mode-line in the current buffer."
  :init-value nil
  :global t
  :variable hidden-mode-line-mode
  :group 'editing-basics
  (if hidden-mode-line-mode
      (setq hide-mode-line mode-line-format
            mode-line-format nil)
    (setq mode-line-format hide-mode-line
          hide-mode-line nil))
  (force-mode-line-update)
  ;; Apparently force-mode-line-update is not always enough to
  ;; redisplay the mode-line
  (redraw-display)
  (when (and (called-interactively-p 'interactive)
           hidden-mode-line-mode)
    (run-with-idle-timer
     0 nil 'message
     (concat "Hidden Mode Line Mode enabled.  "
             "Use M-x hidden-mode-line-mode to make the mode-line appear."))))
#+END_SRC

