help.html

<div id="outline-container-org0a1a4d5" class="outline-3">
<h3 id="org0a1a4d5"><span class="section-number-3">2.2</span> Display</h3>
<div class="outline-text-3" id="text-2-2">
<pre class="example">
ID: org_gcr_2017-05-12_mara:AC7B6F6A-EB1C-49AA-89F3-0B5DAC8BD759
</pre>

<p>
Make it easy to conditionally evaluate code when running with a graphical
display.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgba120f0">(<span class="org-keyword">defmacro</span> <span class="org-function-name">help/on-gui</span> (statement <span class="org-type">&amp;rest</span> statements)
  <span class="org-doc">"Evaluate the enclosed body only when run on GUI."</span>
  <span class="org-highlight-quoted-quote">`</span>(<span class="org-keyword">when</span> (display-graphic-p)
     ,statement
     ,@statements))

(<span class="org-keyword">defmacro</span> <span class="org-function-name">help/not-on-gui</span> (statement <span class="org-type">&amp;rest</span> statements)
  <span class="org-doc">"Evaluate the enclosed body only when run on GUI."</span>
  <span class="org-highlight-quoted-quote">`</span>(<span class="org-keyword">when</span> (not (display-graphic-p))
     ,statement
     ,@statements))

</pre>
</div>
</div>
</div>

<div id="outline-container-org02e101e" class="outline-3">
<h3 id="org02e101e"><span class="section-number-3">2.3</span> Hydra</h3>
<div class="outline-text-3" id="text-2-3">
<pre class="example">
ID: org_gcr_2017-05-12_mara:96FBC635-B614-479C-BFA4-E9AE3D70EB8B
</pre>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org205ab35">(<span class="org-keyword">use-package</span> <span class="org-constant">hydra</span>
  <span class="org-builtin">:ensure</span> t)

</pre>
</div>
</div>
</div>

<div id="outline-container-org16071fe" class="outline-3">
<h3 id="org16071fe"><span class="section-number-3">2.4</span> Keyboard</h3>
<div class="outline-text-3" id="text-2-4">
<pre class="example">
ID: org_gcr_2017-05-12_mara:63790E33-FB60-4C0E-A13E-907D5A175CEC
</pre>

<p>
Key-Chord mode is amazing. Piano-Lessons shows you how.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org9cb6fd0">(<span class="org-keyword">use-package</span> <span class="org-constant">key-chord</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (key-chord-mode t))
</pre>
</div>

<p>
Echo keystrokes immediately.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgd358a76">(<span class="org-keyword">setq</span> echo-keystrokes 0.02)
</pre>
</div>
</div>
</div>

<div id="outline-container-org51623c0" class="outline-3">
<h3 id="org51623c0"><span class="section-number-3">2.5</span> Libraries</h3>
<div class="outline-text-3" id="text-2-5">
<pre class="example">
ID: org_gcr_2017-05-12_mara:E1A8398D-E2F6-485B-83FB-CE52AE9A5D1B
</pre>

<p>
Lists.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org1743cda">(<span class="org-keyword">use-package</span> <span class="org-constant">dash</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (dash-enable-font-lock))
(<span class="org-keyword">use-package</span> <span class="org-constant">dash-functional</span>
  <span class="org-builtin">:ensure</span> t)
</pre>
</div>

<p>
Files and directories.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org9ec7df7">(<span class="org-keyword">use-package</span> <span class="org-constant">f</span>
  <span class="org-builtin">:ensure</span> t)
</pre>
</div>

<p>
Strings.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org6ad9885">(<span class="org-keyword">use-package</span> <span class="org-constant">s</span>
  <span class="org-builtin">:ensure</span> t)
</pre>
</div>

<p>
Hash-tables.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org9d9577c">(<span class="org-keyword">use-package</span> <span class="org-constant">ht</span>
  <span class="org-builtin">:ensure</span> t)
</pre>
</div>

<p>
Caching.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgcedd465">(<span class="org-keyword">use-package</span> <span class="org-constant">persistent-soft</span>
  <span class="org-builtin">:ensure</span> t)
</pre>
</div>

<p>
Namespacing without language support.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org19e438e">(<span class="org-keyword">use-package</span> <span class="org-constant">names</span>
  <span class="org-builtin">:ensure</span> t)
</pre>
</div>

<p>
Child process handling specifically for Magit.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgcf9f059">(<span class="org-keyword">use-package</span> <span class="org-constant">with-editor</span>
  <span class="org-builtin">:ensure</span> t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf3ec930" class="outline-3">
<h3 id="orgf3ec930"><span class="section-number-3">2.6</span> Modeline</h3>
<div class="outline-text-3" id="text-2-6">
<pre class="example">
ID: org_gcr_2017-05-12_mara:953129BC-045D-43B5-A194-904818E44FC7
</pre>

<p>
Reduce information about modes in the Modeline.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orga1995e4">(<span class="org-keyword">use-package</span> <span class="org-constant">diminish</span>)
</pre>
</div>

<p>
Show the file size.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orga88bb8a">(size-indication-mode)
</pre>
</div>

<p>
Show the column number.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgee4b919">(column-number-mode t)
</pre>
</div>

<p>
Configuration uses active theme.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgd21b18b">(<span class="org-keyword">use-package</span> <span class="org-constant">smart-mode-line</span>
  <span class="org-builtin">:ensure</span> t)
</pre>
</div>
</div>
</div>
