help.org
** OS X
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:BC848D6F-7915-4151-8368-D473CA39E7C3
   :END:

Make it easy to evaluate code only when running on OSX.

#+NAME: org_gcr_2017-05-12_mara_FF670CDD-5374-49BA-897A-AE1A30B444D6
#+BEGIN_SRC emacs-lisp
(defmacro help/on-osx (statement &rest statements)
  "Evaluate the enclosed body only when run on OSX."
  `(when (eq system-type 'darwin)
     ,statement
     ,@statements))
#+END_SRC

Pull in the =ENVIRONMENT= variables because the GUI version of EMACS does not.

#+NAME: org_gcr_2017-05-12_mara_375D2A3D-54B5-4DBC-B911-38CAB716286A
#+BEGIN_SRC emacs-lisp
(help/on-osx
 (use-package exec-path-from-shell
   :ensure t
   :config
   (setq exec-path-from-shell-check-startup-files nil)
   (exec-path-from-shell-initialize)))
#+END_SRC

Configure the meta keys.

Use the OS X modifiers as Emacs meta keys. Don't pass them through to OS X.

Easily allow option pass through for alternate input methods.

#+NAME: org_gcr_2017-05-12_mara_F29E41A6-234D-4727-B9DF-75E5F5AC2AD3
#+BEGIN_SRC emacs-lisp
(help/on-osx
 (setq mac-control-modifier 'control)
 (setq mac-right-control-modifier 'left)
 (setq mac-command-modifier 'meta)
 (setq mac-right-command-modifier 'left)
 (setq mac-option-modifier 'super)
 (setq mac-right-option-modifier 'left)
 (defun help/toggle-mac-right-option-modifier ()
   "Toggle between passing option modifier either to Emacs or OS X."
   (interactive)
   (let ((old-ropt mac-right-option-modifier))
     (setq mac-right-option-modifier
           (if (eq mac-right-option-modifier 'left)
               'none
             'left))
     (message "Toggled `mac-right-option-modifier' from %s to %s."
              old-ropt
              mac-right-option-modifier)))
 (defun help/toggle-mac-function-modifier ()
   "Toggle between passing function modifier either to Emacs or OS X."
   (interactive)
   (let ((old-func mac-function-modifier))
     (setq mac-function-modifier
           (if (eq mac-function-modifier 'hyper)
               'none
             'hyper))
     (message "Toggled `mac-function-modifier' from %s to %s."
              old-func
              mac-function-modifier))))
#+END_SRC

EMACS dialogues don't work OSX. They lock up EMACS.

This is a known issue. [[https://superuser.com/questions/125569/how-to-fix-emacs-popup-dialogs-on-mac-os-x][Here]] is the solution.

#+NAME: org_gcr_2017-05-12_mara_82602D6E-30DB-49CF-A900-1FC9B733C347
#+BEGIN_SRC emacs-lisp
(help/on-osx
 (defun help/yes-or-no-p (orig-fun &rest args)
   "Prevent yes-or-no-p from activating a dialog."
   (let ((use-dialog-box nil))
     (apply orig-fun args)))
 (advice-add #'yes-or-no-p :around #'help/yes-or-no-p)
 (advice-add #'y-or-n-p :around #'help/yes-or-no-p))
#+END_SRC

** Windows
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:F59CD0F9-9B04-493E-AA9A-2471F2ED0A05
   :END:

Make it easy to evaluate code only when running on Windows.

#+NAME: org_gcr_2017-05-12_mara_9C48F55A-19D7-4B5F-8779-11BFFF4AE514
#+BEGIN_SRC emacs-lisp
(defmacro help/on-windows (statement &rest statements)
  "Evaluate the enclosed body only when run on Microsoft Windows."
  `(when (eq system-type 'windows-nt)
     ,statement
     ,@statements))
#+END_SRC

Provide the proper shell.

#+NAME: org_gcr_2017-05-12_mara_9CAED015-5B25-41BE-82A9-CBA4D07E8F3D
#+BEGIN_SRC emacs-lisp
(help/on-windows
 (setq shell-file-name "cmdproxy.exe"))
#+END_SRC

Enable the =super= key-space.

#+NAME: org_gcr_2017-05-12_mara_7AFA0161-4DCA-4C54-8D3C-9EF3FD529BF4
#+BEGIN_SRC emacs-lisp
(help/on-windows
 (setq w32-pass-lwindow-to-system nil)
 (defvar w32-lwindow-modifier 'super)
 (setq w32-pass-rwindow-to-system nil)
 (defvar w32-rwindow-modifier 'super))
#+END_SRC

** Linux
:PROPERTIES:
:ID:       org_gcr_2017-07-23_mara:7D02C86B-CDBE-466B-9647-3EDA6DB016C6
:END:
Make it easy to evaluate code only when running on .

#+NAME: org_gcr_2017-07-23_mara_ED1CAC7D-4B9E-4316-8AB3-85ACDC06B3F4
#+BEGIN_SRC emacs-lisp
(defmacro help/on-gnu/linux (statement &rest statements)
  "Evaluate the enclosed body only when run on GNU/Linux"
  `(when (eq system-type 'gnu/linux)
     ,statement
     ,@statements))

#+END_SRC
* Standard Operating Procedure
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:205571BA-2DC4-4DCB-912C-65B9EC843574
   :END:

Configure EMACS to maximum utility.

