help.html

<div id="outline-container-org33677e5" class="outline-3">
<h3 id="org33677e5"><span class="section-number-3">2.7</span> OS X</h3>
<div class="outline-text-3" id="text-2-7">
<pre class="example">
ID: org_gcr_2017-05-12_mara:BC848D6F-7915-4151-8368-D473CA39E7C3
</pre>

<p>
Make it easy to evaluate code only when running on OSX.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgaff63eb">(<span class="org-keyword">defmacro</span> <span class="org-function-name">help/on-osx</span> (statement <span class="org-type">&amp;rest</span> statements)
  <span class="org-doc">"Evaluate the enclosed body only when run on OSX."</span>
  <span class="org-highlight-quoted-quote">`</span>(<span class="org-keyword">when</span> (eq system-type <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">darwin</span>)
     ,statement
     ,@statements))
</pre>
</div>

<p>
Pull in the <code>ENVIRONMENT</code> variables because the GUI version of EMACS does not.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org5daf30d">(<span class="org-keyword">help/on-osx</span>
 (<span class="org-keyword">use-package</span> <span class="org-constant">exec-path-from-shell</span>
   <span class="org-builtin">:ensure</span> t
   <span class="org-builtin">:config</span>
   (<span class="org-keyword">setq</span> exec-path-from-shell-check-startup-files nil)
   (exec-path-from-shell-initialize)))
</pre>
</div>

<p>
Configure the meta keys.
</p>

<p>
Use the OS X modifiers as Emacs meta keys. Don&rsquo;t pass them through to OS X.
</p>

<p>
Easily allow option pass through for alternate input methods.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgcb60eb4">(<span class="org-keyword">help/on-osx</span>
 (<span class="org-keyword">setq</span> mac-control-modifier <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">control</span>)
 (<span class="org-keyword">setq</span> mac-right-control-modifier <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">left</span>)
 (<span class="org-keyword">setq</span> mac-command-modifier <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">meta</span>)
 (<span class="org-keyword">setq</span> mac-right-command-modifier <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">left</span>)
 (<span class="org-keyword">setq</span> mac-option-modifier <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">super</span>)
 (<span class="org-keyword">setq</span> mac-right-option-modifier <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">left</span>)
 (<span class="org-keyword">setq</span> mac-function-modifier <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">hyper</span>)
 (<span class="org-keyword">defun</span> <span class="org-function-name">help/toggle-mac-right-option-modifier</span> ()
   <span class="org-doc">"Toggle between passing option modifier either to Emacs or OS X."</span>
   (<span class="org-keyword">interactive</span>)
   (<span class="org-keyword">let</span> ((old-ropt mac-right-option-modifier))
     (<span class="org-keyword">setq</span> mac-right-option-modifier
           (<span class="org-keyword">if</span> (eq mac-right-option-modifier <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">left</span>)
               <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">none</span>
             <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">left</span>))
     (message <span class="org-string">"Toggled `</span><span class="org-string"><span class="org-constant">mac-right-option-modifier</span></span><span class="org-string">' from %s to %s."</span>
              old-ropt
              mac-right-option-modifier)))
 (<span class="org-keyword">defun</span> <span class="org-function-name">help/toggle-mac-function-modifier</span> ()
   <span class="org-doc">"Toggle between passing function modifier either to Emacs or OS X."</span>
   (<span class="org-keyword">interactive</span>)
   (<span class="org-keyword">let</span> ((old-func mac-function-modifier))
     (<span class="org-keyword">setq</span> mac-function-modifier
           (<span class="org-keyword">if</span> (eq mac-function-modifier <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">hyper</span>)
               <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">none</span>
             <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">hyper</span>))
     (message <span class="org-string">"Toggled `</span><span class="org-string"><span class="org-constant">mac-function-modifier</span></span><span class="org-string">' from %s to %s."</span>
              old-func
              mac-function-modifier))))
</pre>
</div>

<p>
EMACS dialogues don&rsquo;t work OSX. They lock up EMACS.
</p>

<p>
This is a known issue. <a href="https://superuser.com/questions/125569/how-to-fix-emacs-popup-dialogs-on-mac-os-x">Here</a> is the solution.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgc3b918b">(<span class="org-keyword">help/on-osx</span>
 (<span class="org-keyword">defun</span> <span class="org-function-name">help/yes-or-no-p</span> (orig-fun <span class="org-type">&amp;rest</span> args)
   <span class="org-doc">"Prevent yes-or-no-p from activating a dialog."</span>
   (<span class="org-keyword">let</span> ((use-dialog-box nil))
     (apply orig-fun args)))
 (advice-add <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">yes-or-no-p</span> <span class="org-builtin">:around</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/yes-or-no-p</span>)
 (advice-add <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">y-or-n-p</span> <span class="org-builtin">:around</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/yes-or-no-p</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf0cbc45" class="outline-3">
<h3 id="orgf0cbc45"><span class="section-number-3">2.8</span> Windows</h3>
<div class="outline-text-3" id="text-2-8">
<pre class="example">
ID: org_gcr_2017-05-12_mara:F59CD0F9-9B04-493E-AA9A-2471F2ED0A05
</pre>

<p>
Make it easy to evaluate code only when running on Windows.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orge108951">(<span class="org-keyword">defmacro</span> <span class="org-function-name">help/on-windows</span> (statement <span class="org-type">&amp;rest</span> statements)
  <span class="org-doc">"Evaluate the enclosed body only when run on Microsoft Windows."</span>
  <span class="org-highlight-quoted-quote">`</span>(<span class="org-keyword">when</span> (eq system-type <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">windows-nt</span>)
     ,statement
     ,@statements))
</pre>
</div>

<p>
Provide the proper shell.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org6b73a09">(<span class="org-keyword">help/on-windows</span>
 (<span class="org-keyword">setq</span> shell-file-name <span class="org-string">"cmdproxy.exe"</span>))
</pre>
</div>

<p>
Enable the <code>super</code> key-space.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgad10c43">(<span class="org-keyword">help/on-windows</span>
 (<span class="org-keyword">setq</span> w32-pass-lwindow-to-system nil)
 (<span class="org-keyword">defvar</span> <span class="org-variable-name">w32-lwindow-modifier</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">super</span>)
 (<span class="org-keyword">setq</span> w32-pass-rwindow-to-system nil)
 (<span class="org-keyword">defvar</span> <span class="org-variable-name">w32-rwindow-modifier</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">super</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd099992" class="outline-3">
<h3 id="orgd099992"><span class="section-number-3">2.9</span> Linux</h3>
<div class="outline-text-3" id="text-2-9">
<pre class="example">
ID: org_gcr_2017-07-23_mara:7D02C86B-CDBE-466B-9647-3EDA6DB016C6
</pre>
<p>
Make it easy to evaluate code only when running on .
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org269256e">(<span class="org-keyword">defmacro</span> <span class="org-function-name">help/on-gnu/linux</span> (statement <span class="org-type">&amp;rest</span> statements)
  <span class="org-doc">"Evaluate the enclosed body only when run on GNU/Linux"</span>
  <span class="org-highlight-quoted-quote">`</span>(<span class="org-keyword">when</span> (eq system-type <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">gnu/linux</span>)
     ,statement
     ,@statements))

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgabea4f5" class="outline-2">
<h2 id="orgabea4f5"><span class="section-number-2">3</span> Standard Operating Procedure</h2>
<div class="outline-text-2" id="text-3">
<pre class="example">
ID: org_gcr_2017-05-12_mara:205571BA-2DC4-4DCB-912C-65B9EC843574
</pre>

<p>
Configure EMACS to maximum utility.
</p>
</div>
