help.html

<div id="outline-container-org2cd7c0e" class="outline-3">
<h3 id="org2cd7c0e"><span class="section-number-3">3.1</span> Helper Functions</h3>
<div class="outline-text-3" id="text-3-1">
<pre class="example">
ID: org_gcr_2017-05-12_mara:1E88DD48-B992-46E1-B49F-EB8071E8EC37
</pre>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgda64eee">(<span class="org-keyword">defun</span> <span class="org-function-name">help/save-all-file-buffers</span> ()
  <span class="org-doc">"Saves every buffer associated with a file."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">dolist</span> (buf (buffer-list))
    (<span class="org-keyword">with-current-buffer</span> buf
      (<span class="org-keyword">when</span> (<span class="org-keyword">and</span> (buffer-file-name) (buffer-modified-p))
        (save-buffer)))))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/kill-other-buffers</span> ()
  <span class="org-doc">"Kill all other buffers."</span>
  (<span class="org-keyword">interactive</span>)
  (mapc <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">kill-buffer</span> (delq (current-buffer) (buffer-list))))

(<span class="org-keyword">defvar</span> <span class="org-variable-name">help/delete-trailing-whitespace-p</span> t
  <span class="org-doc">"Should trailing whitespace be removed?"</span>)

(<span class="org-keyword">defun</span> <span class="org-function-name">help/delete-trailing-whitespace</span> ()
  <span class="org-doc">"Delete trailing whitespace for everything but the current line.</span>

<span class="org-doc">If `</span><span class="org-doc"><span class="org-constant">help/delete-trailing-whitespace-p</span></span><span class="org-doc">' is non-nil, then delete the whitespace.</span>
<span class="org-doc">This is useful for fringe cases where trailing whitespace is important."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">when</span> help/delete-trailing-whitespace-p
    (<span class="org-keyword">let</span> ((first-part-start (point-min))
          (first-part-end (point-at-bol))
          (second-part-start (point-at-eol))
          (second-part-end (point-max)))
      (delete-trailing-whitespace first-part-start first-part-end)
      (delete-trailing-whitespace second-part-start second-part-end))))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/insert-timestamp</span> ()
  <span class="org-doc">"Produces and inserts a full ISO 8601 format timestamp."</span>
  (<span class="org-keyword">interactive</span>)
  (insert (format-time-string <span class="org-string">"%Y-%m-%dT%T%z"</span>)))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/insert-timestamp*</span> ()
  <span class="org-doc">"Produces and inserts a near-full ISO 8601 format timestamp."</span>
  (<span class="org-keyword">interactive</span>)
  (insert (format-time-string <span class="org-string">"%Y-%m-%dT%T"</span>)))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/insert-timestamp*-no-colons</span> ()
  <span class="org-doc">"Produces and inserts a near-full ISO 8601-like format timestamp."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let*</span> ((str (format-time-string <span class="org-string">"%Y-%m-%dT%T"</span>))
         (fnl (s-replace <span class="org-string">":"</span> <span class="org-string">"-"</span> str)))
    (insert fnl)))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/insert-datestamp</span> ()
  <span class="org-doc">"Produces and inserts a partial ISO 8601 format timestamp."</span>
  (<span class="org-keyword">interactive</span>)
  (insert (format-time-string <span class="org-string">"%Y-%m-%d"</span>)))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/indent-curly-block</span> (<span class="org-type">&amp;rest</span> _ignored)
  <span class="org-doc">"Open a new brace or bracket expression, with relevant newlines and indent. URL: `</span><span class="org-doc"><span class="org-constant">https://github.com/Fuco1/smartparens/issues/80</span></span><span class="org-doc">'"</span>
  (<span class="org-keyword">interactive</span>)
  (newline)
  (indent-according-to-mode)
  (forward-line -1)
  (indent-according-to-mode))

(<span class="org-keyword">defun</span> <span class="org-function-name">beginning-of-line-dwim</span> ()
  <span class="org-doc">"Toggles between moving point to the first non-whitespace character, and</span>
<span class="org-doc">    the start of the line. Src: http://www.wilfred.me.uk/"</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let</span> ((start-position (point)))
    <span class="org-comment-delimiter">;; </span><span class="org-comment">see if going to the beginning of the line changes our position</span>
    (move-beginning-of-line nil)

    (<span class="org-keyword">when</span> (= (point) start-position)
      <span class="org-comment-delimiter">;; </span><span class="org-comment">we're already at the beginning of the line, so go to the</span>
      <span class="org-comment-delimiter">;; </span><span class="org-comment">first non-whitespace character</span>
      (back-to-indentation))))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/lazy-new-open-line</span> ()
  <span class="org-doc">"Insert a new line without breaking the current line."</span>
  (<span class="org-keyword">interactive</span>)
  (beginning-of-line)
  (forward-line 1)
  (newline)
  (forward-line -1))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/smart-open-line</span> ()
  <span class="org-doc">"Insert a new line, indent it, and move the cursor there.</span>

<span class="org-doc">This behavior is different then the typical function bound to return</span>
<span class="org-doc">which may be `</span><span class="org-doc"><span class="org-constant">open-line</span></span><span class="org-doc">' or `</span><span class="org-doc"><span class="org-constant">newline-and-indent</span></span><span class="org-doc">'. When you call with</span>
<span class="org-doc">the cursor between ^ and $, the contents of the line to the right of</span>
<span class="org-doc">it will be moved to the newly inserted line. This function will not</span>
<span class="org-doc">do that. The current line is left alone, a new line is inserted, indented,</span>
<span class="org-doc">and the cursor is moved there.</span>

<span class="org-doc">Attribution: URL `</span><span class="org-doc"><span class="org-constant">http://emacsredux.com/blog/2013/03/26/smarter-open-line/</span></span><span class="org-doc">'"</span>
  (<span class="org-keyword">interactive</span>)
  (move-end-of-line nil)
  (newline-and-indent))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/insert-ellipsis</span> ()
  <span class="org-doc">"Insert an ellipsis into the current buffer."</span>
  (<span class="org-keyword">interactive</span>)
  (insert <span class="org-string">"\dots{}"</span>))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/insert-checkmark</span> ()
  <span class="org-doc">"Insert a checkmark into the current buffer."</span>
  (<span class="org-keyword">interactive</span>)
  (insert <span class="org-string">"\checkmark{}"</span>))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/insert-noticeable-snip-comment-line</span> ()
  <span class="org-doc">"Insert a noticeable snip comment line (NSCL)."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">if</span> (not (bolp))
      (message <span class="org-string">"I may only insert a NSCL at the beginning of a line."</span>)
    (<span class="org-keyword">let</span> ((ncl (make-string 70 ?&#9986;)))
      (newline)
      (forward-line -1)
      (insert ncl)
      (comment-or-uncomment-region (line-beginning-position) (line-end-position)))))

(<span class="org-keyword">progn</span>

  (<span class="org-keyword">defvar</span> <span class="org-variable-name">my-read-expression-map</span>
    (<span class="org-keyword">let</span> ((map (make-sparse-keymap)))
      (set-keymap-parent map read-expression-map)
      (define-key map [(control ?g)] <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">minibuffer-keyboard-quit</span>)
      (define-key map [up]   nil)
      (define-key map [down] nil)
      map))

  (<span class="org-keyword">defun</span> <span class="org-function-name">my-read--expression</span> (prompt <span class="org-type">&amp;optional</span> initial-contents)
    (<span class="org-keyword">let</span> ((minibuffer-completing-symbol t))
      (<span class="org-keyword">minibuffer-with-setup-hook</span>
          (<span class="org-keyword">lambda</span> ()
            (emacs-lisp-mode)
            (use-local-map my-read-expression-map)
            (<span class="org-keyword">setq</span> font-lock-mode t)
            (funcall font-lock-function 1))
        (read-from-minibuffer prompt initial-contents
                              my-read-expression-map nil
                              <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">read-expression-history</span>))))

  (<span class="org-keyword">defun</span> <span class="org-function-name">my-eval-expression</span> (expression <span class="org-type">&amp;optional</span> arg)
    <span class="org-doc">"Attribution: URL `</span><span class="org-doc"><span class="org-constant">https://lists.gnu.org/archive/html/help-gnu-emacs/2014-07/msg00135.html</span></span><span class="org-doc">'."</span>
    (<span class="org-keyword">interactive</span> (list (read (my-read--expression <span class="org-string">""</span>))
                       current-prefix-arg))
    (<span class="org-keyword">if</span> arg
        (insert (pp-to-string (eval expression lexical-binding)))
      (pp-display-expression (eval expression lexical-binding)
                             <span class="org-string">"*Pp Eval Output*"</span>))))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/util-ielm</span> ()
  <span class="org-doc">"HELP buffer setup for ielm.</span>

<span class="org-doc">Creates enough space for one other permanent buffer beneath it."</span>
  (<span class="org-keyword">interactive</span>)
  (split-window-below -20)
  (help/safb-other-window)
  (ielm)
  (set-window-dedicated-p (selected-window) t))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/util-eshell</span> ()
  <span class="org-doc">"HELP buffer setup for eshell.</span>

<span class="org-doc">Depends upon `</span><span class="org-doc"><span class="org-constant">help/util-ielm</span></span><span class="org-doc">' being run first."</span>
  (<span class="org-keyword">interactive</span>)
  (split-window-below -10)
  (help/safb-other-window)
  (eshell)
  (set-window-dedicated-p (selected-window) t))

(<span class="org-keyword">defvar</span> <span class="org-variable-name">help/util-state</span> nil <span class="org-doc">"Track whether the util buffers are displayed or not."</span>)

(<span class="org-keyword">defun</span> <span class="org-function-name">help/util-state-toggle</span> ()
  <span class="org-doc">"Toggle the util state."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">setq</span> help/util-state (not help/util-state)))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/util-start</span> ()
  <span class="org-doc">"Perhaps utility buffers."</span>
  (<span class="org-keyword">interactive</span>)
  (help/util-ielm)
  (help/util-eshell)
  (help/util-state-toggle))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/util-stop</span> ()
  <span class="org-doc">"Remove personal utility buffers."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">if</span> (get-buffer <span class="org-string">"*ielm*"</span>) (kill-buffer <span class="org-string">"*ielm*"</span>))
  (<span class="org-keyword">if</span> (get-buffer <span class="org-string">"*eshell*"</span>) (kill-buffer <span class="org-string">"*eshell*"</span>))
  (help/util-state-toggle))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/ielm-auto-complete</span> ()
  <span class="org-doc">"Enables `</span><span class="org-doc"><span class="org-constant">auto-complete</span></span><span class="org-doc">' support in \\[</span><span class="org-doc"><span class="org-constant">ielm</span></span><span class="org-doc">].</span>

<span class="org-doc">Attribution: URL `</span><span class="org-doc"><span class="org-constant">http://www.masteringemacs.org/articles/2010/11/29/evaluating-elisp-emacs/</span></span><span class="org-doc">'"</span>
  (<span class="org-keyword">setq</span> ac-sources <span class="org-highlight-quoted-quote">'</span>(ac-source-functions
                     ac-source-variables
                     ac-source-features
                     ac-source-symbols
                     ac-source-words-in-same-mode-buffers))
  (add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">ac-modes</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">inferior-emacs-lisp-mode</span>)
  (auto-complete-mode 1))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/uuid</span> ()
  <span class="org-doc">"Insert a UUID."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let</span> ((org-id-prefix nil))
    (insert (org-id-new))))

(<span class="org-keyword">defun</span> <span class="org-function-name">endless/sharp</span> ()
  <span class="org-doc">"Insert #' unless in a string or comment.</span>

<span class="org-doc">SRC: URL `</span><span class="org-doc"><span class="org-constant">http://endlessparentheses.com/get-in-the-habit-of-using-sharp-quote.html?source=rss</span></span><span class="org-doc">'"</span>
  (<span class="org-keyword">interactive</span>)
  (call-interactively <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">self-insert-command</span>)
  (<span class="org-keyword">let</span> ((ppss (syntax-ppss)))
    (<span class="org-keyword">unless</span> (<span class="org-keyword">or</span> (elt ppss 3)
                (elt ppss 4))
      (insert <span class="org-string">"'"</span>))))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/chs</span> ()
  <span class="org-doc">"Insert opening \"cut here start\" snippet."</span>
  (<span class="org-keyword">interactive</span>)
  (insert <span class="org-string">"--8&lt;---------------cut here---------------start-------------&gt;8---"</span>))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/che</span> ()
  <span class="org-doc">"Insert closing \"cut here end\" snippet."</span>
  (<span class="org-keyword">interactive</span>)
  (insert <span class="org-string">"--8&lt;---------------cut here---------------end---------------&gt;8---"</span>))

(<span class="org-keyword">defmacro</span> <span class="org-function-name">help/measure-time</span> (<span class="org-type">&amp;rest</span> body)
  <span class="org-doc">"Measure the time it takes to evaluate BODY.</span>

<span class="org-doc">Attribution Nikolaj Schumacher: URL `</span><span class="org-doc"><span class="org-constant">https://lists.gnu.org/archive/html/help-gnu-emacs/2008-06/msg00087.html</span></span><span class="org-doc">'"</span>
  <span class="org-highlight-quoted-quote">`</span>(<span class="org-keyword">let</span> ((time (current-time)))
     ,@body
     (message <span class="org-string">"%.06f"</span> (float-time (time-since time)))))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/create-non-existent-directory</span> ()
  <span class="org-doc">"Attribution URL: `</span><span class="org-doc"><span class="org-constant">https://iqbalansari.github.io/blog/2014/12/07/automatically-create-parent-directories-on-visiting-a-new-file-in-emacs/</span></span><span class="org-doc">'"</span>
  (<span class="org-keyword">let</span> ((parent-directory (file-name-directory buffer-file-name)))
    (<span class="org-keyword">when</span> (<span class="org-keyword">and</span> (not (file-exists-p parent-directory))
               (y-or-n-p (format <span class="org-string">"Directory `</span><span class="org-string"><span class="org-constant">%s</span></span><span class="org-string">' does not exist. Create it?"</span> parent-directory)))
      (make-directory parent-directory t))))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/occur-dwim</span> ()
  <span class="org-doc">"Call `</span><span class="org-doc"><span class="org-constant">occur</span></span><span class="org-doc">' with a mostly sane default.</span>

<span class="org-doc">Attribution Oleh Krehel (abo-abo): URL `</span><span class="org-doc"><span class="org-constant">http://oremacs.com/2015/01/26/occur-dwim/</span></span><span class="org-doc">'"</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">push</span> (<span class="org-keyword">if</span> (region-active-p)
            (buffer-substring-no-properties
             (region-beginning)
             (region-end))
          (<span class="org-keyword">let</span> ((sym (thing-at-point <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">symbol</span>)))
            (<span class="org-keyword">when</span> (stringp sym)
              (regexp-quote sym))))
        regexp-history)
  (call-interactively <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">occur</span>)
  (other-window 1))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/util-cycle</span> ()
  <span class="org-doc">"Display or hide the utility buffers."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">if</span> help/util-state
      (help/util-stop)
    (help/util-start)))

(<span class="org-keyword">defun</span> <span class="org-function-name">sacha/unfill-paragraph</span> (<span class="org-type">&amp;optional</span> region)
  <span class="org-doc">"Takes a multi-line paragraph and makes it into a single line of text.</span>

<span class="org-doc">Attribuation: URL https://github.com/sachac/.emacs.d/blob/gh-pages/Sacha.org#unfill-paragraph"</span>
  (<span class="org-keyword">interactive</span> (<span class="org-keyword">progn</span>
                 (barf-if-buffer-read-only)
                 (list t)))
  (<span class="org-keyword">let</span> ((fill-column (point-max)))
    (fill-paragraph nil region)))
(<span class="org-keyword">defun</span> <span class="org-function-name">help/text-scale-increase</span> ()
  <span class="org-doc">"Increase font size"</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">help/on-gui</span>
   (<span class="org-keyword">setq</span> help/font-size-current (+ help/font-size-current 1))
   (help/update-font))
  (<span class="org-keyword">help/not-on-gui</span>
   (message <span class="org-string">"Please resize the terminal emulator font."</span>)))
(<span class="org-keyword">defun</span> <span class="org-function-name">help/text-scale-decrease</span> ()
  <span class="org-doc">"Reduce font size."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">help/on-gui</span>
   (<span class="org-keyword">when</span> (&gt; help/font-size-current 1)
     (<span class="org-keyword">setq</span> help/font-size-current (- help/font-size-current 1))
     (help/update-font)))
  (<span class="org-keyword">help/not-on-gui</span>
   (message <span class="org-string">"Please resize the terminal emulator font."</span>)))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/org-weave-subtree-gfm</span> (id file)
  <span class="org-doc">"Export the subtree with ID to FILE in gfm."</span>
  (<span class="org-keyword">interactive</span>)
  (help/save-all-file-buffers)
  (<span class="org-keyword">save-excursion</span>
    (<span class="org-keyword">let</span> ((hidx (org-find-property <span class="org-string">"ID"</span> id)))
      (<span class="org-keyword">when</span> hidx
        (goto-char hidx)
        (org-export-to-file <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">gfm</span> file nil t nil)))))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/org-weave-gfm</span> (id)
  <span class="org-doc">"Select an ID to export to the same name as Github Flavored Markdown.."</span>
  (<span class="org-keyword">interactive</span> <span class="org-string">"sEnter the ID to export: "</span>)
  (help/org-weave-subtree-gfm id (s-prepend id <span class="org-string">".md"</span>)))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/org-weave-readme</span> ()
  (<span class="org-keyword">interactive</span>)
  (help/org-weave-subtree-gfm
   <span class="org-string">"orgmode:gcr:vela:README"</span>
   <span class="org-string">"README.md"</span>))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/org-weave-style-guide</span> ()
  (<span class="org-keyword">interactive</span>)
  (help/org-weave-subtree-gfm
   <span class="org-string">"orgmode:gcr:vela:STYLEGUIDE"</span>
   <span class="org-string">"STYLEGUIDE.md"</span>))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/weave-everything-everywhere</span> ()
  <span class="org-doc">"Export this entire document in configured weavers."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">save-excursion</span>
    (org-ascii-export-to-ascii)
    (org-html-export-to-html)
    (org-gfm-export-to-markdown)
    (org-latex-export-to-pdf))
  (help/org-weave-readme)
  (help/org-weave-style-guide))

(<span class="org-keyword">require</span> <span class="org-highlight-quoted-quote">'</span><span class="org-constant">thingatpt</span>)

(<span class="org-keyword">defun</span> <span class="org-function-name">thing-at-point-goto-end-of-integer</span> ()
  <span class="org-doc">"Go to end of integer at point.</span>

<span class="org-doc">Attribution: URL `</span><span class="org-doc"><span class="org-constant">http://emacsredux.com/blog/2013/07/25/increment-and-decrement-integer-at-point/</span></span><span class="org-doc">'"</span>
  (<span class="org-keyword">let</span> ((inhibit-changing-match-data t))
    <span class="org-comment-delimiter">;; </span><span class="org-comment">Skip over optional sign</span>
    (<span class="org-keyword">when</span> (looking-at <span class="org-string">"[+-]"</span>)
      (forward-char 1))
    <span class="org-comment-delimiter">;; </span><span class="org-comment">Skip over digits</span>
    (skip-chars-forward <span class="org-string">"[[:digit:]]"</span>)
    <span class="org-comment-delimiter">;; </span><span class="org-comment">Check for at least one digit</span>
    (<span class="org-keyword">unless</span> (looking-back <span class="org-string">"[[:digit:]]"</span>)
      (<span class="org-warning">error</span> <span class="org-string">"No integer here"</span>))))
(put <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">integer</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">beginning-op</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">thing-at-point-goto-end-of-integer</span>)

(<span class="org-keyword">defun</span> <span class="org-function-name">thing-at-point-goto-beginning-of-integer</span> ()
  <span class="org-doc">"Go to end of integer at point.</span>

<span class="org-doc">Attribution: URL `</span><span class="org-doc"><span class="org-constant">http://emacsredux.com/blog/2013/07/25/increment-and-decrement-integer-at-point/</span></span><span class="org-doc">'"</span>
  (<span class="org-keyword">let</span> ((inhibit-changing-match-data t))
    <span class="org-comment-delimiter">;; </span><span class="org-comment">Skip backward over digits</span>
    (skip-chars-backward <span class="org-string">"[[:digit:]]"</span>)
    <span class="org-comment-delimiter">;; </span><span class="org-comment">Check for digits and optional sign</span>
    (<span class="org-keyword">unless</span> (looking-at <span class="org-string">"[+-]?[[:digit:]]"</span>)
      (<span class="org-warning">error</span> <span class="org-string">"No integer here"</span>))
    <span class="org-comment-delimiter">;; </span><span class="org-comment">Skip backward over optional sign</span>
    (<span class="org-keyword">when</span> (looking-back <span class="org-string">"[+-]"</span>)
      (backward-char 1))))
(put <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">integer</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">beginning-op</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">thing-at-point-goto-beginning-of-integer</span>)

(<span class="org-keyword">defun</span> <span class="org-function-name">thing-at-point-bounds-of-integer-at-point</span> ()
  <span class="org-doc">"Get boundaries of integer at point.</span>

<span class="org-doc">Attribution: URL `</span><span class="org-doc"><span class="org-constant">http://emacsredux.com/blog/2013/07/25/increment-and-decrement-integer-at-point/</span></span><span class="org-doc">'"</span>
  (<span class="org-keyword">save-excursion</span>
    (<span class="org-keyword">let</span> (beg end)
      (thing-at-point-goto-beginning-of-integer)
      (<span class="org-keyword">setq</span> beg (point))
      (thing-at-point-goto-end-of-integer)
      (<span class="org-keyword">setq</span> end (point))
      (cons beg end))))
(put <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">integer</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">bounds-of-thing-at-point</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">thing-at-point-bounds-of-integer-at-point</span>)

(<span class="org-keyword">defun</span> <span class="org-function-name">thing-at-point-integer-at-point</span> ()
  <span class="org-doc">"Get integer at point.</span>

<span class="org-doc">Attribution: URL `</span><span class="org-doc"><span class="org-constant">http://emacsredux.com/blog/2013/07/25/increment-and-decrement-integer-at-point/</span></span><span class="org-doc">'"</span>
  (<span class="org-keyword">let</span> ((bounds (bounds-of-thing-at-point <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">integer</span>)))
    (string-to-number (buffer-substring (car bounds) (cdr bounds)))))
(put <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">integer</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">thing-at-point</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">thing-at-point-integer-at-point</span>)

(<span class="org-keyword">defun</span> <span class="org-function-name">increment-integer-at-point</span> (<span class="org-type">&amp;optional</span> inc)
  <span class="org-doc">"Increment integer at point by one.</span>

<span class="org-doc">With numeric prefix arg INC, increment the integer by INC amount.</span>

<span class="org-doc">Attribution: URL `</span><span class="org-doc"><span class="org-constant">http://emacsredux.com/blog/2013/07/25/increment-and-decrement-integer-at-point/</span></span><span class="org-doc">'"</span>
  (<span class="org-keyword">interactive</span> <span class="org-string">"p"</span>)
  (<span class="org-keyword">let</span> ((inc (<span class="org-keyword">or</span> inc 1))
        (n (thing-at-point <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">integer</span>))
        (bounds (bounds-of-thing-at-point <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">integer</span>)))
    (delete-region (car bounds) (cdr bounds))
    (insert (int-to-string (+ n inc)))))

(<span class="org-keyword">defun</span> <span class="org-function-name">decrement-integer-at-point</span> (<span class="org-type">&amp;optional</span> dec)
  <span class="org-doc">"Decrement integer at point by one.</span>

<span class="org-doc">With numeric prefix arg DEC, decrement the integer by DEC amount.</span>

<span class="org-doc">Attribution: URL `</span><span class="org-doc"><span class="org-constant">http://emacsredux.com/blog/2013/07/25/increment-and-decrement-integer-at-point/</span></span><span class="org-doc">'"</span>
  (<span class="org-keyword">interactive</span> <span class="org-string">"p"</span>)
  (increment-integer-at-point (- (<span class="org-keyword">or</span> dec 1))))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/reformat-file</span> (file)
  <span class="org-doc">"Reformat a file. If it is attached to an existing buffer then use it and</span>
<span class="org-doc">  revert it.</span>

<span class="org-doc">Attribution: URL `https://www.emacswiki.org/emacs/ElispCookbook#toc46'."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">with-current-buffer</span> (find-file-noselect file)
    (revert-buffer t t)
    (<span class="org-keyword">with-temp-message</span> <span class="org-string">"Formatting file..."</span>
      (indent-region (point-min) (point-max) nil))
    (message <span class="org-string">"Formatting file done"</span>)))

(<span class="org-keyword">defun</span> <span class="org-function-name">switch-to-previous-buffer</span> ()
  <span class="org-doc">"Switch to most recent buffer. Repeated calls toggle back and forth between the most recent two buffers.</span>

<span class="org-doc">Attribution: URL `</span><span class="org-doc"><span class="org-constant">http://pragmaticemacs.com/emacs/toggle-between-most-recent-buffers/</span></span><span class="org-doc">'</span>

<span class="org-doc">Attribution: URL `https://www.emacswiki.org/emacs/SwitchingBuffers#toc5'"</span>
  (<span class="org-keyword">interactive</span>)
  (switch-to-buffer (other-buffer (current-buffer) 1)))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/dos2unix</span> ()
  <span class="org-doc">"Not exactly but it's easier to remember.</span>

<span class="org-doc">Attribution: URL `</span><span class="org-doc"><span class="org-constant">https://www.emacswiki.org/emacs/DosToUnix</span></span><span class="org-doc">'"</span>
  (<span class="org-keyword">interactive</span>)
  (set-buffer-file-coding-system <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">unix</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">t</span>) )

(<span class="org-keyword">defun</span> <span class="org-function-name">help/preview-buffer-file-in-marked-2</span> ()
  <span class="org-doc">"View buffer file in Marked 2.</span>

<span class="org-doc">Attribution: URL</span>
<span class="org-doc">`</span><span class="org-doc"><span class="org-constant">https://github.com/kotfu/marked-bonus-pack/blob/master/Emacs/dot.emacs.txt</span></span><span class="org-doc">'"</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">help/on-osx</span>
   (shell-command
    (format <span class="org-string">"open -a 'Marked 2.app' %s"</span>
            (shell-quote-argument (buffer-file-name))))))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/safb-flycheck-list-errors</span> ()
  <span class="org-doc">"Save all file buffers and switch to flycheck error list"</span>
  (<span class="org-keyword">interactive</span>)
  (help/save-all-file-buffers)
  (flycheck-list-errors)
  (other-window 1))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/safb-kill-this-buffer</span> ()
  <span class="org-doc">"Save all file buffers and maybe kill this buffer."</span>
  (<span class="org-keyword">interactive</span>)
  (help/save-all-file-buffers)
  (kill-this-buffer))

(<span class="org-keyword">defmacro</span> <span class="org-function-name">help/profile-org</span> (times <span class="org-type">&amp;rest</span> body)
  <span class="org-doc">"Makes profiling Org-Mode easy by automatically instrumenting the desired</span>
<span class="org-doc">  functions, running the code you want to test, removing the instrumentation,</span>
<span class="org-doc">  and presenting the results.</span>

<span class="org-doc">Attribution: Adam Porter <a href="mailto:adam%40alphapapa.net">&lt;adam@alphapapa.net&gt;</a>"</span>
  <span class="org-highlight-quoted-quote">`</span>(<span class="org-keyword">let</span> (output)
     (<span class="org-keyword">dolist</span> (p <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">"org-"</span>))  <span class="org-comment-delimiter">; </span><span class="org-comment">symbol prefixes to instrument</span>
       (elp-instrument-package p))
     (<span class="org-keyword">dotimes</span> (x ,times)
       ,@body)
     (elp-results)
     (elp-restore-all)
     (point-min)
     (forward-line 20)
     (delete-region (point) (point-max))
     (<span class="org-keyword">setq</span> output (buffer-substring-no-properties (point-min) (point-max)))
     (kill-buffer)
     (delete-window)
     output))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/open-help</span> ()
  <span class="org-doc">"Switch to the buffer backed by `</span><span class="org-doc"><span class="org-constant">help/help.org</span></span><span class="org-doc">'."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">if</span> (get-buffer <span class="org-string">"help/help.org"</span>)
      (switch-to-buffer <span class="org-string">"help/help.org"</span>)))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/open-projects</span> ()
  <span class="org-doc">"Switch to the buffer backed by `</span><span class="org-doc"><span class="org-constant">bitbucket/projects.org</span></span><span class="org-doc">'."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">if</span> (get-buffer <span class="org-string">"bitbucket/projects.org"</span>)
      (switch-to-buffer <span class="org-string">"bitbucket/projects.org"</span>)))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/open-si-projects</span> ()
  <span class="org-doc">"Switch to the buffer backed by `</span><span class="org-doc"><span class="org-constant">bitbucket-gcrstoneisle/projects.org</span></span><span class="org-doc">'."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">if</span> (get-buffer <span class="org-string">"bitbucket-gcrstoneisle/projects.org"</span>)
      (switch-to-buffer <span class="org-string">"bitbucket-gcrstoneisle/projects.org"</span>)))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/move-file</span> (new-location)
  <span class="org-doc">"Write this file to NEW-LOCATION, and delete the old one.</span>

<span class="org-doc">Attribution: URL `</span><span class="org-doc"><span class="org-constant">http://zck.me/emacs-move-file</span></span><span class="org-doc">'"</span>
  (<span class="org-keyword">interactive</span> (list (<span class="org-keyword">if</span> buffer-file-name
                         (read-file-name <span class="org-string">"Move file to: "</span>)
                       (read-file-name <span class="org-string">"Move file to: "</span>
                                       default-directory
                                       (expand-file-name (file-name-nondirectory (buffer-name))
                                                         default-directory)))))
  (<span class="org-keyword">when</span> (file-exists-p new-location)
    (delete-file new-location))
  (<span class="org-keyword">let</span> ((old-location (buffer-file-name)))
    (write-file new-location t)
    (<span class="org-keyword">when</span> (<span class="org-keyword">and</span> old-location
             (file-exists-p new-location)
             (not (string-equal old-location new-location)))
      (delete-file old-location))))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/rename-current-buffer-file</span> ()
  <span class="org-doc">"Renames current buffer and file it is visiting.</span>

<span class="org-doc">Attribution: `</span><span class="org-doc"><span class="org-constant">http://stackoverflow.com/a/25212377</span></span><span class="org-doc">'"</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let</span> ((name (buffer-name))
        (filename (buffer-file-name)))
    (<span class="org-keyword">if</span> (not (<span class="org-keyword">and</span> filename (file-exists-p filename)))
        (<span class="org-warning">error</span> <span class="org-string">"Buffer '%s' is not visiting a file!"</span> name)
      (<span class="org-keyword">let</span> ((new-name (read-file-name <span class="org-string">"New name: "</span> filename)))
        (<span class="org-keyword">if</span> (get-buffer new-name)
            (<span class="org-warning">error</span> <span class="org-string">"A buffer named '%s' already exists!"</span> new-name)
          (rename-file filename new-name 1)
          (rename-buffer new-name)
          (set-visited-file-name new-name)
          (set-buffer-modified-p nil)
          (message <span class="org-string">"File '%s' successfully renamed to '%s'"</span>
                   name (file-name-nondirectory new-name)))))))


(<span class="org-keyword">defun</span> <span class="org-function-name">help/sort-lines-ignore-case</span> ()
  <span class="org-doc">"Sort lines ignoring case.</span>

<span class="org-doc">Attribution: `</span><span class="org-doc"><span class="org-constant">https://stackoverflow.com/questions/20967818/emacs-function-to-case-insensitive-sort-lines</span></span><span class="org-doc">'"</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let</span> ((sort-fold-case t))
    (call-interactively <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">sort-lines</span>)))


(<span class="org-keyword">defun</span> <span class="org-function-name">help/delete-this-buffer-and-file</span> ()
  <span class="org-doc">"Deletes file connected to this buffer and kills this buffer.</span>

<span class="org-doc">Attribution: URL `</span><span class="org-doc"><span class="org-constant">https://rejeep.github.io/emacs/elisp/2010/11/16/delete-file-and-buffer-in-emacs.html</span></span><span class="org-doc">'"</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let</span> ((filename (buffer-file-name))
        (buffer (current-buffer))
        (name (buffer-name)))
    (<span class="org-keyword">if</span> (not (<span class="org-keyword">and</span> filename (file-exists-p filename)))
        (<span class="org-warning">error</span> <span class="org-string">"Nothing to delete: '%s' is not visiting a file."</span> name)
      (<span class="org-keyword">when</span> (yes-or-no-p <span class="org-string">"Are you sure you want to delete this file? "</span>)
        (delete-file filename)
        (kill-buffer buffer)
        (message <span class="org-string">"File '%s' successfully deleted."</span> filename)))))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/wih</span> ()
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">when</span> (use-region-p) (call-interactively <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">kill-region</span>))
  (insert <span class="org-string">"#+CATEGORY: Article</span>
<span class="org-string">#+TAGS: Yoga, philosophy, Health, Happiness,</span>
<span class="org-string">#+TITLE:"</span>))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/wio</span> ()
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">when</span> (use-region-p) (call-interactively <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">kill-region</span>))
  (insert <span class="org-string">"#+CATEGORY: Article</span>
<span class="org-string">#+TAGS: Babel, Emacs, Ide, Lisp, Literate Programming, Programming Language, Reproducible research, elisp, org-mode</span>
<span class="org-string">#+TITLE:"</span>))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/wip</span> ()
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">when</span> (use-region-p) (call-interactively <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">kill-region</span>))
  (<span class="org-keyword">let</span> ((name (read-string <span class="org-string">"Programming language name? "</span>)))
    (insert (format
             <span class="org-string">"#+CATEGORY: Article</span>
<span class="org-string">#+TAGS: Programming Language, %s</span>
<span class="org-string">#+TITLE: (%s) "</span> name name))))

(<span class="org-keyword">defconst</span> <span class="org-variable-name">help/buffalo</span> <span class="org-string">"(&#128003;) Buffalo buffalo Buffalo buffalo buffalo buffalo Buffalo buffalo (&#128003;)"</span>
  <span class="org-doc">"URL: `</span><span class="org-doc"><span class="org-constant">https://en.wikipedia.org/wiki/Buffalo_buffalo_Buffalo_buffalo_buffalo_buffalo_Buffalo_buffalo</span></span><span class="org-doc">'"</span>)

(<span class="org-keyword">defun</span> <span class="org-function-name">help/safb/compile</span> ()
  <span class="org-doc">"Save all file buffers and call `</span><span class="org-doc"><span class="org-constant">compile</span></span><span class="org-doc">'"</span>
  (<span class="org-keyword">interactive</span>)
  (help/save-all-file-buffers)
  (call-interactively <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">compile</span>))
</pre>
</div>
</div>
</div>
