help.org
** Typography
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:A5224E7E-EBAA-4970-951F-7405F04D4A26
:END:

- Use 78 characters for a text document
  - Column 0 is the first possible character
  - Column 77 is the last possible character
  - Column 78 will always be empty
    - This is the fill column
    - This gives some spacing between the text body and the 80 column indicator
  - Column 79 will always be the fill column indicator
    - It *isn't* the fill column though
    - I want it to indicate 80 chars, typically the maximum number of columns
      for a line, to know how to size the window itself
    - Fci-Mode supports this
  - Store this as the fill column because all supporting functions will do the
    right thing here
#+NAME: org_gcr_2017-05-12_mara_7354096C-3F3A-408E-8F1C-79ABB054040F
#+BEGIN_SRC emacs-lisp
(defconst help/column-width 78)
(setq-default fill-column help/column-width)
#+END_SRC

Two spaces follow a colon

Two spaces after a semi-colon.

One space after comma.

#+NAME: org_gcr_2017-05-12_mara_38909B55-115D-44E4-B84F-70285016BF92
#+BEGIN_SRC emacs-lisp
(setq colon-double-space nil)
#+END_SRC
