help.html

<div id="outline-container-orge832b5a" class="outline-3">
<h3 id="orge832b5a"><span class="section-number-3">3.2</span> Typography</h3>
<div class="outline-text-3" id="text-3-2">
<pre class="example">
ID: org_gcr_2017-05-12_mara:A5224E7E-EBAA-4970-951F-7405F04D4A26
</pre>

<ul class="org-ul">
<li>Use 78 characters for a text document
<ul class="org-ul">
<li>Column 0 is the first possible character</li>
<li>Column 77 is the last possible character</li>
<li>Column 78 will always be empty
<ul class="org-ul">
<li>This is the fill column</li>
<li>This gives some spacing between the text body and the 80 column indicator</li>
</ul></li>
<li>Column 79 will always be the fill column indicator
<ul class="org-ul">
<li>It <b>isn&rsquo;t</b> the fill column though</li>
<li>I want it to indicate 80 chars, typically the maximum number of columns
for a line, to know how to size the window itself</li>
<li>Fci-Mode supports this</li>
</ul></li>
<li>Store this as the fill column because all supporting functions will do the
right thing here</li>
</ul></li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org9058250">(<span class="org-keyword">defconst</span> <span class="org-variable-name">help/column-width</span> 78)
(<span class="org-keyword">setq-default</span> fill-column help/column-width)
</pre>
</div>

<p>
Two spaces follow a colon
</p>

<p>
Two spaces after a semi-colon.
</p>

<p>
One space after comma.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgd12c920">(<span class="org-keyword">setq</span> colon-double-space nil)
</pre>
</div>
</div>
</div>
