help.org
** Buffer
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:D4FC68F9-CEA3-455A-B718-EBDB113CFA71
   :END:

Maintain buffers across sessions. Desktop-Save-Mode persists every part of the
buffer. If you upgrade a package that uses buffer-variables that have changed
you may get unexpected behavior. Close all buffers and open them again after
making such breaking changes.

#+NAME: org_gcr_2017-05-12_mara_1986C8FB-6C8F-43F6-811D-D95577160064
#+BEGIN_SRC emacs-lisp
(desktop-save-mode t)
(setq desktop-restore-eager 10)
#+END_SRC

Provide expected "Undo" functionality.

#+NAME: org_gcr_2017-05-12_mara_40A89EBE-247D-43B1-A606-896B172681D8
#+BEGIN_SRC emacs-lisp
(use-package undo-tree
  :ensure t
  :config
  (global-undo-tree-mode 1)
  (global-set-key (kbd "C-M-u") #'undo-tree-visualize)
  :diminish undo-tree-mode)
#+END_SRC

Ever file must end with a [[https://robots.thoughtbot.com/no-newline-at-end-of-file][newline]].

#+NAME: org_gcr_2017-05-12_mara_B41C6C0B-AC1A-44A4-9D0F-471A781BCA81
#+BEGIN_SRC emacs-lisp
(setq require-final-newline t)
#+END_SRC

If you are on the end of a line, and go up or down, then go to the end of
line on that new line. Do not account for anything special about the character
there.

#+NAME: org_gcr_2017-05-12_mara_60C775FC-0ACD-47E3-8724-8F4C48980081
#+BEGIN_SRC emacs-lisp
(setq track-eol t)
(setq line-move-visual nil)
#+END_SRC

Take the cursor with scroll activities.

#+NAME: org_gcr_2017-05-12_mara_6E2D611F-11F0-4703-AC88-AA11CEE56F8D
#+BEGIN_SRC emacs-lisp
(setq scroll-preserve-screen-position t)
#+END_SRC

Scroll text line-by-line as the cursor scrolls off of the screen. Nice to keep
the document from jumping around. Not nice for scrolling when you want to
quickly see the next ten or twenty lines. But ~recenter-top-bottom~ give you
that so you can have both features easily.

#+NAME: org_gcr_2017-05-12_mara_F6787724-7C59-4BD3-B436-0AB39E4F96E9
#+BEGIN_SRC emacs-lisp
(setq scroll-conservatively 101)
#+END_SRC

More easily visualize tabular data. Considered to non-subjective.

#+NAME: org_gcr_2017-05-12_mara_1BA609EB-C430-4CE0-BD33-9524EBB5A0AC
#+BEGIN_SRC emacs-lisp
(use-package stripe-buffer
  :ensure t)
#+END_SRC

End sentences with a single space.

#+NAME: org_gcr_2017-05-12_mara_1710CA80-60CB-4E40-94E9-C38A2E0A0DE9
#+BEGIN_SRC emacs-lisp
(setq sentence-end-double-space nil)
#+END_SRC

Ban white-space at end of lines, globally.

#+NAME: org_gcr_2017-05-12_mara_A04E6B4A-EFC6-4AE3-946B-E08CF4E02DD9
#+BEGIN_SRC emacs-lisp
(add-hook 'before-save-hook #'help/delete-trailing-whitespace)
#+END_SRC

Intelligently select the current char, then word, then object, then block,
then document.

#+NAME: org_gcr_2017-05-12_mara_14A9724E-F0E0-40CA-9FD8-142CB77B87BF
#+BEGIN_SRC emacs-lisp
(use-package expand-region
  :ensure t)
#+END_SRC

Configure Page-Break-Lines-Mode to visualize the formfeed character: ~C-q C-l~.

#+NAME: org_gcr_2017-05-12_mara_11CC1DCC-05D6-4564-A40B-DE2AD0A7C46D
#+BEGIN_SRC emacs-lisp
(use-package page-break-lines
  :diminish page-break-lines-mode
  :config
  (defun help/insert-formfeed ()
    (interactive)
    (insert "\f"))
  (global-set-key (kbd "C-M-<return>") #'help/insert-formfeed)
  (global-set-key (kbd "C-M-j") #'forward-page)
  (global-set-key (kbd "C-M-k") #'backward-page)
  (global-set-key (kbd "C-M-n") #'narrow-to-page)
  (global-set-key (kbd "C-M-h") #'mark-page))
#+END_SRC

Center the buffer after navigating pages.

#+NAME: org_gcr_2017-05-12_mara_87233BFD-A241-48A6-9113-B383B30F9BC5
#+BEGIN_SRC emacs-lisp
(advice-add #'backward-page :after #'recenter)
(advice-add #'forward-page :after #'recenter)
#+END_SRC

Do the /right thing/ for getting to the start of the line.

#+NAME: org_gcr_2017-05-12_mara_B8BDE36B-4B27-4580-BA34-35C047FBEA62
#+BEGIN_SRC emacs-lisp
(use-package mwim
  :ensure t
  :config
  (global-set-key (kbd "C-a") 'mwim-beginning-of-code-or-line))
#+END_SRC

Fling buffers left and right.

#+NAME: org_gcr_2017-06-20_mara_6C4B1CDD-CF71-4A5F-B900-6D3CC06D4028
#+BEGIN_SRC emacs-lisp
(use-package buffer-move
  :ensure t
  :config
  (define-key org-mode-map (kbd "<C-S-up>") nil)
  (global-set-key (kbd "<C-S-up>") #'buf-move-up)
  (define-key org-mode-map (kbd "<C-S-down>") nil)
  (global-set-key (kbd "<C-S-down>") #'buf-move-down)
  (define-key org-mode-map (kbd "<C-S-left>") nil)
  (global-set-key (kbd "<C-S-left>") #'buf-move-left)
  (define-key org-mode-map (kbd "<C-S-right>") nil)
  (global-set-key (kbd "<C-S-right>") #'buf-move-right))
#+END_SRC

- Easily see the fill-column (or close too it)
  - Sometimes I set the fci rule at 81 because a char at 79 pushes the fci
    rule out one extra space. Sometimes it is not an issue.
  #+NAME: org_gcr_2017-05-12_mara_3E475ED3-773E-4537-B29F-6888B7DB90DF
  #+BEGIN_SRC emacs-lisp
(use-package fill-column-indicator
  :ensure t
  :config
  (setq fci-rule-column 79))
  #+END_SRC

Show text indentation guide lines.

#+NAME: org_gcr_2017-06-28_mara_EE77505E-5757-409C-9E87-2FA685145AB2
#+BEGIN_SRC emacs-lisp
(use-package indent-guide
  :ensure t)
#+END_SRC

Management:
- http://martinowen.net/blog/2010/02/03/tips-for-emacs-ibuffer.html
- https://mytechrants.wordpress.com/2010/03/25/emacs-tip-of-the-day-start-using-ibuffer-asap/
- Group approach
  - See the world organized by?
    - File names
    - Buffer names
    - Mode types
    - Groups of files
    - [[https://github.com/purcell/ibuffer-projectile][Projectile project]] idea
      - Top up to .git dir
    - [[https://github.com/purcell/ibuffer-vc][Git]] working tree
      - This is how I see the world
- [[https://github.com/abo-abo/hydra/wiki/Ibuffer][Hydra Helper]]

#+NAME: org_gcr_2017-05-19_mara_845BEC94-54CC-46D3-B85F-7B537944E328
#+BEGIN_SRC emacs-lisp
(defhydra hydra-ibuffer-main (:color pink :hint nil)
  "
   ^Navigation^ | ^Mark^        | ^Actions^        | ^View^
  -^----------^-+-^----^--------+-^-------^--------+-^----^-------
    _k_:    ʌ   | _m_: mark     | _D_: delete      | _g_: refresh
   _RET_: visit | _u_: unmark   | _S_: save        | _s_: sort
    _j_:    v   | _*_: specific | _a_: all actions | _/_: filter
  -^----------^-+-^----^--------+-^-------^--------+-^----^-------
  "
  ("j" ibuffer-forward-line)
  ("RET" ibuffer-visit-buffer :color blue)
  ("k" ibuffer-backward-line)

  ("m" ibuffer-mark-forward)
  ("u" ibuffer-unmark-forward)
  ("*" hydra-ibuffer-mark/body :color blue)

  ("D" ibuffer-do-delete)
  ("S" ibuffer-do-save)
  ("a" hydra-ibuffer-action/body :color blue)

  ("g" ibuffer-update)
  ("s" hydra-ibuffer-sort/body :color blue)
  ("/" hydra-ibuffer-filter/body :color blue)

  ("o" ibuffer-visit-buffer-other-window "other window" :color blue)
  ("q" ibuffer-quit "quit ibuffer" :color blue)
  ("." nil "toggle hydra" :color blue))

(defhydra hydra-ibuffer-mark (:color teal :columns 5
                                     :after-exit (hydra-ibuffer-main/body))
  "Mark"
  ("*" ibuffer-unmark-all "unmark all")
  ("M" ibuffer-mark-by-mode "mode")
  ("m" ibuffer-mark-modified-buffers "modified")
  ("u" ibuffer-mark-unsaved-buffers "unsaved")
  ("s" ibuffer-mark-special-buffers "special")
  ("r" ibuffer-mark-read-only-buffers "read-only")
  ("/" ibuffer-mark-dired-buffers "dired")
  ("e" ibuffer-mark-dissociated-buffers "dissociated")
  ("h" ibuffer-mark-help-buffers "help")
  ("z" ibuffer-mark-compressed-file-buffers "compressed")
  ("b" hydra-ibuffer-main/body "back" :color blue))

(defhydra hydra-ibuffer-action (:color teal :columns 4
                                       :after-exit
                                       (if (eq major-mode 'ibuffer-mode)
                                           (hydra-ibuffer-main/body)))
  "Action"
  ("A" ibuffer-do-view "view")
  ("E" ibuffer-do-eval "eval")
  ("F" ibuffer-do-shell-command-file "shell-command-file")
  ("I" ibuffer-do-query-replace-regexp "query-replace-regexp")
  ("H" ibuffer-do-view-other-frame "view-other-frame")
  ("N" ibuffer-do-shell-command-pipe-replace "shell-cmd-pipe-replace")
  ("M" ibuffer-do-toggle-modified "toggle-modified")
  ("O" ibuffer-do-occur "occur")
  ("P" ibuffer-do-print "print")
  ("Q" ibuffer-do-query-replace "query-replace")
  ("R" ibuffer-do-rename-uniquely "rename-uniquely")
  ("T" ibuffer-do-toggle-read-only "toggle-read-only")
  ("U" ibuffer-do-replace-regexp "replace-regexp")
  ("V" ibuffer-do-revert "revert")
  ("W" ibuffer-do-view-and-eval "view-and-eval")
  ("X" ibuffer-do-shell-command-pipe "shell-command-pipe")
  ("b" nil "back"))

(defhydra hydra-ibuffer-sort (:color amaranth :columns 3)
  "Sort"
  ("i" ibuffer-invert-sorting "invert")
  ("a" ibuffer-do-sort-by-alphabetic "alphabetic")
  ("v" ibuffer-do-sort-by-recency "recently used")
  ("s" ibuffer-do-sort-by-size "size")
  ("f" ibuffer-do-sort-by-filename/process "filename")
  ("m" ibuffer-do-sort-by-major-mode "mode")
  ("b" hydra-ibuffer-main/body "back" :color blue))

(defhydra hydra-ibuffer-filter (:color amaranth :columns 4)
  "Filter"
  ("m" ibuffer-filter-by-used-mode "mode")
  ("M" ibuffer-filter-by-derived-mode "derived mode")
  ("n" ibuffer-filter-by-name "name")
  ("c" ibuffer-filter-by-content "content")
  ("e" ibuffer-filter-by-predicate "predicate")
  ("f" ibuffer-filter-by-filename "filename")
  (">" ibuffer-filter-by-size-gt "size")
  ("<" ibuffer-filter-by-size-lt "size")
  ("/" ibuffer-filter-disable "disable")
  ("b" hydra-ibuffer-main/body "back" :color blue))
(use-package ibuffer
  :config
  (define-key ibuffer-mode-map "." #'hydra-ibuffer-main/body))
(use-package ibuffer-vc
  :ensure t)
(defun help/ibuffer-hook-fn ()
  "HELP customizations."
  (interactive)
  (setq ibuffer-expert t)
  (setq ibuffer-show-empty-filter-groups nil)
  (ibuffer-auto-mode t)
  (stripe-buffer-mode)
  (ibuffer-vc-set-filter-groups-by-vc-root)
  (unless (eq ibuffer-sorting-mode 'alphabetic)
    (ibuffer-do-sort-by-alphabetic)))
(add-hook 'ibuffer-mode-hooks #'help/ibuffer-hook-fn)
#+END_SRC

This package for GNU APL.

#+NAME: org_gcr_2017-07-20_mara_51310F49-2C54-43DC-AA11-CA3A4ABF1A5F
#+BEGIN_SRC emacs-lisp
(use-package face-remap
  :diminish 'buffer-face-mode)
#+END_SRC

Move line or region up or down.

#+NAME: org_gcr_2017-08-03_mara_5085E329-B4D0-4D69-8AB6-17E7094E44C3
#+BEGIN_SRC emacs-lisp
(use-package move-text
  :ensure t
  :config
  (global-set-key (kbd "S-s-<up>") #'move-text-up)
  (global-set-key (kbd "S-s-<down>") #'move-text-down))
#+END_SRC
