help.html
<div id="outline-container-org9835b51" class="outline-3">
<h3 id="org9835b51"><span class="section-number-3">3.3</span> Buffer</h3>
<div class="outline-text-3" id="text-3-3">
<pre class="example">
ID: org_gcr_2017-05-12_mara:D4FC68F9-CEA3-455A-B718-EBDB113CFA71
</pre>

<p>
Maintain buffers across sessions. Desktop-Save-Mode persists every part of the
buffer. If you upgrade a package that uses buffer-variables that have changed
you may get unexpected behavior. Close all buffers and open them again after
making such breaking changes.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgd3bb448">(desktop-save-mode t)
(<span class="org-keyword">setq</span> desktop-restore-eager 10)
</pre>
</div>

<p>
Provide expected &ldquo;Undo&rdquo; functionality.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org52770f5">(<span class="org-keyword">use-package</span> <span class="org-constant">undo-tree</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (global-undo-tree-mode 1)
  (global-set-key (kbd <span class="org-string">"C-M-u"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">undo-tree-visualize</span>)
  <span class="org-builtin">:diminish</span> undo-tree-mode)
</pre>
</div>

<p>
Ever file must end with a <a href="https://robots.thoughtbot.com/no-newline-at-end-of-file">newline</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org281dc2d">(<span class="org-keyword">setq</span> require-final-newline t)
</pre>
</div>

<p>
If you are on the end of a line, and go up or down, then go to the end of
line on that new line. Do not account for anything special about the character
there.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org36185b9">(<span class="org-keyword">setq</span> track-eol t)
(<span class="org-keyword">setq</span> line-move-visual nil)
</pre>
</div>

<p>
Take the cursor with scroll activities.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org10e6009">(<span class="org-keyword">setq</span> scroll-preserve-screen-position t)
</pre>
</div>

<p>
Scroll text line-by-line as the cursor scrolls off of the screen. Nice to keep
the document from jumping around. Not nice for scrolling when you want to
quickly see the next ten or twenty lines. But <code>recenter-top-bottom</code> give you
that so you can have both features easily.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org4ad5532">(<span class="org-keyword">setq</span> scroll-conservatively 101)
</pre>
</div>

<p>
More easily visualize tabular data. Considered to non-subjective.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgfde274d">(<span class="org-keyword">use-package</span> <span class="org-constant">stripe-buffer</span>
  <span class="org-builtin">:ensure</span> t)
</pre>
</div>

<p>
End sentences with a single space.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgeaa8b51">(<span class="org-keyword">setq</span> sentence-end-double-space nil)
</pre>
</div>

<p>
Ban white-space at end of lines, globally.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org36c4860">(add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">before-save-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/delete-trailing-whitespace</span>)
</pre>
</div>

<p>
Intelligently select the current char, then word, then object, then block,
then document.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org9ca5188">(<span class="org-keyword">use-package</span> <span class="org-constant">expand-region</span>
  <span class="org-builtin">:ensure</span> t)
</pre>
</div>

<p>
Configure Page-Break-Lines-Mode to visualize the formfeed character: <code>C-q C-l</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org80af90a">(<span class="org-keyword">use-package</span> <span class="org-constant">page-break-lines</span>
  <span class="org-builtin">:diminish</span> page-break-lines-mode
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">defun</span> <span class="org-function-name">help/insert-formfeed</span> ()
    (<span class="org-keyword">interactive</span>)
    (insert <span class="org-string">"\f"</span>))
  (global-set-key (kbd <span class="org-string">"C-M-&lt;return&gt;"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/insert-formfeed</span>)
  (global-set-key (kbd <span class="org-string">"C-M-j"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">forward-page</span>)
  (global-set-key (kbd <span class="org-string">"C-M-k"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">backward-page</span>)
  (global-set-key (kbd <span class="org-string">"C-M-n"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">narrow-to-page</span>)
  (global-set-key (kbd <span class="org-string">"C-M-h"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">mark-page</span>))
</pre>
</div>

<p>
Center the buffer after navigating pages.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgf1dbafc">(advice-add <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">backward-page</span> <span class="org-builtin">:after</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">recenter</span>)
(advice-add <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">forward-page</span> <span class="org-builtin">:after</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">recenter</span>)
</pre>
</div>

<p>
Do the <i>right thing</i> for getting to the start of the line.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgeaa326a">(<span class="org-keyword">use-package</span> <span class="org-constant">mwim</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (global-set-key (kbd <span class="org-string">"C-a"</span>) <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">mwim-beginning-of-code-or-line</span>))
</pre>
</div>

<p>
Fling buffers left and right.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgca340d1">(<span class="org-keyword">use-package</span> <span class="org-constant">buffer-move</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (define-key org-mode-map (kbd <span class="org-string">"&lt;C-S-up&gt;"</span>) nil)
  (global-set-key (kbd <span class="org-string">"&lt;C-S-up&gt;"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">buf-move-up</span>)
  (define-key org-mode-map (kbd <span class="org-string">"&lt;C-S-down&gt;"</span>) nil)
  (global-set-key (kbd <span class="org-string">"&lt;C-S-down&gt;"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">buf-move-down</span>)
  (define-key org-mode-map (kbd <span class="org-string">"&lt;C-S-left&gt;"</span>) nil)
  (global-set-key (kbd <span class="org-string">"&lt;C-S-left&gt;"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">buf-move-left</span>)
  (define-key org-mode-map (kbd <span class="org-string">"&lt;C-S-right&gt;"</span>) nil)
  (global-set-key (kbd <span class="org-string">"&lt;C-S-right&gt;"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">buf-move-right</span>))
</pre>
</div>

<ul class="org-ul">
<li><p>
Easily see the fill-column (or close too it)
</p>
<ul class="org-ul">
<li>Sometimes I set the fci rule at 81 because a char at 79 pushes the fci
rule out one extra space. Sometimes it is not an issue.</li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org81ba360">(<span class="org-keyword">use-package</span> <span class="org-constant">fill-column-indicator</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">setq</span> fci-rule-column 79))
</pre>
</div></li>
</ul>

<p>
Show text indentation guide lines.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org5300564">(<span class="org-keyword">use-package</span> <span class="org-constant">indent-guide</span>
  <span class="org-builtin">:ensure</span> t)
</pre>
</div>

<p>
Management:
</p>
<ul class="org-ul">
<li><a href="http://martinowen.net/blog/2010/02/03/tips-for-emacs-ibuffer.html">http://martinowen.net/blog/2010/02/03/tips-for-emacs-ibuffer.html</a></li>
<li><a href="https://mytechrants.wordpress.com/2010/03/25/emacs-tip-of-the-day-start-using-ibuffer-asap/">https://mytechrants.wordpress.com/2010/03/25/emacs-tip-of-the-day-start-using-ibuffer-asap/</a></li>
<li>Group approach
<ul class="org-ul">
<li>See the world organized by?
<ul class="org-ul">
<li>File names</li>
<li>Buffer names</li>
<li>Mode types</li>
<li>Groups of files</li>
<li><a href="https://github.com/purcell/ibuffer-projectile">Projectile project</a> idea
<ul class="org-ul">
<li>Top up to .git dir</li>
</ul></li>
<li><a href="https://github.com/purcell/ibuffer-vc">Git</a> working tree
<ul class="org-ul">
<li>This is how I see the world</li>
</ul></li>
</ul></li>
</ul></li>
<li><a href="https://github.com/abo-abo/hydra/wiki/Ibuffer">Hydra Helper</a></li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org08a8dfb">(<span class="org-keyword">defhydra</span> hydra-ibuffer-main (<span class="org-builtin">:color</span> <span class="custom-3"><span class="custom-2">pink</span></span> <span class="org-builtin">:hint</span> nil)
  <span class="org-doc">"</span>
<span class="org-doc">   ^Navigation^ | ^Mark^        | ^Actions^        | ^View^</span>
<span class="org-doc">  -^----------^-+-^----^--------+-^-------^--------+-^----^-------</span>
<span class="org-doc">    _k_:    &#652;   | _m_: mark     | _D_: delete      | _g_: refresh</span>
<span class="org-doc">   _RET_: visit | _u_: unmark   | _S_: save        | _s_: sort</span>
<span class="org-doc">    _j_:    v   | _*_: specific | _a_: all actions | _/_: filter</span>
<span class="org-doc">  -^----------^-+-^----^--------+-^-------^--------+-^----^-------</span>
<span class="org-doc">  "</span>
  (<span class="org-string">"j"</span> ibuffer-forward-line)
  (<span class="org-string">"RET"</span> ibuffer-visit-buffer <span class="org-builtin">:color</span> <span class="custom"><span class="custom-1">blue</span></span>)
  (<span class="org-string">"k"</span> ibuffer-backward-line)

  (<span class="org-string">"m"</span> ibuffer-mark-forward)
  (<span class="org-string">"u"</span> ibuffer-unmark-forward)
  (<span class="org-string">"*"</span> hydra-ibuffer-mark/body <span class="org-builtin">:color</span> <span class="custom"><span class="custom-1">blue</span></span>)

  (<span class="org-string">"D"</span> ibuffer-do-delete)
  (<span class="org-string">"S"</span> ibuffer-do-save)
  (<span class="org-string">"a"</span> hydra-ibuffer-action/body <span class="org-builtin">:color</span> <span class="custom"><span class="custom-1">blue</span></span>)

  (<span class="org-string">"g"</span> ibuffer-update)
  (<span class="org-string">"s"</span> hydra-ibuffer-sort/body <span class="org-builtin">:color</span> <span class="custom"><span class="custom-1">blue</span></span>)
  (<span class="org-string">"/"</span> hydra-ibuffer-filter/body <span class="org-builtin">:color</span> <span class="custom"><span class="custom-1">blue</span></span>)

  (<span class="org-string">"o"</span> ibuffer-visit-buffer-other-window <span class="org-string">"other window"</span> <span class="org-builtin">:color</span> <span class="custom"><span class="custom-1">blue</span></span>)
  (<span class="org-string">"q"</span> ibuffer-quit <span class="org-string">"quit ibuffer"</span> <span class="org-builtin">:color</span> <span class="custom"><span class="custom-1">blue</span></span>)
  (<span class="org-string">"."</span> nil <span class="org-string">"toggle hydra"</span> <span class="org-builtin">:color</span> <span class="custom"><span class="custom-1">blue</span></span>))

(<span class="org-keyword">defhydra</span> hydra-ibuffer-mark (<span class="org-builtin">:color</span> teal <span class="org-builtin">:columns</span> 5
                                     <span class="org-builtin">:after-exit</span> (hydra-ibuffer-main/body))
  <span class="org-doc">"Mark"</span>
  (<span class="org-string">"*"</span> ibuffer-unmark-all <span class="org-string">"unmark all"</span>)
  (<span class="org-string">"M"</span> ibuffer-mark-by-mode <span class="org-string">"mode"</span>)
  (<span class="org-string">"m"</span> ibuffer-mark-modified-buffers <span class="org-string">"modified"</span>)
  (<span class="org-string">"u"</span> ibuffer-mark-unsaved-buffers <span class="org-string">"unsaved"</span>)
  (<span class="org-string">"s"</span> ibuffer-mark-special-buffers <span class="org-string">"special"</span>)
  (<span class="org-string">"r"</span> ibuffer-mark-read-only-buffers <span class="org-string">"read-only"</span>)
  (<span class="org-string">"/"</span> ibuffer-mark-dired-buffers <span class="org-string">"dired"</span>)
  (<span class="org-string">"e"</span> ibuffer-mark-dissociated-buffers <span class="org-string">"dissociated"</span>)
  (<span class="org-string">"h"</span> ibuffer-mark-help-buffers <span class="org-string">"help"</span>)
  (<span class="org-string">"z"</span> ibuffer-mark-compressed-file-buffers <span class="org-string">"compressed"</span>)
  (<span class="org-string">"b"</span> hydra-ibuffer-main/body <span class="org-string">"back"</span> <span class="org-builtin">:color</span> <span class="custom"><span class="custom-1">blue</span></span>))

(<span class="org-keyword">defhydra</span> hydra-ibuffer-action (<span class="org-builtin">:color</span> teal <span class="org-builtin">:columns</span> 4
                                       <span class="org-builtin">:after-exit</span>
                                       (<span class="org-keyword">if</span> (eq major-mode <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">ibuffer-mode</span>)
                                           (hydra-ibuffer-main/body)))
  <span class="org-doc">"Action"</span>
  (<span class="org-string">"A"</span> ibuffer-do-view <span class="org-string">"view"</span>)
  (<span class="org-string">"E"</span> ibuffer-do-eval <span class="org-string">"eval"</span>)
  (<span class="org-string">"F"</span> ibuffer-do-shell-command-file <span class="org-string">"shell-command-file"</span>)
  (<span class="org-string">"I"</span> ibuffer-do-query-replace-regexp <span class="org-string">"query-replace-regexp"</span>)
  (<span class="org-string">"H"</span> ibuffer-do-view-other-frame <span class="org-string">"view-other-frame"</span>)
  (<span class="org-string">"N"</span> ibuffer-do-shell-command-pipe-replace <span class="org-string">"shell-cmd-pipe-replace"</span>)
  (<span class="org-string">"M"</span> ibuffer-do-toggle-modified <span class="org-string">"toggle-modified"</span>)
  (<span class="org-string">"O"</span> ibuffer-do-occur <span class="org-string">"occur"</span>)
  (<span class="org-string">"P"</span> ibuffer-do-print <span class="org-string">"print"</span>)
  (<span class="org-string">"Q"</span> ibuffer-do-query-replace <span class="org-string">"query-replace"</span>)
  (<span class="org-string">"R"</span> ibuffer-do-rename-uniquely <span class="org-string">"rename-uniquely"</span>)
  (<span class="org-string">"T"</span> ibuffer-do-toggle-read-only <span class="org-string">"toggle-read-only"</span>)
  (<span class="org-string">"U"</span> ibuffer-do-replace-regexp <span class="org-string">"replace-regexp"</span>)
  (<span class="org-string">"V"</span> ibuffer-do-revert <span class="org-string">"revert"</span>)
  (<span class="org-string">"W"</span> ibuffer-do-view-and-eval <span class="org-string">"view-and-eval"</span>)
  (<span class="org-string">"X"</span> ibuffer-do-shell-command-pipe <span class="org-string">"shell-command-pipe"</span>)
  (<span class="org-string">"b"</span> nil <span class="org-string">"back"</span>))

(<span class="org-keyword">defhydra</span> hydra-ibuffer-sort (<span class="org-builtin">:color</span> amaranth <span class="org-builtin">:columns</span> 3)
  <span class="org-doc">"Sort"</span>
  (<span class="org-string">"i"</span> ibuffer-invert-sorting <span class="org-string">"invert"</span>)
  (<span class="org-string">"a"</span> ibuffer-do-sort-by-alphabetic <span class="org-string">"alphabetic"</span>)
  (<span class="org-string">"v"</span> ibuffer-do-sort-by-recency <span class="org-string">"recently used"</span>)
  (<span class="org-string">"s"</span> ibuffer-do-sort-by-size <span class="org-string">"size"</span>)
  (<span class="org-string">"f"</span> ibuffer-do-sort-by-filename/process <span class="org-string">"filename"</span>)
  (<span class="org-string">"m"</span> ibuffer-do-sort-by-major-mode <span class="org-string">"mode"</span>)
  (<span class="org-string">"b"</span> hydra-ibuffer-main/body <span class="org-string">"back"</span> <span class="org-builtin">:color</span> <span class="custom"><span class="custom-1">blue</span></span>))

(<span class="org-keyword">defhydra</span> hydra-ibuffer-filter (<span class="org-builtin">:color</span> amaranth <span class="org-builtin">:columns</span> 4)
  <span class="org-doc">"Filter"</span>
  (<span class="org-string">"m"</span> ibuffer-filter-by-used-mode <span class="org-string">"mode"</span>)
  (<span class="org-string">"M"</span> ibuffer-filter-by-derived-mode <span class="org-string">"derived mode"</span>)
  (<span class="org-string">"n"</span> ibuffer-filter-by-name <span class="org-string">"name"</span>)
  (<span class="org-string">"c"</span> ibuffer-filter-by-content <span class="org-string">"content"</span>)
  (<span class="org-string">"e"</span> ibuffer-filter-by-predicate <span class="org-string">"predicate"</span>)
  (<span class="org-string">"f"</span> ibuffer-filter-by-filename <span class="org-string">"filename"</span>)
  (<span class="org-string">"&gt;"</span> ibuffer-filter-by-size-gt <span class="org-string">"size"</span>)
  (<span class="org-string">"&lt;"</span> ibuffer-filter-by-size-lt <span class="org-string">"size"</span>)
  (<span class="org-string">"/"</span> ibuffer-filter-disable <span class="org-string">"disable"</span>)
  (<span class="org-string">"b"</span> hydra-ibuffer-main/body <span class="org-string">"back"</span> <span class="org-builtin">:color</span> <span class="custom"><span class="custom-1">blue</span></span>))
(<span class="org-keyword">use-package</span> <span class="org-constant">ibuffer</span>
  <span class="org-builtin">:config</span>
  (define-key ibuffer-mode-map <span class="org-string">"."</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">hydra-ibuffer-main/body</span>))
(<span class="org-keyword">use-package</span> <span class="org-constant">ibuffer-vc</span>
  <span class="org-builtin">:ensure</span> t)
(<span class="org-keyword">defun</span> <span class="org-function-name">help/ibuffer-hook-fn</span> ()
  <span class="org-doc">"HELP customizations."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">setq</span> ibuffer-expert t)
  (<span class="org-keyword">setq</span> ibuffer-show-empty-filter-groups nil)
  (ibuffer-auto-mode t)
  (stripe-buffer-mode)
  (ibuffer-vc-set-filter-groups-by-vc-root)
  (<span class="org-keyword">unless</span> (eq ibuffer-sorting-mode <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">alphabetic</span>)
    (ibuffer-do-sort-by-alphabetic)))
(add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">ibuffer-mode-hooks</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/ibuffer-hook-fn</span>)
</pre>
</div>

<p>
This package for GNU APL.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgd90d485">(<span class="org-keyword">use-package</span> <span class="org-constant">face-remap</span>
  <span class="org-builtin">:diminish</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">buffer-face-mode</span>)
</pre>
</div>

<p>
Move line or region up or down.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org2b1aabd">(<span class="org-keyword">use-package</span> <span class="org-constant">move-text</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (global-set-key (kbd <span class="org-string">"S-s-&lt;up&gt;"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">move-text-up</span>)
  (global-set-key (kbd <span class="org-string">"S-s-&lt;down&gt;"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">move-text-down</span>))
</pre>
</div>
</div>
</div>
