help.org
** Code Folding
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:94245A47-6A25-442A-B458-AD00A3DDA1A2
   :END:

#+NAME: org_gcr_2017-05-12_mara_611E83B9-E797-4512-95EE-643473026607
#+BEGIN_SRC emacs-lisp
(use-package hideshow
  :config
  (setq hs-hide-comments-when-hiding-all t)
  (setq hs-isearch-open t)
  (defun display-code-line-counts (ov)
    "Displaying overlay content in echo area or tooltip"
    (when (eq 'code (overlay-get ov 'hs))
      (overlay-put ov 'help-echo
                   (buffer-substring (overlay-start ov)
                                     (overlay-end ov)))))
  (setq hs-set-up-overlay #'display-code-line-counts)
  (defun help/goto-line ()
    "How do I get it to expand upon a goto-line? hideshow-expand affected block
    when using goto-line in a collapsed buffer."
    (call-interactively #'goto-line)
    (save-excursion
      (hs-show-block)))
  (defvar help/my-hs-hide nil "Current state of hideshow for toggling all.")
  (defun help/my-toggle-hideshow-all () "Toggle hideshow all."
         (interactive)
         (setq help/my-hs-hide (not help/my-hs-hide))
         (if help/my-hs-hide
             (hs-hide-all)
           (hs-show-all)))
  :diminish hs-minor-mode)
#+END_SRC

** Colors
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:DA9E0CC6-F3D4-4B9B-944C-0ECB69D8899C
   :END:

Colorize color names.

Rainbow-Mode handles most major modes color definitions as expected.

#+NAME: org_gcr_2017-05-12_mara_BBE40664-C7A9-4586-A5FF-05E570E87B7A
#+BEGIN_SRC emacs-lisp
(use-package rainbow-mode
  :ensure t
  :config
  :diminish rainbow-mode)
#+END_SRC

** Debugging
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:C54D8CF3-E2C4-4A7A-A92C-5252826EFD01
:END:

Sometimes the judicious use of Git and git bisect can obviate the need for
manual bisections. Othertimes not. For the latter, use =elisp-bug-hunter=.

#+NAME: org_gcr_2017-05-12_mara_D877FC18-3238-45E0-BE6C-6FE3149E4121
#+BEGIN_SRC emacs-lisp
(use-package bug-hunter
  :ensure t)
#+END_SRC

** Emacs Lisp Macros
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:6D4A22CE-EC84-4245-AD7E-2CCC0B35CBCA
   :END:

Macro expander:
- ~e~, ~=~, ~RET~
  - expand the macro form following point one step
- ~c~, ~u~, ~DEL~
  - collapse the form following point
- ~q~, ~C-c~ ~C-c~
  - collapse all expanded forms and exit macrostep-mode
- ~n~, ~TAB~
  - jump to the next macro form in the expansion
- ~p~, ~M-TAB~
  - jump to the previous macro form in the expansion

#+NAME: org_gcr_2017-05-12_mara_510C1AB4-A266-40A6-9DCF-25B827E60786
#+BEGIN_SRC emacs-lisp
(use-package macrostep
  :ensure t
  :config
  (define-key emacs-lisp-mode-map (kbd "C-M-8") #'macrostep-expand))
#+END_SRC

** Evaluation
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:C88E8819-35D2-40E0-BBAD-3AC799DA0A33
   :END:

#+NAME: org_gcr_2017-05-12_mara_CD327ED5-E83D-471F-9A30-B7A3FBB67486
#+BEGIN_SRC emacs-lisp
(setq-default eval-expression-print-level nil)
#+END_SRC

Allow most commands.

#+NAME: org_gcr_2017-05-12_mara_41240CBD-3217-466E-BD0F-5737D8BC68BF
#+BEGIN_SRC emacs-lisp
(put #'upcase-region 'disabled nil)
(put #'downcase-region 'disabled nil)
(put #'narrow-to-region 'disabled nil)
#+END_SRC

Send the current line to the REPL, evaluate it and move to the next line.
Works for lots of languages and does the /right thing/ navigating to the next
line.

If you learned this in ESS then you already love it. If you didn't then you
probably will now

#+NAME: org_gcr_2017-05-12_mara_0DE4A73B-54B3-41AA-8744-98D7B34D159B
#+BEGIN_SRC emacs-lisp
(use-package eval-in-repl
  :ensure t
  :config
  (setq eir-jump-after-eval nil)
  (setq eir-always-split-script-window t)
  (setq eir-delete-other-windows t)
  (setq eir-repl-placement 'right)
  ;; ielm support (for emacs lisp)
  (require 'eval-in-repl-ielm)
  ;; for .el files
  (define-key emacs-lisp-mode-map (kbd "<C-return>") 'eir-eval-in-ielm)
  ;; for *scratch*
  (define-key lisp-interaction-mode-map (kbd "<C-return>") 'eir-eval-in-ielm)
  ;; for M-x info
  (eval-after-load "info"
    '(define-key Info-mode-map (kbd "<C-return>") 'eir-eval-in-ielm))
  ;; Shell support
  (require 'eval-in-repl-shell)
  (add-hook 'sh-mode-hook
            '(lambda()
               (local-set-key (kbd "C-<return>") 'eir-eval-in-shell)))
  ;; Version with opposite behavior to eir-jump-after-eval configuration
  (defun eir-eval-in-shell2 ()
    "eval-in-repl for shell script (opposite behavior)

This version has the opposite behavior to the eir-jump-after-eval
configuration when invoked to evaluate a line."
    (interactive)
    (let ((eir-jump-after-eval (not eir-jump-after-eval)))
      (eir-eval-in-shell)))
  (add-hook 'sh-mode-hook
            '(lambda()
               (local-set-key (kbd "C-<return>") 'eir-eval-in-shell2))))
#+END_SRC

