help.html
<div id="outline-container-org695829b" class="outline-3">
<h3 id="org695829b"><span class="section-number-3">3.4</span> Code Folding</h3>
<div class="outline-text-3" id="text-3-4">
<pre class="example">
ID: org_gcr_2017-05-12_mara:94245A47-6A25-442A-B458-AD00A3DDA1A2
</pre>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org084be75">(<span class="org-keyword">use-package</span> <span class="org-constant">hideshow</span>
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">setq</span> hs-hide-comments-when-hiding-all t)
  (<span class="org-keyword">setq</span> hs-isearch-open t)
  (<span class="org-keyword">defun</span> <span class="org-function-name">display-code-line-counts</span> (ov)
    <span class="org-doc">"Displaying overlay content in echo area or tooltip"</span>
    (<span class="org-keyword">when</span> (eq <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">code</span> (overlay-get ov <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">hs</span>))
      (overlay-put ov <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">help-echo</span>
                   (buffer-substring (overlay-start ov)
                                     (overlay-end ov)))))
  (<span class="org-keyword">setq</span> hs-set-up-overlay <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">display-code-line-counts</span>)
  (<span class="org-keyword">defun</span> <span class="org-function-name">help/goto-line</span> ()
    <span class="org-doc">"How do I get it to expand upon a goto-line? hideshow-expand affected block</span>
<span class="org-doc">    when using goto-line in a collapsed buffer."</span>
    (call-interactively <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">goto-line</span>)
    (<span class="org-keyword">save-excursion</span>
      (hs-show-block)))
  (<span class="org-keyword">defvar</span> <span class="org-variable-name">help/my-hs-hide</span> nil <span class="org-doc">"Current state of hideshow for toggling all."</span>)
  (<span class="org-keyword">defun</span> <span class="org-function-name">help/my-toggle-hideshow-all</span> () <span class="org-doc">"Toggle hideshow all."</span>
         (<span class="org-keyword">interactive</span>)
         (<span class="org-keyword">setq</span> help/my-hs-hide (not help/my-hs-hide))
         (<span class="org-keyword">if</span> help/my-hs-hide
             (hs-hide-all)
           (hs-show-all)))
  <span class="org-builtin">:diminish</span> hs-minor-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-org28ee245" class="outline-3">
<h3 id="org28ee245"><span class="section-number-3">3.5</span> Colors</h3>
<div class="outline-text-3" id="text-3-5">
<pre class="example">
ID: org_gcr_2017-05-12_mara:DA9E0CC6-F3D4-4B9B-944C-0ECB69D8899C
</pre>

<p>
Colorize color names.
</p>

<p>
Rainbow-Mode handles most major modes color definitions as expected.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgd4ca780">(<span class="org-keyword">use-package</span> <span class="org-constant">rainbow-mode</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  <span class="org-builtin">:diminish</span> rainbow-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd9e3f6a" class="outline-3">
<h3 id="orgd9e3f6a"><span class="section-number-3">3.6</span> Debugging</h3>
<div class="outline-text-3" id="text-3-6">
<pre class="example">
ID: org_gcr_2017-05-12_mara:C54D8CF3-E2C4-4A7A-A92C-5252826EFD01
</pre>

<p>
Sometimes the judicious use of Git and git bisect can obviate the need for
manual bisections. Othertimes not. For the latter, use <code>elisp-bug-hunter</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org972ad90">(<span class="org-keyword">use-package</span> <span class="org-constant">bug-hunter</span>
  <span class="org-builtin">:ensure</span> t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcfdb6d7" class="outline-3">
<h3 id="orgcfdb6d7"><span class="section-number-3">3.7</span> Emacs Lisp Macros</h3>
<div class="outline-text-3" id="text-3-7">
<pre class="example">
ID: org_gcr_2017-05-12_mara:6D4A22CE-EC84-4245-AD7E-2CCC0B35CBCA
</pre>

<p>
Macro expander:
</p>
<ul class="org-ul">
<li><code>e</code>, <code>=</code>, <code>RET</code>
<ul class="org-ul">
<li>expand the macro form following point one step</li>
</ul></li>
<li><code>c</code>, <code>u</code>, <code>DEL</code>
<ul class="org-ul">
<li>collapse the form following point</li>
</ul></li>
<li><code>q</code>, <code>C-c</code> <code>C-c</code>
<ul class="org-ul">
<li>collapse all expanded forms and exit macrostep-mode</li>
</ul></li>
<li><code>n</code>, <code>TAB</code>
<ul class="org-ul">
<li>jump to the next macro form in the expansion</li>
</ul></li>
<li><code>p</code>, <code>M-TAB</code>
<ul class="org-ul">
<li>jump to the previous macro form in the expansion</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org220890b">(<span class="org-keyword">use-package</span> <span class="org-constant">macrostep</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (define-key emacs-lisp-mode-map (kbd <span class="org-string">"C-M-8"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">macrostep-expand</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-org45f2845" class="outline-3">
<h3 id="org45f2845"><span class="section-number-3">3.8</span> Evaluation</h3>
<div class="outline-text-3" id="text-3-8">
<pre class="example">
ID: org_gcr_2017-05-12_mara:C88E8819-35D2-40E0-BBAD-3AC799DA0A33
</pre>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org10bd90a">(<span class="org-keyword">setq-default</span> eval-expression-print-level nil)
</pre>
</div>

<p>
Allow most commands.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orga6f0969">(put <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">upcase-region</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">disabled</span> nil)
(put <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">downcase-region</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">disabled</span> nil)
(put <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">narrow-to-region</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">disabled</span> nil)
</pre>
</div>

<p>
Send the current line to the REPL, evaluate it and move to the next line.
Works for lots of languages and does the <i>right thing</i> navigating to the next
line.
</p>

<p>
If you learned this in ESS then you already love it. If you didn&rsquo;t then you
probably will now
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org653eead">(<span class="org-keyword">use-package</span> <span class="org-constant">eval-in-repl</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">setq</span> eir-jump-after-eval nil)
  (<span class="org-keyword">setq</span> eir-always-split-script-window t)
  (<span class="org-keyword">setq</span> eir-delete-other-windows t)
  (<span class="org-keyword">setq</span> eir-repl-placement <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">right</span>)
  <span class="org-comment-delimiter">;; </span><span class="org-comment">ielm support (for emacs lisp)</span>
  (<span class="org-keyword">require</span> <span class="org-highlight-quoted-quote">'</span><span class="org-constant">eval-in-repl-ielm</span>)
  <span class="org-comment-delimiter">;; </span><span class="org-comment">for .el files</span>
  (define-key emacs-lisp-mode-map (kbd <span class="org-string">"&lt;C-return&gt;"</span>) <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">eir-eval-in-ielm</span>)
  <span class="org-comment-delimiter">;; </span><span class="org-comment">for *scratch*</span>
  (define-key lisp-interaction-mode-map (kbd <span class="org-string">"&lt;C-return&gt;"</span>) <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">eir-eval-in-ielm</span>)
  <span class="org-comment-delimiter">;; </span><span class="org-comment">for M-x info</span>
  (eval-after-load <span class="org-string">"info"</span>
    <span class="org-highlight-quoted-quote">'</span>(define-key Info-mode-map (kbd <span class="org-string">"&lt;C-return&gt;"</span>) <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">eir-eval-in-ielm</span>))
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Shell support</span>
  (<span class="org-keyword">require</span> <span class="org-highlight-quoted-quote">'</span><span class="org-constant">eval-in-repl-shell</span>)
  (add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">sh-mode-hook</span>
            <span class="org-highlight-quoted-quote">'</span>(lambda()
               (local-set-key (kbd <span class="org-string">"C-&lt;return&gt;"</span>) <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">eir-eval-in-shell</span>)))
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Version with opposite behavior to eir-jump-after-eval configuration</span>
  (<span class="org-keyword">defun</span> <span class="org-function-name">eir-eval-in-shell2</span> ()
    <span class="org-doc">"eval-in-repl for shell script (opposite behavior)</span>

<span class="org-doc">This version has the opposite behavior to the eir-jump-after-eval</span>
<span class="org-doc">configuration when invoked to evaluate a line."</span>
    (<span class="org-keyword">interactive</span>)
    (<span class="org-keyword">let</span> ((eir-jump-after-eval (not eir-jump-after-eval)))
      (eir-eval-in-shell)))
  (add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">sh-mode-hook</span>
            <span class="org-highlight-quoted-quote">'</span>(lambda()
               (local-set-key (kbd <span class="org-string">"C-&lt;return&gt;"</span>) <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">eir-eval-in-shell2</span>))))
</pre>
</div>
</div>
</div>
