help.org
** Encryption
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:DF56C626-A2CD-4011-9B2E-9863E72F0563
   :END:

Easy to use file-based AES encryption.

#+NAME: org_gcr_2017-05-12_mara_A9233A74-18F8-4C65-AC14-1A6C41F69B80
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path (getenv "CCRYPT"))
(use-package ps-ccrypt)
#+END_SRC

** Eshell
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:5FED47A4-C1F3-4866-AF87-86996BC999CA
   :END:

Provide a cross-platform command line shell that is a first-class EMACS citizen.

Commands input in eshell are delegated in order to an alias, a built in command,
an Elisp function with the same name, and finally to a system call. Semicolons
separate commands. =which= tells you what implementation will satisfy the call
that you are going to make. The flag =eshell-prefer-lisp-functions= does what it
says. =$$= is the result of the last command. Aliases live in
=eshell-aliases-file=. History is maintained and expandable. =eshell-source-file=
will run scripts. Since Eshell is not a terminal emulator, you need to configure
it for any commands that need to run using a terminal emulator by adding it to
to =eshell-visual-commands=.

#+NAME: org_gcr_2017-05-12_mara_E5296E8A-C433-4FBF-97EE-8B95918B5A06
#+BEGIN_SRC emacs-lisp
(setq eshell-prefer-lisp-functions nil
      eshell-cmpl-cycle-completions nil
      eshell-save-history-on-exit t
      eshell-cmpl-dir-ignore "\\`\\(\\.\\.?\\|CVS\\|\\.svn\\|\\.git\\)/\\'")

(eval-after-load "esh-opt"
  '(progn
     (use-package em-cmpl)
     (use-package em-prompt)
     (use-package em-term)
     (setenv "PAGER" "cat")
     (add-hook 'eshell-mode-hook
               (lambda ()
                 (message "Welcome to Eshell.")
                 (setq pcomplete-cycle-completions nil)))
     (add-to-list 'eshell-visual-commands "ssh")
     (add-to-list 'eshell-visual-commands "tail")
     (add-to-list 'eshell-command-completions-alist
                  '("tar" "\\(\\.tar|\\.tgz\\|\\.tar\\.gz\\)\\'"))))
#+END_SRC

Configure a =PS1= like prompt.

#+NAME: org_gcr_2017-05-12_mara_47F75687-F505-42B3-9E2B-EA832B41F7EC
#+BEGIN_SRC emacs-lisp
(setq eshell-prompt-regexp "^.+@.+:.+> ")
(setq eshell-prompt-function
      (lambda ()
        (concat
         (user-login-name)
         "@"
         (system-name)
         ":"
         (eshell/pwd)
         "> ")))
#+END_SRC

