help.html

<div id="outline-container-orgdc54e25" class="outline-3">
<h3 id="orgdc54e25"><span class="section-number-3">3.9</span> Encryption</h3>
<div class="outline-text-3" id="text-3-9">
<pre class="example">
ID: org_gcr_2017-05-12_mara:DF56C626-A2CD-4011-9B2E-9863E72F0563
</pre>

<p>
Easy to use file-based AES encryption.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orged9f62c">(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">load-path</span> (getenv <span class="org-string">"CCRYPT"</span>))
(<span class="org-keyword">use-package</span> <span class="org-constant">ps-ccrypt</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org6c77778" class="outline-3">
<h3 id="org6c77778"><span class="section-number-3">3.10</span> Eshell</h3>
<div class="outline-text-3" id="text-3-10">
<pre class="example">
ID: org_gcr_2017-05-12_mara:5FED47A4-C1F3-4866-AF87-86996BC999CA
</pre>

<p>
Provide a cross-platform command line shell that is a first-class EMACS citizen.
</p>

<p>
Commands input in eshell are delegated in order to an alias, a built in command,
an Elisp function with the same name, and finally to a system call. Semicolons
separate commands. <code>which</code> tells you what implementation will satisfy the call
that you are going to make. The flag <code>eshell-prefer-lisp-functions</code> does what it
says. <code>$$</code> is the result of the last command. Aliases live in
<code>eshell-aliases-file</code>. History is maintained and expandable. <code>eshell-source-file</code>
will run scripts. Since Eshell is not a terminal emulator, you need to configure
it for any commands that need to run using a terminal emulator by adding it to
to <code>eshell-visual-commands</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org6a77442">(<span class="org-keyword">setq</span> eshell-prefer-lisp-functions nil
      eshell-cmpl-cycle-completions nil
      eshell-save-history-on-exit t
      eshell-cmpl-dir-ignore <span class="org-string">"\\`</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">\\.\\.?</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">CVS</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">\\.svn</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">\\.git</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">/\\'"</span>)

(eval-after-load <span class="org-string">"esh-opt"</span>
  <span class="org-highlight-quoted-quote">'</span>(<span class="org-keyword">progn</span>
     (<span class="org-keyword">use-package</span> <span class="org-constant">em-cmpl</span>)
     (<span class="org-keyword">use-package</span> <span class="org-constant">em-prompt</span>)
     (<span class="org-keyword">use-package</span> <span class="org-constant">em-term</span>)
     (setenv <span class="org-string">"PAGER"</span> <span class="org-string">"cat"</span>)
     (add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">eshell-mode-hook</span>
               (<span class="org-keyword">lambda</span> ()
                 (message <span class="org-string">"Welcome to Eshell."</span>)
                 (<span class="org-keyword">setq</span> pcomplete-cycle-completions nil)))
     (add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">eshell-visual-commands</span> <span class="org-string">"ssh"</span>)
     (add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">eshell-visual-commands</span> <span class="org-string">"tail"</span>)
     (add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">eshell-command-completions-alist</span>
                  <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">"tar"</span> <span class="org-string">"</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">\\.tar|\\.tgz</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">\\.tar\\.gz</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">\\'"</span>))))
</pre>
</div>

<p>
Configure a <code>PS1</code> like prompt.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orge77693f">(<span class="org-keyword">setq</span> eshell-prompt-regexp <span class="org-string">"^.+@.+:.+&gt; "</span>)
(<span class="org-keyword">setq</span> eshell-prompt-function
      (<span class="org-keyword">lambda</span> ()
        (concat
         (user-login-name)
         <span class="org-string">"@"</span>
         (system-name)
         <span class="org-string">":"</span>
         (eshell/pwd)
         <span class="org-string">"&gt; "</span>)))
</pre>
</div>
</div>
</div>
