help.org
** File Based System
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:E57D0D2A-0BF5-4733-AE1B-7CEA95171316
   :END:

This system uses artifacts stored in files. It tries to persist file-stores
every chance it gets without interrupting the user's flow. Flow is important.

Don't create backup files. Instead Git for versioning

Automatically back file-stores if no activity has occurred.

#+NAME: org_gcr_2017-05-12_mara_11891C85-578F-417F-9956-FEBB52045CDC
#+BEGIN_SRC emacs-lisp
(setq auto-save-default t)
(setq make-backup-files nil)
(setq auto-save-visited-file-name t)
(setq auto-save-interval 0)
(setq auto-save-timeout (* 60 5))
#+END_SRC

Backup file-stores when the frame loses focus.

#+NAME: org_gcr_2017-05-12_mara_A02347F8-B3BB-4F43-8987-718530B6E053
#+BEGIN_SRC emacs-lisp
(add-hook 'focus-out-hook #'help/save-all-file-buffers)
#+END_SRC

Always keep buffers in-sync with changes in-file.

#+NAME: org_gcr_2017-05-12_mara_EE759660-2FB2-4BC1-AC4D-EFD21E5B02C0
#+BEGIN_SRC emacs-lisp
(global-auto-revert-mode 1)
(diminish 'auto-revert-mode)
#+END_SRC

Save all files before common activities. Functions are easier to use than
advice.

#+NAME: org_gcr_2017-05-12_mara_E2747C5E-DA22-4B22-9C0A-EB9DEED9A5F7
#+BEGIN_SRC emacs-lisp
(defun help/safb-help/vc-next-action ()
  (interactive)
  (help/save-all-file-buffers)
  (help/vc-next-action))

(defun help/safb-vc-ediff ()
  (interactive)
  (help/save-all-file-buffers)
  (vc-ediff nil))

(defun help/safb-vc-diff ()
  (interactive)
  (help/save-all-file-buffers)
  (vc-diff nil))

(defun help/safb-vc-revert ()
  (interactive)
  (help/save-all-file-buffers)
  (unless (bound-and-true-p diff-hl-mode) (diff-hl-mode))
  (vc-revert)
  (when (bound-and-true-p diff-hl-mode) (call-interactively 'diff-hl-mode nil)))

(defun help/safb-help/magit-status ()
  (interactive)
  (help/save-all-file-buffers)
  (help/magit-status))

(defun help/safb-org-babel-tangle ()
  (interactive)
  (help/save-all-file-buffers)
  (let ((start (current-time)))
    (message (concat "org-babel-tangle BEFORE: <"
                     (format-time-string "%Y-%m-%dT%T%z")
                     ">"))
    (org-babel-tangle)
    (let* ((dur (float-time (time-since start)))
           (msg (format "Tangling complete after: %.06f seconds" dur)))
      (message (concat "org-babel-tangle AFTER: <"
                       (format-time-string "%Y-%m-%dT%T%z")
                       ">"))
      (message msg)
      (help/on-gui (alert msg :title "org-mode")))))

(defun help/safb-org-babel-detangle ()
  (interactive)
  (help/save-all-file-buffers)
  (org-babel-detangle))

(defun help/safb-other-window ()
  (interactive)
  (help/save-all-file-buffers)
  (other-window 1))

(defun help/ace-window ()
  (interactive)
  (help/save-all-file-buffers)
  (call-interactively #'ace-window))

(defun help/safb-org-edit-src-code ()
  (interactive)
  (help/save-all-file-buffers)
  (org-edit-src-code))

(defun help/safb-org-export-dispatch ()
  (interactive)
  (help/save-all-file-buffers)
  (org-export-dispatch))

(defun help/safb-TeX-command-master (&optional arg)
  (interactive)
  (help/save-all-file-buffers)
  (TeX-command-master arg))

(defun help/safb-org-babel-execute-buffer ()
  "Immediately save results."
  (interactive)
  (help/save-all-file-buffers)
  (org-babel-execute-buffer)
  (help/save-all-file-buffers))

(defun help/safb-org-babel-execute-subtree ()
  "Immediately save results."
  (interactive)
  (help/save-all-file-buffers)
  (org-babel-execute-subtree)
  (help/save-all-file-buffers))

(defun help/safb-help/org-babel-demarcate-block ()
  (interactive)
  (help/org-babel-demarcate-block)
  (help/save-all-file-buffers))

(defun help/safb-save-buffers-kill-terminal ()
  "Partially redundant; kept for consistency among `SAFB' functions."
  (interactive)
  (help/save-all-file-buffers)
  (save-buffers-kill-terminal))

(defun help/safb-help/goto-line ()
  (interactive)
  (help/save-all-file-buffers)
  (help/goto-line))

(defun help/safb-switch-to-previous-buffer ()
  (interactive)
  (help/save-all-file-buffers)
  (switch-to-previous-buffer))

(defun help/safb-normal-mode ()
  (interactive)
  (help/save-all-file-buffers)
  (call-interactively #'normal-mode)
  (help/save-all-file-buffers))
#+END_SRC

Selection:

- Don't perform on frequent keys like enter and line navigation.

Future candidates:

- avy jump
- dired
- eshell
- ess-rdired
- eval-defun
- eval-region
- help/newline
- goto-line
- ido-switch-buffer
- ielm
- ispell
- ispell-word
- langtool-check-buffer
- newline-and-indent
- next-line
- org-edit-src-exit
- org-return
- pop-to-mark-command
- previous-line
- sp-newline
- with-current-buffer
- writegood-mode

Try to visit a non-existent file and get prompted to create its parent
directories.

#+NAME: org_gcr_2017-05-12_mara_CF605547-BD59-48FD-8CE1-47AD7F28D1B6
#+BEGIN_SRC emacs-lisp
(add-to-list 'find-file-not-found-functions #'help/create-non-existent-directory)
#+END_SRC

Be aware of files larger than 2MiB. Turn off Aggressive-Indent and other
expensive features in those buffers. NXML also seems to have a difficult time
with large files.

#+NAME: org_gcr_2017-05-12_mara_6F55AC0E-3877-4935-B93C-22A132C672AB
#+BEGIN_SRC emacs-lisp
(setq large-file-warning-threshold (* 1024 1024 2))
#+END_SRC

- Always use /tmp for temporary files
  - Via the thread "[O] org-file using tramp + babel?"

#+NAME: org_gcr_2017-05-12_mara_7102B5B4-168F-4E0E-87BD-EEA78DF6837A
#+BEGIN_SRC emacs-lisp
(setq temporary-file-directory "/tmp")
#+END_SRC

Probably never modify some files.

#+NAME: org_gcr_2017-05-12_mara_F0004AA3-B2A6-4265-A9D5-13590DCBEE9A
#+BEGIN_SRC emacs-lisp
(use-package hardhat
  :ensure t
  :diminish global-hardhat-mode
  :config
  (global-hardhat-mode 1))
#+END_SRC

