help.html

<div id="outline-container-orgd10d92f" class="outline-3">
<h3 id="orgd10d92f"><span class="section-number-3">3.11</span> File Based System</h3>
<div class="outline-text-3" id="text-3-11">
<pre class="example">
ID: org_gcr_2017-05-12_mara:E57D0D2A-0BF5-4733-AE1B-7CEA95171316
</pre>

<p>
This system uses artifacts stored in files. It tries to persist file-stores
every chance it gets without interrupting the user&rsquo;s flow. Flow is important.
</p>

<p>
Don&rsquo;t create backup files. Instead Git for versioning
</p>

<p>
Automatically back file-stores if no activity has occurred.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org99fe457">(<span class="org-keyword">setq</span> auto-save-default t)
(<span class="org-keyword">setq</span> make-backup-files nil)
(<span class="org-keyword">setq</span> auto-save-visited-file-name t)
(<span class="org-keyword">setq</span> auto-save-interval 0)
(<span class="org-keyword">setq</span> auto-save-timeout (* 60 5))
</pre>
</div>

<p>
Backup file-stores when the frame loses focus.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org3b9db10">(add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">focus-out-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/save-all-file-buffers</span>)
</pre>
</div>

<p>
Always keep buffers in-sync with changes in-file.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgf86e488">(global-auto-revert-mode 1)
(diminish <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">auto-revert-mode</span>)
</pre>
</div>

<p>
Save all files before common activities. Functions are easier to use than
advice.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orga175aaf">(<span class="org-keyword">defun</span> <span class="org-function-name">help/safb-help/vc-next-action</span> ()
  (<span class="org-keyword">interactive</span>)
  (help/save-all-file-buffers)
  (help/vc-next-action))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/safb-vc-ediff</span> ()
  (<span class="org-keyword">interactive</span>)
  (help/save-all-file-buffers)
  (vc-ediff nil))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/safb-vc-diff</span> ()
  (<span class="org-keyword">interactive</span>)
  (help/save-all-file-buffers)
  (vc-diff nil))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/safb-vc-revert</span> ()
  (<span class="org-keyword">interactive</span>)
  (help/save-all-file-buffers)
  (<span class="org-keyword">unless</span> (<span class="org-keyword">bound-and-true-p</span> diff-hl-mode) (diff-hl-mode))
  (vc-revert)
  (<span class="org-keyword">when</span> (<span class="org-keyword">bound-and-true-p</span> diff-hl-mode) (call-interactively <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">diff-hl-mode</span> nil)))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/safb-help/magit-status</span> ()
  (<span class="org-keyword">interactive</span>)
  (help/save-all-file-buffers)
  (help/magit-status))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/safb-org-babel-tangle</span> ()
  (<span class="org-keyword">interactive</span>)
  (help/save-all-file-buffers)
  (<span class="org-keyword">let</span> ((start (current-time)))
    (message (concat <span class="org-string">"org-babel-tangle BEFORE: &lt;"</span>
                     (format-time-string <span class="org-string">"%Y-%m-%dT%T%z"</span>)
                     <span class="org-string">"&gt;"</span>))
    (org-babel-tangle)
    (<span class="org-keyword">let*</span> ((dur (float-time (time-since start)))
           (msg (format <span class="org-string">"Tangling complete after: %.06f seconds"</span> dur)))
      (message (concat <span class="org-string">"org-babel-tangle AFTER: &lt;"</span>
                       (format-time-string <span class="org-string">"%Y-%m-%dT%T%z"</span>)
                       <span class="org-string">"&gt;"</span>))
      (message msg)
      (<span class="org-keyword">help/on-gui</span> (alert msg <span class="org-builtin">:title</span> <span class="org-string">"org-mode"</span>)))))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/safb-org-babel-detangle</span> ()
  (<span class="org-keyword">interactive</span>)
  (help/save-all-file-buffers)
  (org-babel-detangle))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/safb-other-window</span> ()
  (<span class="org-keyword">interactive</span>)
  (help/save-all-file-buffers)
  (other-window 1))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/ace-window</span> ()
  (<span class="org-keyword">interactive</span>)
  (help/save-all-file-buffers)
  (call-interactively <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">ace-window</span>))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/safb-org-edit-src-code</span> ()
  (<span class="org-keyword">interactive</span>)
  (help/save-all-file-buffers)
  (org-edit-src-code))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/safb-org-export-dispatch</span> ()
  (<span class="org-keyword">interactive</span>)
  (help/save-all-file-buffers)
  (org-export-dispatch))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/safb-TeX-command-master</span> (<span class="org-type">&amp;optional</span> arg)
  (<span class="org-keyword">interactive</span>)
  (help/save-all-file-buffers)
  (TeX-command-master arg))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/safb-org-babel-execute-buffer</span> ()
  <span class="org-doc">"Immediately save results."</span>
  (<span class="org-keyword">interactive</span>)
  (help/save-all-file-buffers)
  (org-babel-execute-buffer)
  (help/save-all-file-buffers))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/safb-org-babel-execute-subtree</span> ()
  <span class="org-doc">"Immediately save results."</span>
  (<span class="org-keyword">interactive</span>)
  (help/save-all-file-buffers)
  (org-babel-execute-subtree)
  (help/save-all-file-buffers))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/safb-help/org-babel-demarcate-block</span> ()
  (<span class="org-keyword">interactive</span>)
  (help/org-babel-demarcate-block)
  (help/save-all-file-buffers))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/safb-save-buffers-kill-terminal</span> ()
  <span class="org-doc">"Partially redundant; kept for consistency among `</span><span class="org-doc"><span class="org-constant">SAFB</span></span><span class="org-doc">' functions."</span>
  (<span class="org-keyword">interactive</span>)
  (help/save-all-file-buffers)
  (save-buffers-kill-terminal))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/safb-help/goto-line</span> ()
  (<span class="org-keyword">interactive</span>)
  (help/save-all-file-buffers)
  (help/goto-line))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/safb-switch-to-previous-buffer</span> ()
  (<span class="org-keyword">interactive</span>)
  (help/save-all-file-buffers)
  (switch-to-previous-buffer))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/safb-normal-mode</span> ()
  (<span class="org-keyword">interactive</span>)
  (help/save-all-file-buffers)
  (call-interactively <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">normal-mode</span>)
  (help/save-all-file-buffers))
</pre>
</div>

<p>
Selection:
</p>

<ul class="org-ul">
<li>Don&rsquo;t perform on frequent keys like enter and line navigation.</li>
</ul>

<p>
Future candidates:
</p>

<ul class="org-ul">
<li>avy jump</li>
<li>dired</li>
<li>eshell</li>
<li>ess-rdired</li>
<li>eval-defun</li>
<li>eval-region</li>
<li>help/newline</li>
<li>goto-line</li>
<li>ido-switch-buffer</li>
<li>ielm</li>
<li>ispell</li>
<li>ispell-word</li>
<li>langtool-check-buffer</li>
<li>newline-and-indent</li>
<li>next-line</li>
<li>org-edit-src-exit</li>
<li>org-return</li>
<li>pop-to-mark-command</li>
<li>previous-line</li>
<li>sp-newline</li>
<li>with-current-buffer</li>
<li>writegood-mode</li>
</ul>

<p>
Try to visit a non-existent file and get prompted to create its parent
directories.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org9ee701b">(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">find-file-not-found-functions</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/create-non-existent-directory</span>)
</pre>
</div>

<p>
Be aware of files larger than 2MiB. Turn off Aggressive-Indent and other
expensive features in those buffers. NXML also seems to have a difficult time
with large files.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org98fde5a">(<span class="org-keyword">setq</span> large-file-warning-threshold (* 1024 1024 2))
</pre>
</div>

<ul class="org-ul">
<li>Always use /tmp for temporary files
<ul class="org-ul">
<li>Via the thread &ldquo;[O] org-file using tramp + babel?&rdquo;</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgd0a20dc">(<span class="org-keyword">setq</span> temporary-file-directory <span class="org-string">"/tmp"</span>)
</pre>
</div>

<p>
Probably never modify some files.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orge93517e">(<span class="org-keyword">use-package</span> <span class="org-constant">hardhat</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:diminish</span> global-hardhat-mode
  <span class="org-builtin">:config</span>
  (global-hardhat-mode 1))
</pre>
</div>
</div>
</div>
