help.html

<div id="outline-container-orga053b29" class="outline-3">
<h3 id="orga053b29"><span class="section-number-3">3.12</span> File-system/directory management (Console)</h3>
<div class="outline-text-3" id="text-3-12">
<pre class="example">
ID: org_gcr_2017-05-12_mara:AACEA837-9B4D-484A-B6C9-6C04DD8DE8A7
</pre>

<p>
You can use the usual machinery to work with the files. Highlight a region
and operation selections occur for all files in that region. Commands are
scheduled, and then executed, upon your command. Files can be viewed in modify
or read-only mode, too. There is an idea of <code>mark</code> in files, which is to select
them and perform operations on the marked files. There are helper methods for
most things you can think if like directories or modified-files or whatever,
meaning you can use regexen to mark whatever you like however you like. If that
suits you, then don&rsquo;t be afraid of using the regular expression builder
that is built into EMACS. Bulk marked file operations include additionally
copying, deleting, creating hard links to, renaming, modifying the mode,
owner, and group information, changing the time-stamp, listing the marked
files, compressing them, decrypting, verifying and signing, loading or byte
compiling them (Lisp files).
</p>

<p>
<code>g</code> updates the current buffer; <code>s</code> orders the listing by alpha or date-time.
</p>

<p>
<code>find-name-dired</code> beings the results back into Dired, which is nifty.
</p>

<p>
Wdired lets you modify files directly via the UI, which is interesting. Image-Dired
lets you do just that.
</p>

<p>
<code>+</code> creates a new directory. <code>dired-copy-filename-as-kill</code> stores the list of
files you have selected in the kill ring. <code>dired-compare-directories</code> lets you
perform all sorts of directory comparisons, a handy tool that you need once in
a while but definitely do need.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org1948454">(<span class="org-keyword">defun</span> <span class="org-function-name">help/dired-copy-filename</span> ()
  <span class="org-doc">"Push the path and filename of the file under the point to the kill ring.</span>
<span class="org-doc">Attribution: URL `</span><span class="org-doc"><span class="org-constant">https://lists.gnu.org/archive/html/help-gnu-emacs/2002-10/msg00556.html</span></span><span class="org-doc">'"</span>
  (<span class="org-keyword">interactive</span>)
  (message <span class="org-string">"Added %s to kill ring"</span> (kill-new (dired-get-filename))))
(<span class="org-keyword">defun</span> <span class="org-function-name">help/dired-copy-path</span> ()
  <span class="org-doc">"Push the path of the directory under the point to the kill ring."</span>
  (<span class="org-keyword">interactive</span>)
  (message <span class="org-string">"Added %s to kill ring"</span> (kill-new default-directory)))
(<span class="org-keyword">setq</span> dired-listing-switches <span class="org-string">"-alh"</span>)
(<span class="org-keyword">setq</span> dired-recursive-deletes <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">top</span>)
(<span class="org-keyword">use-package</span> <span class="org-constant">dired-details+</span>
  <span class="org-builtin">:ensure</span> t)
(<span class="org-keyword">setq-default</span> dired-details-hidden-string <span class="org-string">""</span>)
(<span class="org-keyword">defun</span> <span class="org-function-name">help/dired-mode-hook-fn</span> ()
  <span class="org-doc">"HELP dired customizations."</span>
  (local-set-key <span class="org-string">"c"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/dired-copy-filename</span>)
  (local-set-key <span class="org-string">"]"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/dired-copy-path</span>)
  (diff-hl-dired-mode)
  (load <span class="org-string">"dired-x"</span>)
  (turn-on-stripe-buffer-mode)
  (dired-collapse-mode))
(add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">dired-mode-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/dired-mode-hook-fn</span>)
</pre>
</div>

<p>
Try to guess the target directory for operations.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgbce6517">(<span class="org-keyword">setq</span> dired-dwim-target t)
</pre>
</div>

<p>
Use EMACS <code>ls</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org3ea1fa9">(<span class="org-keyword">help/on-osx</span>
 (<span class="org-keyword">setq</span> ls-lisp-use-insert-directory-program nil)
 (<span class="org-keyword">use-package</span> <span class="org-constant">ls-lisp</span>))
</pre>
</div>

<p>
After dabbling, something happened that really changed my mind. These three
articles changed everything: <a href="http://www.masteringemacs.org/articles/2014/04/10/dired-shell-commands-find-xargs-replacement/">Dired Shell Command</a>, <a href="https://www.masteringemacs.org/article/working-multiple-files-dired">
Working with multiple files in dired</a>, and <a href="https://www.masteringemacs.org/article/wdired-editable-dired-buffers">WDired: Editable Dired Buffers</a>..
They just made the power of Dired so obvious, and so easy to use, that it
instantly because delightful to use. That was very, very cool. Even though I
was really, really happy with Finder and Explorer&#x2026; suddenly it just became so
obvious and pleasant to use Dired. That is so wild.
</p>

<p>
Key notes when executing shell commands on file selection&#x2026;
</p>

<p>
Substitution:
</p>
<dl class="org-dl">
<dt><code>&lt;cmd&gt; ?</code></dt><dd>1* calls to cmd, each file a single argument</dd>
<dt><code>&lt;cmd&gt; *</code></dt><dd>1 call to <code>cmd</code>, selected list as argument</dd>
<dt><code>&lt;cmd&gt; *""</code></dt><dd>have the shell expand the * as a globbing wild-card
<ul class="org-ul">
<li>Not sure what this means</li>
</ul></dd>
</dl>

<p>
Synchronicity:
</p>
<dl class="org-dl">
<dt><code>&lt;cmd&gt; ...</code></dt><dd>by default commands are called synchronously</dd>
<dt><code>&lt;cmd&gt; &amp;</code></dt><dd>execute in parallel</dd>
<dt><code>&lt;cmd&gt; ;</code></dt><dd>execute sequentially, asynchronously</dd>
<dt><code>&lt;cmd&gt; ;&amp;</code></dt><dd>execute in parallel, asynchronously</dd>
</dl>

<p>
Key notes on working with files in multiple directories&#x2026; use the following:
</p>

<p>
Use <code>find</code> just like you would at the command line and all of the results show
up in a single Dired buffer that you may work with just like you would any other
file appearing in a Dired buffer. The abstraction here becomes so obvious, you
may ask yourself why you never considered such a thing <i>before</i> now (as I did):
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgc51ccf5">(<span class="org-keyword">use-package</span> <span class="org-constant">find-dired</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">setq</span> find-ls-option <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">"-print0 | xargs -0 ls -ld"</span> . <span class="org-string">"-ld"</span>)))
</pre>
</div>

<p>
Noting that:
</p>
<dl class="org-dl">
<dt><code>find-dired</code></dt><dd>is the general use case</dd>
<dt><code>find-name-dired</code></dt><dd>is for simple, single string cases</dd>
</dl>

<p>
And if you want to use the faster Elisp version, that uses lisp regex, use:
</p>
<dl class="org-dl">
<dt><code>find-lisp-find-dired</code></dt><dd>for anything</dd>
<dt><code>find-lisp-find-dired-subdirectories</code></dt><dd>for only directories</dd>
</dl>

<p>
Key notes on working with editable buffers&#x2026;
</p>

<p>
As the author notes, you probably already instinctually knew what is possible.
After reading his brief and concise exposition, it would be hard <i>not</i> to
intuit what is possible! The options are big if you make a writable file buffer.
Think about using multiple cursors. Done? Well, that is a no-brainer. Once you
grok multiple cursors just <code>find-dired</code> what you need and then do what you need
to do to it. Very cool.
</p>

<dl class="org-dl">
<dt><code>dired-toggle-read-only, C-x C-q</code></dt><dd>cycle between dired-mode and wdired-mode</dd>
<dt><code>wdired-finish-edit, C-c C-c</code></dt><dd>commit your changes</dd>
<dt><code>wdired-abort-changes, C-c ESC</code></dt><dd>revert your changes</dd>
</dl>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orga4b80dc">(<span class="org-keyword">use-package</span> <span class="org-constant">wdired</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">setq</span> wdired-allow-to-change-permissions t)
  (<span class="org-keyword">setq</span> wdired-allow-to-redirect-links t)
  (<span class="org-keyword">setq</span> wdired-use-interactive-rename t)
  (<span class="org-keyword">setq</span> wdired-confirm-overwrite t)
  (<span class="org-keyword">setq</span> wdired-use-dired-vertical-movement <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">sometimes</span>))
</pre>
</div>

<p>
When you selected a bunch of files or directories, you <i>may</i> want to communicate
somewhere your selection somehow. The simplest way to do this is to utilize
<code>dired-copy-filename-as-kill</code>. What a nice idea, and its default binding is <code>w</code>.
</p>

<p>
Since I started using a menu bar again, and wanting to get Imenu really
exercised, Dired in Imenu seems like an obvious choice.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orga2db363">(<span class="org-keyword">use-package</span> <span class="org-constant">dired-imenu</span>
  <span class="org-builtin">:ensure</span> t)
</pre>
</div>

<p>
Use Ido with Dired.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgea978e9">(<span class="org-keyword">setq</span> ido-show-dot-for-dired t)
</pre>
</div>

<p>
Collapse long empty paths.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org9b446ea">(<span class="org-keyword">use-package</span> <span class="org-constant">dired-collapse</span>
  <span class="org-builtin">:ensure</span> t)
</pre>
</div>
</div>
</div>
