help.org
** IMenu
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:12791F68-A7B0-4F93-9648-386C65C09355
   :END:

Major productivity hack

#+NAME: org_gcr_2017-05-12_mara_B746C905-E59E-4F33-88F9-5F6CD32C0DE2
#+BEGIN_SRC emacs-lisp
(use-package imenu
  :config
  (setq imenu-sort-function #'imenu--sort-by-name))
(defun help/try-to-add-imenu ()
  "Add Imenu to modes that have `font-lock-mode' activated.

Attribution: URL http://www.emacswiki.org/emacs/ImenuMode"
  (condition-case nil (imenu-add-to-menubar "Imenu") (error nil)))
(add-hook 'font-lock-mode-hook #'help/try-to-add-imenu)
#+END_SRC

Provide it in a buffer.

#+NAME: org_gcr_2017-05-12_mara_E8A1EB03-CB72-4761-BC0A-555670C0D452
#+BEGIN_SRC emacs-lisp
(use-package imenu-list
  :ensure t
  :config
  (setq imenu-list-focus-after-activation t)
  (setq imenu-list-auto-resize t)
  (setq imenu-list-position 'left)
  (setq imenu-list-size 40))
#+END_SRC

** Interactively DO Things
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:29AAB820-5824-43F8-9E7F-7FD1CB6F4624
   :END:

IDO is used everywhere possible.

Access nearly every object available in this system from one place.

These configurations are performed in the correct order. Any attempt to refactor
this Source-Block will break Ido in this system.

#+NAME: org_gcr_2017-05-12_mara_9F4ACDEA-BC93-4BB6-BEA2-B622FF676EB6
#+BEGIN_SRC emacs-lisp
(use-package ido)
(use-package flx-ido
  :ensure t
  :config
  (ido-mode t))
(use-package ido-hacks
  :ensure t)
(use-package ido-completing-read+
  :config
  (ido-ubiquitous-mode t)
  (setq ido-create-new-buffer 'always)
  (flx-ido-mode t)
  (setq ido-use-faces nil))
(use-package ido-vertical-mode
  :ensure t
  :config
  (ido-vertical-mode t)
  (setq ido-vertical-define-keys 'C-n-C-p-up-down-left-right))
#+END_SRC

Make functions search-able.

#+NAME: org_gcr_2017-05-12_mara_8C3DB0A1-305E-4746-8455-E8CB880842B1
#+BEGIN_SRC emacs-lisp
(use-package smex
  :ensure t
  :config
  (smex-initialize))
#+END_SRC

Make URLs a first-class object.

#+NAME: org_gcr_2017-05-12_mara_5295DEDE-687E-440B-89B9-9BF9BF301595
#+BEGIN_SRC emacs-lisp
(setq ido-use-url-at-point t)
(setq ido-use-filename-at-point 'guess)
#+END_SRC

** Font
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:D12919AC-9D9B-4C40-9872-1E01C92FA493
   :END:

Configure the [[http://endlessparentheses.com/manually-choose-a-fallback-font-for-unicode.html][manual configuration of a fallback]] Unicode font.

#+NAME: org_gcr_2017-05-12_mara_501304FE-D5DB-40FA-B1BB-01A580C4A155
#+BEGIN_SRC emacs-lisp
(set-fontset-font "fontset-default" nil
                  (font-spec :size 20 :name "Symbola"))
#+END_SRC

Here are the Unicode fonts that provide nearly everything.

| Name    | Version | URL | Comments                 |
|---------+---------+-----+--------------------------|
| [[http://sourceforge.net/projects/dejavu/files/dejavu/2.34/dejavu-fonts-ttf-2.34.tar.bz2][DejaVu]]  |    2.43 | [[http://sourceforge.net/projects/dejavu/files/dejavu/2.34/dejavu-fonts-ttf-2.34.tar.bz2][.]]   | Modern classic           |
| [[http://users.teilar.gr/~g1951d/][Symbola]] |    7.17 | [[http://users.teilar.gr/~g1951d/Symbola.zip][.]]   | Neat                     |
| [[http://www.quivira-font.com/][Quivira]] |     4.0 | [[http://www.quivira-font.com/files/Quivira.otf][.]]   | Amazing                  |
| [[https://code.google.com/p/noto/][Noto]]    |       ? | [[http://noto.googlecode.com/git/fonts/individual/hinted/NotoSans-Regular.ttc][1]] [[http://noto.googlecode.com/git/fonts/individual/unhinted/NotoSansSymbols-Regular.ttf][2]] | Has morse code, and more |

To test it run =view-hello-file= and =M-x list-charset-chars RET unicode-bmp RET=.

Activate font locking everywhere possible.

#+NAME: org_gcr_2017-05-12_mara_ADAB043E-BF70-4AE0-BA60-CD08D82474FA
#+BEGIN_SRC emacs-lisp
(global-font-lock-mode t)
#+END_SRC

** Going to Objects
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:8A73E509-A878-4E89-86DC-9BDA8C898F8C
   :END:

Go to any object in the frame quickly.

#+NAME: org_gcr_2017-05-12_mara_2B0564C9-2091-4364-8A28-E33A548284A2
#+BEGIN_SRC emacs-lisp
(use-package avy
  :ensure t
  :config)
#+END_SRC

