help.html

<div id="outline-container-org9a8f636" class="outline-3">
<h3 id="org9a8f636"><span class="section-number-3">3.13</span> IMenu</h3>
<div class="outline-text-3" id="text-3-13">
<pre class="example">
ID: org_gcr_2017-05-12_mara:12791F68-A7B0-4F93-9648-386C65C09355
</pre>

<p>
Major productivity hack
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgedafac5">(<span class="org-keyword">use-package</span> <span class="org-constant">imenu</span>
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">setq</span> imenu-sort-function <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">imenu--sort-by-name</span>))
(<span class="org-keyword">defun</span> <span class="org-function-name">help/try-to-add-imenu</span> ()
  <span class="org-doc">"Add Imenu to modes that have `</span><span class="org-doc"><span class="org-constant">font-lock-mode</span></span><span class="org-doc">' activated.</span>

<span class="org-doc">Attribution: URL http://www.emacswiki.org/emacs/ImenuMode"</span>
  (<span class="org-keyword">condition-case</span> nil (imenu-add-to-menubar <span class="org-string">"Imenu"</span>) (<span class="org-warning">error</span> nil)))
(add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">font-lock-mode-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/try-to-add-imenu</span>)
</pre>
</div>

<p>
Provide it in a buffer.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orga1171c4">(<span class="org-keyword">use-package</span> <span class="org-constant">imenu-list</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">setq</span> imenu-list-focus-after-activation t)
  (<span class="org-keyword">setq</span> imenu-list-auto-resize t)
  (<span class="org-keyword">setq</span> imenu-list-position <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">left</span>)
  (<span class="org-keyword">setq</span> imenu-list-size 40))
</pre>
</div>
</div>
</div>

<div id="outline-container-org998052a" class="outline-3">
<h3 id="org998052a"><span class="section-number-3">3.14</span> Interactively DO Things</h3>
<div class="outline-text-3" id="text-3-14">
<pre class="example">
ID: org_gcr_2017-05-12_mara:29AAB820-5824-43F8-9E7F-7FD1CB6F4624
</pre>

<p>
IDO is used everywhere possible.
</p>

<p>
Access nearly every object available in this system from one place.
</p>

<p>
These configurations are performed in the correct order. Any attempt to refactor
this Source-Block will break Ido in this system.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org7fb676c">(<span class="org-keyword">use-package</span> <span class="org-constant">ido</span>)
(<span class="org-keyword">use-package</span> <span class="org-constant">flx-ido</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (ido-mode t))
(<span class="org-keyword">use-package</span> <span class="org-constant">ido-hacks</span>
  <span class="org-builtin">:ensure</span> t)
(<span class="org-keyword">use-package</span> <span class="org-constant">ido-completing-read+</span>
  <span class="org-builtin">:config</span>
  (ido-ubiquitous-mode t)
  (<span class="org-keyword">setq</span> ido-create-new-buffer <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">always</span>)
  (flx-ido-mode t)
  (<span class="org-keyword">setq</span> ido-use-faces nil))
(<span class="org-keyword">use-package</span> <span class="org-constant">ido-vertical-mode</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (ido-vertical-mode t)
  (<span class="org-keyword">setq</span> ido-vertical-define-keys <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">C-n-C-p-up-down-left-right</span>))
</pre>
</div>

<p>
Make functions search-able.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgbfff86b">(<span class="org-keyword">use-package</span> <span class="org-constant">smex</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (smex-initialize))
</pre>
</div>

<p>
Make URLs a first-class object.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgecbaa62">(<span class="org-keyword">setq</span> ido-use-url-at-point t)
(<span class="org-keyword">setq</span> ido-use-filename-at-point <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">guess</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org23bdc87" class="outline-3">
<h3 id="org23bdc87"><span class="section-number-3">3.15</span> Font</h3>
<div class="outline-text-3" id="text-3-15">
<pre class="example">
ID: org_gcr_2017-05-12_mara:D12919AC-9D9B-4C40-9872-1E01C92FA493
</pre>

<p>
Configure the <a href="http://endlessparentheses.com/manually-choose-a-fallback-font-for-unicode.html">manual configuration of a fallback</a> Unicode font.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgc0996a8">(set-fontset-font <span class="org-string">"fontset-default"</span> nil
                  (font-spec <span class="org-builtin">:size</span> 20 <span class="org-builtin">:name</span> <span class="org-string">"Symbola"</span>))
</pre>
</div>

<p>
Here are the Unicode fonts that provide nearly everything.
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-right">Version</th>
<th scope="col" class="org-left">URL</th>
<th scope="col" class="org-left">Comments</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="http://sourceforge.net/projects/dejavu/files/dejavu/2.34/dejavu-fonts-ttf-2.34.tar.bz2">DejaVu</a></td>
<td class="org-right">2.43</td>
<td class="org-left"><a href="http://sourceforge.net/projects/dejavu/files/dejavu/2.34/dejavu-fonts-ttf-2.34.tar.bz2">.</a></td>
<td class="org-left">Modern classic</td>
</tr>

<tr>
<td class="org-left"><a href="http://users.teilar.gr/~g1951d/">Symbola</a></td>
<td class="org-right">7.17</td>
<td class="org-left"><a href="http://users.teilar.gr/~g1951d/Symbola.zip">.</a></td>
<td class="org-left">Neat</td>
</tr>

<tr>
<td class="org-left"><a href="http://www.quivira-font.com/">Quivira</a></td>
<td class="org-right">4.0</td>
<td class="org-left"><a href="http://www.quivira-font.com/files/Quivira.otf">.</a></td>
<td class="org-left">Amazing</td>
</tr>

<tr>
<td class="org-left"><a href="https://code.google.com/p/noto/">Noto</a></td>
<td class="org-right">?</td>
<td class="org-left"><a href="http://noto.googlecode.com/git/fonts/individual/hinted/NotoSans-Regular.ttc">1</a> <a href="http://noto.googlecode.com/git/fonts/individual/unhinted/NotoSansSymbols-Regular.ttf">2</a></td>
<td class="org-left">Has morse code, and more</td>
</tr>
</tbody>
</table>

<p>
To test it run <code>view-hello-file</code> and <code>M-x list-charset-chars RET unicode-bmp RET</code>.
</p>

<p>
Activate font locking everywhere possible.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org62521ad">(global-font-lock-mode t)
</pre>
</div>
</div>
</div>

<div id="outline-container-org2e9c05b" class="outline-3">
<h3 id="org2e9c05b"><span class="section-number-3">3.16</span> Going to Objects</h3>
<div class="outline-text-3" id="text-3-16">
<pre class="example">
ID: org_gcr_2017-05-12_mara:8A73E509-A878-4E89-86DC-9BDA8C898F8C
</pre>

<p>
Go to any object in the frame quickly.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org9d47f3a">(<span class="org-keyword">use-package</span> <span class="org-constant">avy</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>)
</pre>
</div>
</div>
</div>
