help.org
** Grammar
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:2E0F4D9D-5AB6-407C-BBC6-BD0277ECA015
   :END:

Warn of poor grammar immediately interrupting flow with a visual indicator.

#+NAME: org_gcr_2017-05-12_mara_9336B241-3511-4BB1-9CBA-30CA8BD4EFAB
#+BEGIN_SRC emacs-lisp
(use-package writegood-mode
  :ensure t
  :config
  (eval-after-load "writegood-mode"
    '(diminish 'writegood-mode)))
#+END_SRC

Integrate Langtool.

#+NAME: org_gcr_2017-05-12_mara_1CB16C79-7EC3-4375-BAD3-FC612A1C0B9B
#+BEGIN_SRC emacs-lisp
(use-package langtool
  :ensure t
  :init
  (setq langtool-language-tool-jar (getenv "LANGTOOL"))
  (setq langtool-mother-tongue "en")
  (setq langtool-java-bin (concat (getenv "JAVA_HOME") "/bin/java"))
  (setq langtool-disabled-rules nil)
  (setq langtool-java-user-arguments '("-Dfile.encoding=UTF-8"))
  (setq langtool-user-arguments nil)
  (defhydra help/hydra/both/langtool (:color blue :hint nil)
    "
 Langtool:^         ^|^                   ^|^
-------------------^^+^-------------------^+^----------------------
 _h_: check buffer   | _j_: next error     | _i_: brief message
 _y_: corrent buffer | _k_: previous error | _o_: detailed message
 _n_: finished       | _q_: quit           |
 "
    ("h" langtool-check :exit nil)
    ("y" langtool-correct-buffer :exit nil)
    ("n" langtool-check-done)

    ("j" langtool-goto-next-error :exit nil)
    ("k" langtool-goto-previous-error :exit nil)

    ("i" langtool-show-brief-message-at-point :exit nil)
    ("o" langtool-show-message-at-point :exit nil)

    ("q" nil))
  (key-chord-define-global "qk" #'help/hydra/both/langtool/body))
#+END_SRC

Integrate Proselint. I wanted to load the executable location from
=PROSELINT_HOME= but I haven't figured out how yet. ~flycheck-define-checker~ is a
macro but I don't know how to expand the string for use in the macro. I tried
quasiquote and that was wrong.

#+NAME: org_gcr_2017-05-12_mara_A17A873C-5FC0-473F-842F-875CA99981D5
#+BEGIN_SRC emacs-lisp
(with-eval-after-load "flycheck"
  (flycheck-define-checker proselint
    "A linter for prose."
    :command ("/Users/gcr/proselint/env/bin/proselint" source-inplace)
    :error-patterns
    ((warning line-start (file-name) ":" line ":" column ": "
              (id (one-or-more (not (any " "))))
              (message (one-or-more not-newline)
                       (zero-or-more "\n" (any " ") (one-or-more not-newline)))
              line-end))
    :modes (text-mode org-mode markdown-mode gfm-mode))
  (add-to-list 'flycheck-checkers 'proselint))
#+END_SRC

** Keyboard Macros
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:F2701D64-8484-4EB0-9FBD-692C98CA3C58
:END:

Keep many keyboard macros.

#+NAME: org_gcr_2017-05-12_mara_54E04F50-33B3-411D-B759-19408AE1DE48
#+BEGIN_SRC emacs-lisp
(setq kmacro-ring-max 32)
#+END_SRC

Persist keyboard macros in Emacs Lisp alternative to ~insert-kbd-macro~.

#+NAME: org_gcr_2017-05-12_mara_0BE407C6-354F-4E92-B7DC-66000217CCE6
#+BEGIN_SRC emacs-lisp
(use-package elmacro
  :ensure t
  :diminish (elmacro-mode)
  :config
  (elmacro-mode))
#+END_SRC

** Intellisense
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:DE05FF62-53EA-491A-881B-650030210591
   :END:

#+NAME: org_gcr_2017-05-12_mara_909723A4-3234-40B4-B741-E59C3C9E3E0A
#+BEGIN_SRC emacs-lisp
(use-package fuzzy
  :ensure t)
(use-package auto-complete
  :ensure t
  :config
  (use-package auto-complete-config)
  (setq ac-quick-help-prefer-pos-tip nil)
  (ac-config-default)
  (setq ac-auto-start nil)
  (help/not-on-gui (ac-set-trigger-key "TAB"))
  (help/on-gui (ac-set-trigger-key "<tab>"))
  :diminish auto-complete-mode)
(use-package auto-complete-chunk
  :ensure t)
#+END_SRC

Auto-completion for =.=-separated words.

#+NAME: org_gcr_2017-05-12_mara_0F225CED-24F2-4801-A3AF-7E45BF787E71
#+BEGIN_SRC emacs-lisp
(use-package auto-complete-chunk
  :ensure t)
#+END_SRC

/IntelliJ-Like/ ~jump to definition~.

#+NAME: org_gcr_2017-05-17_mara_7D684DF7-2FF5-4386-B845-8F30E9D6E887
#+BEGIN_SRC emacs-lisp
(use-package dumb-jump
  :ensure t
  :config
  (defhydra help/hydra-left-side/dumb-jump (:color blue :hint nil)
    "
Dumb-Jump:
 _j_ go to _k_ return from _i_ choose
  _u_ in other window _o_ peek
  _q_ quit"
    ("j" dumb-jump-go)
    ("k" dumb-jump-back)
    ("i" dumb-jump-go-prompt)
    ("u" dumb-jump-go-other-window)
    ("o" dumb-jump-quick-look)
    ("q" nil))
  (key-chord-define-global "jj" #'help/hydra-left-side/dumb-jump/body))
#+END_SRC

