help.html

<div id="outline-container-orgcb178d8" class="outline-3">
<h3 id="orgcb178d8"><span class="section-number-3">3.17</span> Grammar</h3>
<div class="outline-text-3" id="text-3-17">
<pre class="example">
ID: org_gcr_2017-05-12_mara:2E0F4D9D-5AB6-407C-BBC6-BD0277ECA015
</pre>

<p>
Warn of poor grammar immediately interrupting flow with a visual indicator.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org0d45ab6">(<span class="org-keyword">use-package</span> <span class="org-constant">writegood-mode</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (eval-after-load <span class="org-string">"writegood-mode"</span>
    <span class="org-highlight-quoted-quote">'</span>(diminish <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">writegood-mode</span>)))
</pre>
</div>

<p>
Integrate Langtool.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orge3a5464">(<span class="org-keyword">use-package</span> <span class="org-constant">langtool</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> langtool-language-tool-jar (getenv <span class="org-string">"LANGTOOL"</span>))
  (<span class="org-keyword">setq</span> langtool-mother-tongue <span class="org-string">"en"</span>)
  (<span class="org-keyword">setq</span> langtool-java-bin (concat (getenv <span class="org-string">"JAVA_HOME"</span>) <span class="org-string">"/bin/java"</span>))
  (<span class="org-keyword">setq</span> langtool-disabled-rules nil)
  (<span class="org-keyword">setq</span> langtool-java-user-arguments <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">"-Dfile.encoding=UTF-8"</span>))
  (<span class="org-keyword">setq</span> langtool-user-arguments nil)
  (<span class="org-keyword">defhydra</span> help/hydra/both/langtool (<span class="org-builtin">:color</span> <span class="custom"><span class="custom-1">blue</span></span> <span class="org-builtin">:hint</span> nil)
    <span class="org-doc">"</span>
<span class="org-doc"> Langtool:^         ^|^                   ^|^</span>
<span class="org-doc">-------------------^^+^-------------------^+^----------------------</span>
<span class="org-doc"> _h_: check buffer   | _j_: next error     | _i_: brief message</span>
<span class="org-doc"> _y_: corrent buffer | _k_: previous error | _o_: detailed message</span>
<span class="org-doc"> _n_: finished       | _q_: quit           |</span>
<span class="org-doc"> "</span>
    (<span class="org-string">"h"</span> langtool-check <span class="org-builtin">:exit</span> nil)
    (<span class="org-string">"y"</span> langtool-correct-buffer <span class="org-builtin">:exit</span> nil)
    (<span class="org-string">"n"</span> langtool-check-done)

    (<span class="org-string">"j"</span> langtool-goto-next-error <span class="org-builtin">:exit</span> nil)
    (<span class="org-string">"k"</span> langtool-goto-previous-error <span class="org-builtin">:exit</span> nil)

    (<span class="org-string">"i"</span> langtool-show-brief-message-at-point <span class="org-builtin">:exit</span> nil)
    (<span class="org-string">"o"</span> langtool-show-message-at-point <span class="org-builtin">:exit</span> nil)

    (<span class="org-string">"q"</span> nil))
  (key-chord-define-global <span class="org-string">"qk"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/hydra/both/langtool/body</span>))
</pre>
</div>

<p>
Integrate Proselint. I wanted to load the executable location from
<code>PROSELINT_HOME</code> but I haven&rsquo;t figured out how yet. <code>flycheck-define-checker</code> is a
macro but I don&rsquo;t know how to expand the string for use in the macro. I tried
quasiquote and that was wrong.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org53fe879">(<span class="org-keyword">with-eval-after-load</span> <span class="org-string">"flycheck"</span>
  (<span class="org-keyword">flycheck-define-checker</span> proselint
    <span class="org-doc">"A linter for prose."</span>
    <span class="org-builtin">:command</span> (<span class="org-string">"/Users/gcr/proselint/env/bin/proselint"</span> source-inplace)
    <span class="org-builtin">:error-patterns</span>
    ((warning line-start (file-name) <span class="org-string">":"</span> line <span class="org-string">":"</span> column <span class="org-string">": "</span>
              (id (one-or-more (not (any <span class="org-string">" "</span>))))
              (message (one-or-more not-newline)
                       (zero-or-more <span class="org-string">"\n"</span> (any <span class="org-string">" "</span>) (one-or-more not-newline)))
              line-end))
    <span class="org-builtin">:modes</span> (text-mode org-mode markdown-mode gfm-mode))
  (add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">flycheck-checkers</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">proselint</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-org06f5d76" class="outline-3">
<h3 id="org06f5d76"><span class="section-number-3">3.18</span> Keyboard Macros</h3>
<div class="outline-text-3" id="text-3-18">
<pre class="example">
ID: org_gcr_2017-05-12_mara:F2701D64-8484-4EB0-9FBD-692C98CA3C58
</pre>

<p>
Keep many keyboard macros.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgb311ea5">(<span class="org-keyword">setq</span> kmacro-ring-max 32)
</pre>
</div>

<p>
Persist keyboard macros in Emacs Lisp alternative to <code>insert-kbd-macro</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org2688bd2">(<span class="org-keyword">use-package</span> <span class="org-constant">elmacro</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:diminish</span> (elmacro-mode)
  <span class="org-builtin">:config</span>
  (elmacro-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org6017e34" class="outline-3">
<h3 id="org6017e34"><span class="section-number-3">3.19</span> Intellisense</h3>
<div class="outline-text-3" id="text-3-19">
<pre class="example">
ID: org_gcr_2017-05-12_mara:DE05FF62-53EA-491A-881B-650030210591
</pre>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org52f14a1">(<span class="org-keyword">use-package</span> <span class="org-constant">fuzzy</span>
  <span class="org-builtin">:ensure</span> t)
(<span class="org-keyword">use-package</span> <span class="org-constant">auto-complete</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">use-package</span> <span class="org-constant">auto-complete-config</span>)
  (<span class="org-keyword">setq</span> ac-quick-help-prefer-pos-tip nil)
  (ac-config-default)
  (<span class="org-keyword">setq</span> ac-auto-start nil)
  (<span class="org-keyword">help/not-on-gui</span> (ac-set-trigger-key <span class="org-string">"TAB"</span>))
  (<span class="org-keyword">help/on-gui</span> (ac-set-trigger-key <span class="org-string">"&lt;tab&gt;"</span>))
  <span class="org-builtin">:diminish</span> auto-complete-mode)
(<span class="org-keyword">use-package</span> <span class="org-constant">auto-complete-chunk</span>
  <span class="org-builtin">:ensure</span> t)
</pre>
</div>

<p>
Auto-completion for <code>.</code>-separated words.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org6b28a71">(<span class="org-keyword">use-package</span> <span class="org-constant">auto-complete-chunk</span>
  <span class="org-builtin">:ensure</span> t)
</pre>
</div>

<p>
<i>IntelliJ-Like</i> <code>jump to definition</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org8002eeb">(<span class="org-keyword">use-package</span> <span class="org-constant">dumb-jump</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">defhydra</span> help/hydra-left-side/dumb-jump (<span class="org-builtin">:color</span> <span class="custom"><span class="custom-1">blue</span></span> <span class="org-builtin">:hint</span> nil)
    <span class="org-doc">"</span>
<span class="org-doc">Dumb-Jump:</span>
<span class="org-doc"> _j_ go to _k_ return from _i_ choose</span>
<span class="org-doc">  _u_ in other window _o_ peek</span>
<span class="org-doc">  _q_ quit"</span>
    (<span class="org-string">"j"</span> dumb-jump-go)
    (<span class="org-string">"k"</span> dumb-jump-back)
    (<span class="org-string">"i"</span> dumb-jump-go-prompt)
    (<span class="org-string">"u"</span> dumb-jump-go-other-window)
    (<span class="org-string">"o"</span> dumb-jump-quick-look)
    (<span class="org-string">"q"</span> nil))
  (key-chord-define-global <span class="org-string">"jj"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/hydra-left-side/dumb-jump/body</span>))
</pre>
</div>
</div>
</div>
