help.org
** Mark, Kill  and Region
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:432D3FDF-38B3-499D-94D3-338CFEF2957C
   :END:

Easy kill ring access.

#+NAME: org_gcr_2017-05-12_mara_DA93DCF6-E0AB-4B92-9708-4DE4781AA2ED
#+BEGIN_SRC emacs-lisp
(use-package browse-kill-ring
  :ensure t
  :config
  (browse-kill-ring-default-keybindings)
  (setq browse-kill-ring-highlight-current-entry t)
  (setq browse-kill-ring-highlight-inserted-item t)
  (setq browse-kill-ring-show-preview nil)
  (setq browse-kill-ring-separator
        ".-~-.-~-.-~-.-~-.-~-.-~-.-~-.-~-.-~-.-~-.-~-.-~-.-~-.-~-.-~-.-~-.-~-.-~-.-~-
")
  (defun help/browse-kill-ring ()
    "Disable `fci-mode' before entering `browse-kill-ring'."
    (interactive)
    (fci-mode)
    (browse-kill-ring)
    (fci-mode))
  (global-set-key (kbd "M-y") #'help/browse-kill-ring))
#+END_SRC

When you start typing and text is selected, replace it with what you are typing,
or pasting

#+NAME: org_gcr_2017-05-12_mara_B696F088-B5EB-4507-8EBE-C719995EB5DA
#+BEGIN_SRC emacs-lisp
(delete-selection-mode t)
#+END_SRC

Automatically save data copied from the system clipboard into the kill ring
before killing Emacs data.

Via Ben Maughan:

#+BEGIN_QUOTE
;; Save whatever's in the current (system) clipboard before
;; replacing it with the Emacs' text.
;; https://github.com/dakrone/eos/blob/master/eos.org
#+END_QUOTE

#+NAME: org_gcr_2017-05-12_mara_DDBFF500-4387-47FD-95BD-7F6F369AB0E8
#+BEGIN_SRC emacs-lisp
(setq save-interprogram-paste-before-kill t)
#+END_SRC

[[http://pragmaticemacs.com/emacs/automatically-copy-text-selected-with-the-mouse/][Via]]: copy selected text to the clip board.

#+NAME: org_gcr_2017-05-12_mara_087C8A85-9AC0-48C5-A19B-6C5E97F40572
#+BEGIN_SRC emacs-lisp
(setq mouse-drag-copy-region t)
#+END_SRC

** Minibuffer
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:FABF1013-0F88-4207-AB8E-982E7F4C250D
   :END:

Make it easier to answer questions.
#+NAME: org_gcr_2017-05-12_mara_F19234A5-0F40-46FE-946A-4B3F47C96424
#+BEGIN_SRC emacs-lisp
(fset #'yes-or-no-p #'y-or-n-p)
#+END_SRC

Comfortably display information.
#+NAME: org_gcr_2017-05-12_mara_2B089323-1D60-416F-83A7-792AEE290E67
#+BEGIN_SRC emacs-lisp
(setq resize-mini-windows t)
(setq max-mini-window-height 0.33)
#+END_SRC

Allow recursive commands-in-commands and highlight the levels of recursion.
#+NAME: org_gcr_2017-05-12_mara_A0D0BC89-5180-4B18-BFDC-17650901FB7F
#+BEGIN_SRC emacs-lisp
(setq enable-recursive-minibuffers t)
(minibuffer-depth-indicate-mode t)
#+END_SRC

Temporarily give it unlimited memory to speed it up.

#+NAME: org_gcr_2017-07-29_mara_59F9B6F3-A62C-424A-AC57-D2677788FF1A
#+BEGIN_SRC emacs-lisp
(add-hook 'minibuffer-setup-hook #'help/double-gc-cons-threshold)
(add-hook 'minibuffer-exit-hook #'help/set-gc-cons-threshold)
#+END_SRC
** Mouse
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:6171A841-DFD0-44A7-AAA6-BB099B1922FE
   :END:

Scroll pleasantly with the mouse wheel. A slow turn moves the buffer up and down
one line at a time. So does a fast turn. Anything further than 5-10 lines deserves
a fast navigation vehicle.

#+NAME: org_gcr_2017-05-12_mara_4AA275B8-8C5E-498F-969E-28459D7E88E5
#+BEGIN_SRC emacs-lisp
(setq mouse-wheel-scroll-amount '(1 ((shift) . 1)))
(setq mouse-wheel-progressive-speed nil)
(setq mouse-wheel-follow-mouse t)
#+END_SRC

** Occur
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:54249478-0107-4838-8394-4A6A1850ED99
   :END:

- Alternate search result background color
- Multiple Occur buffers
- ~n~ and ~p~ navigate search results
- Jump near buffer top

#+NAME: org_gcr_2017-05-12_mara_0EB7874B-7C34-4879-97FA-C487115385EE
#+BEGIN_SRC emacs-lisp
(defun help/occur-mode-hook-fn ()
  "HELP customizations."
  (interactive)
  (turn-on-stripe-buffer-mode)
  (occur-rename-buffer))
(add-hook 'occur-mode-hook #'help/occur-mode-hook-fn)
(define-key occur-mode-map (kbd "n") #'next-logical-line)
(define-key occur-mode-map (kbd "p") #'previous-logical-line)
(add-hook 'occur-mode-find-occurrence-hook #'help/recenter-line-near-top-fn)
#+END_SRC

** Popups
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:5EFCDB34-DC9E-4502-93AD-8E31363F8A5C
   :END:

Provide popup notifications.

#+NAME: org_gcr_2017-05-12_mara_66255B58-A96D-445E-83BF-F597E4BA4FB8
#+BEGIN_SRC emacs-lisp
(use-package alert
  :ensure t
  :config
  (setq alert-fade-time 10)
  (setq alert-default-style 'message)
  (help/on-gui
   (help/on-osx
    (setq alert-default-style 'notifier)))
  (setq alert-reveal-idle-time 120))
#+END_SRC

