help.html

<div id="outline-container-org6e799a7" class="outline-3">
<h3 id="org6e799a7"><span class="section-number-3">3.20</span> Mark, Kill  and Region</h3>
<div class="outline-text-3" id="text-3-20">
<pre class="example">
ID: org_gcr_2017-05-12_mara:432D3FDF-38B3-499D-94D3-338CFEF2957C
</pre>

<p>
Easy kill ring access.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org9f99067">(<span class="org-keyword">use-package</span> <span class="org-constant">browse-kill-ring</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (browse-kill-ring-default-keybindings)
  (<span class="org-keyword">setq</span> browse-kill-ring-highlight-current-entry t)
  (<span class="org-keyword">setq</span> browse-kill-ring-highlight-inserted-item t)
  (<span class="org-keyword">setq</span> browse-kill-ring-show-preview nil)
  (<span class="org-keyword">setq</span> browse-kill-ring-separator
        <span class="org-string">".-~-.-~-.-~-.-~-.-~-.-~-.-~-.-~-.-~-.-~-.-~-.-~-.-~-.-~-.-~-.-~-.-~-.-~-.-~-</span>
<span class="org-string">"</span>)
  (<span class="org-keyword">defun</span> <span class="org-function-name">help/browse-kill-ring</span> ()
    <span class="org-doc">"Disable `</span><span class="org-doc"><span class="org-constant">fci-mode</span></span><span class="org-doc">' before entering `</span><span class="org-doc"><span class="org-constant">browse-kill-ring</span></span><span class="org-doc">'."</span>
    (<span class="org-keyword">interactive</span>)
    (fci-mode)
    (browse-kill-ring)
    (fci-mode))
  (global-set-key (kbd <span class="org-string">"M-y"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/browse-kill-ring</span>))
</pre>
</div>

<p>
When you start typing and text is selected, replace it with what you are typing,
or pasting
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org78cf736">(delete-selection-mode t)
</pre>
</div>

<p>
Automatically save data copied from the system clipboard into the kill ring
before killing Emacs data.
</p>

<p>
Via Ben Maughan:
</p>

<blockquote>
<p>
;; Save whatever&rsquo;s in the current (system) clipboard before
;; replacing it with the Emacs&rsquo; text.
;; <a href="https://github.com/dakrone/eos/blob/master/eos.org">https://github.com/dakrone/eos/blob/master/eos.org</a>
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org6eac685">(<span class="org-keyword">setq</span> save-interprogram-paste-before-kill t)
</pre>
</div>

<p>
<a href="http://pragmaticemacs.com/emacs/automatically-copy-text-selected-with-the-mouse/">Via</a>: copy selected text to the clip board.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgda2bab1">(<span class="org-keyword">setq</span> mouse-drag-copy-region t)
</pre>
</div>
</div>
</div>

<div id="outline-container-org2b59d20" class="outline-3">
<h3 id="org2b59d20"><span class="section-number-3">3.21</span> Minibuffer</h3>
<div class="outline-text-3" id="text-3-21">
<pre class="example">
ID: org_gcr_2017-05-12_mara:FABF1013-0F88-4207-AB8E-982E7F4C250D
</pre>

<p>
Make it easier to answer questions.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgb52c685">(fset <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">yes-or-no-p</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">y-or-n-p</span>)
</pre>
</div>

<p>
Comfortably display information.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgc342cac">(<span class="org-keyword">setq</span> resize-mini-windows t)
(<span class="org-keyword">setq</span> max-mini-window-height 0.33)
</pre>
</div>

<p>
Allow recursive commands-in-commands and highlight the levels of recursion.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org9e64f8e">(<span class="org-keyword">setq</span> enable-recursive-minibuffers t)
(minibuffer-depth-indicate-mode t)
</pre>
</div>

<p>
Temporarily give it unlimited memory to speed it up.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgfe445f2">(add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">minibuffer-setup-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/double-gc-cons-threshold</span>)
(add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">minibuffer-exit-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/set-gc-cons-threshold</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgecb0df6" class="outline-3">
<h3 id="orgecb0df6"><span class="section-number-3">3.22</span> Mouse</h3>
<div class="outline-text-3" id="text-3-22">
<pre class="example">
ID: org_gcr_2017-05-12_mara:6171A841-DFD0-44A7-AAA6-BB099B1922FE
</pre>

<p>
Scroll pleasantly with the mouse wheel. A slow turn moves the buffer up and down
one line at a time. So does a fast turn. Anything further than 5-10 lines deserves
a fast navigation vehicle.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org0bbb090">(<span class="org-keyword">setq</span> mouse-wheel-scroll-amount <span class="org-highlight-quoted-quote">'</span>(1 ((shift) . 1)))
(<span class="org-keyword">setq</span> mouse-wheel-progressive-speed nil)
(<span class="org-keyword">setq</span> mouse-wheel-follow-mouse t)
</pre>
</div>
</div>
</div>

<div id="outline-container-org24e96d6" class="outline-3">
<h3 id="org24e96d6"><span class="section-number-3">3.23</span> Occur</h3>
<div class="outline-text-3" id="text-3-23">
<pre class="example">
ID: org_gcr_2017-05-12_mara:54249478-0107-4838-8394-4A6A1850ED99
</pre>

<ul class="org-ul">
<li>Alternate search result background color</li>
<li>Multiple Occur buffers</li>
<li><code>n</code> and <code>p</code> navigate search results</li>
<li>Jump near buffer top</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgff1935e">(<span class="org-keyword">defun</span> <span class="org-function-name">help/occur-mode-hook-fn</span> ()
  <span class="org-doc">"HELP customizations."</span>
  (<span class="org-keyword">interactive</span>)
  (turn-on-stripe-buffer-mode)
  (occur-rename-buffer))
(add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">occur-mode-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/occur-mode-hook-fn</span>)
(define-key occur-mode-map (kbd <span class="org-string">"n"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">next-logical-line</span>)
(define-key occur-mode-map (kbd <span class="org-string">"p"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">previous-logical-line</span>)
(add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">occur-mode-find-occurrence-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/recenter-line-near-top-fn</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org6b765f2" class="outline-3">
<h3 id="org6b765f2"><span class="section-number-3">3.24</span> Popups</h3>
<div class="outline-text-3" id="text-3-24">
<pre class="example">
ID: org_gcr_2017-05-12_mara:5EFCDB34-DC9E-4502-93AD-8E31363F8A5C
</pre>

<p>
Provide popup notifications.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org3e4b8ac">(<span class="org-keyword">use-package</span> <span class="org-constant">alert</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">setq</span> alert-fade-time 10)
  (<span class="org-keyword">setq</span> alert-default-style <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">message</span>)
  (<span class="org-keyword">help/on-gui</span>
   (<span class="org-keyword">help/on-osx</span>
    (<span class="org-keyword">setq</span> alert-default-style <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">notifier</span>)))
  (<span class="org-keyword">setq</span> alert-reveal-idle-time 120))
</pre>
</div>
</div>
</div>
