help.org
** Projects
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:BEFE841E-58A8-43D6-84F0-5BA2EBCFE6B8
   :END:

Directories that have Git working copies are logically projects. Manage them
with Projectile.

#+NAME: org_gcr_2017-05-12_mara_814E8B43-89FD-4EC2-9C5A-EEE03D92A918
#+BEGIN_SRC emacs-lisp
(use-package projectile
  :ensure t
  :config
  (projectile-global-mode t)
  (global-set-key (kbd "s-c") #'projectile-find-file)
  (help/on-windows
   (setq projectile-indexing-method 'alien))
  :diminish projectile-mode)
#+END_SRC

Notify Magit about every working copy that Projectile knows about.

#+NAME: org_gcr_2017-05-12_mara_A3BF1E41-D15E-43FD-A379-E5283602BBB3
#+BEGIN_SRC emacs-lisp
(eval-after-load "projectile"
  '(progn (setq magit-repository-directories (mapcar (lambda (dir)
                                                       (substring dir 0 -1))
                                                     (remove-if-not (lambda (project)
                                                                      (file-directory-p (concat project "/.git/")))
                                                                    (projectile-relevant-known-projects)))

                magit-repository-directories-depth 1)))
#+END_SRC

** Printing
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:93730D86-E142-49E7-9325-0A48D23A8BE5
   :END:

#+NAME: org_gcr_2017-05-12_mara_22C5C379-532B-488C-A155-6212DB791ED6
#+BEGIN_SRC emacs-lisp
(use-package pp
  :commands (pp-display-expression))
#+END_SRC

** Register
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:132C5084-FD72-45C5-BD32-DCE78A00ED34
   :END:

#+NAME: org_gcr_2017-05-12_mara_5418551F-1788-4236-B98B-B963BE0032F7
#+BEGIN_SRC emacs-lisp
(setq register-preview-delay 2)
(setq register-separator "\n\n")
#+END_SRC

** Replacing
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:8DDCD1EC-C603-41D8-85A4-EA7C11C86207
   :END:

Display information about search-and-or-replace operation.

#+NAME: org_gcr_2017-05-12_mara_82232186-B19E-402C-B9E7-6FD6839FD7F6
#+BEGIN_SRC emacs-lisp
(use-package anzu
  :ensure t
  :config
  (global-anzu-mode t)
  (setq anzu-mode-lighter "")
  (setq anzu-deactivate-region t)
  (setq anzu-search-threshold 1000)
  (setq anzu-replace-to-string-separator " ⇒ "))
#+END_SRC

** Save and Restore Operating State
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:217B8635-CA69-4F58-A12D-124ED384EE22
   :END:

*** Mark
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:2CBAFE00-5B18-4798-AEF3-488D622374BE
:END:

When you re-open a file return the mark to its last position

https://www.emacswiki.org/emacs/SavePlace

#+NAME: org_gcr_2017-05-12_mara_9D56BD82-FDED-4326-9078-547457D593ED
#+BEGIN_SRC emacs-lisp
(save-place-mode 1)
#+END_SRC

*** Minibuffer
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:88B140F9-567E-47DA-8137-42EF4CE0904E
:END:

It is nice to have commands and their history saved so that every time you get
back to work, you can just re-run stuff as you need it.

https://www.emacswiki.org/emacs/SaveHist

#+NAME: org_gcr_2017-05-12_mara_2C0AC56F-8956-4EC1-90A9-2FBCC4AA5AD1
#+BEGIN_SRC emacs-lisp
(setq savehist-save-minibuffer-history t)
(setq savehist-additional-variables
      '(kill-ring
        search-ring
        regexp-search-ring
        last-kbd-macro
        kmacro-ring
        shell-command-history))
(savehist-mode t)
#+END_SRC

Use the history as a lookup instead of a log.

#+NAME: org_gcr_2017-05-12_mara_D92CB94A-5CDE-49D3-83AD-65242EACA752
#+BEGIN_SRC emacs-lisp
(setq history-delete-duplicates t)
#+END_SRC

** Searching
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:AA7F12B0-13E2-4B5A-A8BB-B42E1FCC6E55
   :END:

