help.html

<div id="outline-container-orgd7c4113" class="outline-3">
<h3 id="orgd7c4113"><span class="section-number-3">3.25</span> Projects</h3>
<div class="outline-text-3" id="text-3-25">
<pre class="example">
ID: org_gcr_2017-05-12_mara:BEFE841E-58A8-43D6-84F0-5BA2EBCFE6B8
</pre>

<p>
Directories that have Git working copies are logically projects. Manage them
with Projectile.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org470bb63">(<span class="org-keyword">use-package</span> <span class="org-constant">projectile</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (projectile-global-mode t)
  (global-set-key (kbd <span class="org-string">"s-c"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">projectile-find-file</span>)
  (<span class="org-keyword">help/on-windows</span>
   (<span class="org-keyword">setq</span> projectile-indexing-method <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">alien</span>))
  <span class="org-builtin">:diminish</span> projectile-mode)
</pre>
</div>

<p>
Notify Magit about every working copy that Projectile knows about.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org2087c01">(eval-after-load <span class="org-string">"projectile"</span>
  <span class="org-highlight-quoted-quote">'</span>(<span class="org-keyword">progn</span> (<span class="org-keyword">setq</span> magit-repository-directories (mapcar (<span class="org-keyword">lambda</span> (dir)
                                                       (substring dir 0 -1))
                                                     (remove-if-not (<span class="org-keyword">lambda</span> (project)
                                                                      (file-directory-p (concat project <span class="org-string">"/.git/"</span>)))
                                                                    (projectile-relevant-known-projects)))

                magit-repository-directories-depth 1)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org33b88e2" class="outline-3">
<h3 id="org33b88e2"><span class="section-number-3">3.26</span> Printing</h3>
<div class="outline-text-3" id="text-3-26">
<pre class="example">
ID: org_gcr_2017-05-12_mara:93730D86-E142-49E7-9325-0A48D23A8BE5
</pre>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org3e371ed">(<span class="org-keyword">use-package</span> <span class="org-constant">pp</span>
  <span class="org-builtin">:commands</span> (pp-display-expression))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd5f4df6" class="outline-3">
<h3 id="orgd5f4df6"><span class="section-number-3">3.27</span> Register</h3>
<div class="outline-text-3" id="text-3-27">
<pre class="example">
ID: org_gcr_2017-05-12_mara:132C5084-FD72-45C5-BD32-DCE78A00ED34
</pre>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org47eb0b3">(<span class="org-keyword">setq</span> register-preview-delay 2)
(<span class="org-keyword">setq</span> register-separator <span class="org-string">"\n\n"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orga47227d" class="outline-3">
<h3 id="orga47227d"><span class="section-number-3">3.28</span> Replacing</h3>
<div class="outline-text-3" id="text-3-28">
<pre class="example">
ID: org_gcr_2017-05-12_mara:8DDCD1EC-C603-41D8-85A4-EA7C11C86207
</pre>

<p>
Display information about search-and-or-replace operation.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org86b16da">(<span class="org-keyword">use-package</span> <span class="org-constant">anzu</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (global-anzu-mode t)
  (<span class="org-keyword">setq</span> anzu-mode-lighter <span class="org-string">""</span>)
  (<span class="org-keyword">setq</span> anzu-deactivate-region t)
  (<span class="org-keyword">setq</span> anzu-search-threshold 1000)
  (<span class="org-keyword">setq</span> anzu-replace-to-string-separator <span class="org-string">" &#8658; "</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbc33b3b" class="outline-3">
<h3 id="orgbc33b3b"><span class="section-number-3">3.29</span> Save and Restore Operating State</h3>
<div class="outline-text-3" id="text-3-29">
<pre class="example">
ID: org_gcr_2017-05-12_mara:217B8635-CA69-4F58-A12D-124ED384EE22
</pre>
</div>

<div id="outline-container-org109c747" class="outline-4">
<h4 id="org109c747"><span class="section-number-4">3.29.1</span> Mark</h4>
<div class="outline-text-4" id="text-3-29-1">
<pre class="example">
ID: org_gcr_2017-05-12_mara:2CBAFE00-5B18-4798-AEF3-488D622374BE
</pre>

<p>
When you re-open a file return the mark to its last position
</p>

<p>
<a href="https://www.emacswiki.org/emacs/SavePlace">https://www.emacswiki.org/emacs/SavePlace</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org31224f2">(save-place-mode 1)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfd93b18" class="outline-4">
<h4 id="orgfd93b18"><span class="section-number-4">3.29.2</span> Minibuffer</h4>
<div class="outline-text-4" id="text-3-29-2">
<pre class="example">
ID: org_gcr_2017-05-12_mara:88B140F9-567E-47DA-8137-42EF4CE0904E
</pre>

<p>
It is nice to have commands and their history saved so that every time you get
back to work, you can just re-run stuff as you need it.
</p>

<p>
<a href="https://www.emacswiki.org/emacs/SaveHist">https://www.emacswiki.org/emacs/SaveHist</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org21f19d2">(<span class="org-keyword">setq</span> savehist-save-minibuffer-history t)
(<span class="org-keyword">setq</span> savehist-additional-variables
      <span class="org-highlight-quoted-quote">'</span>(kill-ring
        search-ring
        regexp-search-ring
        last-kbd-macro
        kmacro-ring
        shell-command-history))
(savehist-mode t)
</pre>
</div>

<p>
Use the history as a lookup instead of a log.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orga46e87c">(<span class="org-keyword">setq</span> history-delete-duplicates t)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org6ac79b6" class="outline-3">
<h3 id="org6ac79b6"><span class="section-number-3">3.30</span> Searching</h3>
<div class="outline-text-3" id="text-3-30">
<pre class="example">
ID: org_gcr_2017-05-12_mara:AA7F12B0-13E2-4B5A-A8BB-B42E1FCC6E55
</pre>
</div>
