help.org
*** Internal
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:11DF2712-61B1-4E9F-9950-8BDB0E57E580
:END:

It is *important* to understand how Emacs performs searching.

Copied and pasted Emacs literature from
- src_emacs-lisp{(info "(info) Searching Case")}
- [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Search-Case.html][Searching and Case]]
follows

#+BEGIN_EXAMPLE
Searches in Emacs normally ignore the case of the text they are searching
through, if you specify the text in lower case. Thus, if you specify searching
for 'foo', then 'Foo' and 'foo' also match. Regexps, and in particular
character sets, behave likewise: '[ab]' matches 'a' or 'A' or 'b' or 'B'.

An upper-case letter anywhere in the incremental search string makes the
search case-sensitive. Thus, searching for 'Foo' does not find 'foo' or 'FOO'.
This applies to regular expression search as well as to string search. The
effect ceases if you delete the upper-case letter from the search string.

If you set the variable case-fold-search to nil, then all letters must match
exactly, including case. This is a per-buffer variable; altering the variable
normally affects only the current buffer, unless you change its default value.
See Locals. This variable applies to nonincremental searches also, including
those performed by the replace commands (see Replace) and the minibuffer
history matching commands (see Minibuffer History).

Typing M-c within an incremental search toggles the case sensitivity of that
search. The effect does not extend beyond the current incremental search to
the next one, but it does override the effect of adding or removing an
upper-case letter in the current search.
#+END_EXAMPLE

So let Emacs search how it was built to search instead of attempting to make
it case-sensitive everywhere. Emacs already makes it easy to perform
case-sensitive searches when you want. It is simple and predictable.

When you don't want to do that interactively type M-c in the search input area
to toggle case sensitivity.

When you don't want to do that non-interactively then search for that command
or activities toggling variable ~M-x apropos-variable RET case-fold-search RET~
and bind it during the search.

Make ~isearch~ automatically search for Unicode homoglyphs of the search
characters.

#+NAME: org_gcr_2017-08-01_mara_98164910-DD0A-4AAE-A9B2-FAF864BCCE1C
#+BEGIN_SRC emacs-lisp
(setq search-default-mode #'char-fold-to-regexp)
#+END_SRC

Ditto for replace.

#+NAME: org_gcr_2017-08-01_mara_1FA6AB2F-B0A9-491E-89D3-BFDFBD173EDD
#+BEGIN_SRC emacs-lisp
(setq replace-char-fold t)
#+END_SRC

*** External
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:D55FB85E-A70E-4A56-AA5F-089B4FE52E7F
:END:

Writeable Grep integration.

#+NAME: org_gcr_2017-05-12_mara_9F40A141-4464-4D4C-A062-54BEC12992FF
#+BEGIN_SRC emacs-lisp
(use-package wgrep
  :ensure t
  :config
  (setq wgrep-auto-save-buffer t))
#+END_SRC

Ag integration.

#+NAME: org_gcr_2017-05-12_mara_58F6AD1E-7E9B-4650-B859-F9C0540C74B6
#+BEGIN_SRC emacs-lisp
(use-package ag
  :ensure t
  :config
  (setq ag-highlight-search t)
  (setq ag-reuse-window nil)
  (setq ag-reuse-buffers nil)
  (setq ag-arguments (-insert-at (- (length ag-arguments) 1) '"--ignore-case"
                                 ag-arguments))
  (defun help/ag-mode-hook-fn ()
    "HELP ag customizations."
    (interactive)
    (turn-on-stripe-buffer-mode))
  (defun help/ag-mode-finished-hook-fn ()
    "HELP ag finished hook function."
    (interactive)
    (let ((compilation-scroll-output 'first-error))
      (pop-to-buffer next-error-last-buffer)))
  (add-hook 'ag-mode-hook #'help/ag-mode-hook-fn)
  (add-hook 'ag-search-finished-hook #'help/ag-mode-finished-hook-fn)
  (defhydra help/hydra/ag (:color blue
                                  :hint nil)
    "
`ag', The Silver Searcher:
  Present in window:
    Search in folder:
      _j_ limit search by file type _k_ search in everything
    Search in project:
      _l_ limit search by file type _;_ search in everything
  Present in dired:
    Search in folder:
      _u_ limit search by file type _i_ search in everything
    Search in project:
      _o_ limit search by file type _p_ search in everything
  Other:
    _n_ close every other buffer _m_ close every buffer _q_ quit
"
    ("u" ag-dired-regexp)
    ("i" ag-dired)
    ("o" ag-project-dired-regexp)
    ("p" ag-project-dired)
    ("j" ag-files)
    ("k" ag)
    ("l" ag-project-files)
    (";" ag-project)
    ("n" ag-kill-other-buffers)
    ("m" ag-kill-buffers)
    ("q" nil)))
#+END_SRC

Writeable Ag.

#+NAME: org_gcr_2017-05-12_mara_E4E1E1A0-1353-4483-BE1C-746097F60CB6
#+BEGIN_SRC emacs-lisp
(use-package wgrep-ag
  :ensure t
  :after ag)
#+END_SRC

** Spell Checking
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:44909368-2D9A-40B9-A3F4-DF297A0EE570
   :END:

Ispell is simple and powerful.

