help.html

<div id="outline-container-org148352a" class="outline-4">
<h4 id="org148352a"><span class="section-number-4">3.30.1</span> Internal</h4>
<div class="outline-text-4" id="text-3-30-1">
<pre class="example">
ID: org_gcr_2017-05-12_mara:11DF2712-61B1-4E9F-9950-8BDB0E57E580
</pre>

<p>
It is <b>important</b> to understand how Emacs performs searching.
</p>

<p>
Copied and pasted Emacs literature from
</p>
<ul class="org-ul">
<li><code class="src src-emacs-lisp">(info <span class="org-string">"(info) Searching Case"</span>)</code></li>
<li><a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Search-Case.html">Searching and Case</a></li>
</ul>
<p>
follows
</p>

<pre class="example">
Searches in Emacs normally ignore the case of the text they are searching
through, if you specify the text in lower case. Thus, if you specify searching
for 'foo', then 'Foo' and 'foo' also match. Regexps, and in particular
character sets, behave likewise: '[ab]' matches 'a' or 'A' or 'b' or 'B'.

An upper-case letter anywhere in the incremental search string makes the
search case-sensitive. Thus, searching for 'Foo' does not find 'foo' or 'FOO'.
This applies to regular expression search as well as to string search. The
effect ceases if you delete the upper-case letter from the search string.

If you set the variable case-fold-search to nil, then all letters must match
exactly, including case. This is a per-buffer variable; altering the variable
normally affects only the current buffer, unless you change its default value.
See Locals. This variable applies to nonincremental searches also, including
those performed by the replace commands (see Replace) and the minibuffer
history matching commands (see Minibuffer History).

Typing M-c within an incremental search toggles the case sensitivity of that
search. The effect does not extend beyond the current incremental search to
the next one, but it does override the effect of adding or removing an
upper-case letter in the current search.
</pre>

<p>
So let Emacs search how it was built to search instead of attempting to make
it case-sensitive everywhere. Emacs already makes it easy to perform
case-sensitive searches when you want. It is simple and predictable.
</p>

<p>
When you don&rsquo;t want to do that interactively type M-c in the search input area
to toggle case sensitivity.
</p>

<p>
When you don&rsquo;t want to do that non-interactively then search for that command
or activities toggling variable <code>M-x apropos-variable RET case-fold-search RET</code>
and bind it during the search.
</p>

<p>
Make <code>isearch</code> automatically search for Unicode homoglyphs of the search
characters.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgf79f954">(<span class="org-keyword">setq</span> search-default-mode <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">char-fold-to-regexp</span>)
</pre>
</div>

<p>
Ditto for replace.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org6cd0b64">(<span class="org-keyword">setq</span> replace-char-fold t)
</pre>
</div>
</div>
</div>

<div id="outline-container-org8fb75df" class="outline-4">
<h4 id="org8fb75df"><span class="section-number-4">3.30.2</span> External</h4>
<div class="outline-text-4" id="text-3-30-2">
<pre class="example">
ID: org_gcr_2017-05-12_mara:D55FB85E-A70E-4A56-AA5F-089B4FE52E7F
</pre>

<p>
Writeable Grep integration.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgb68f26e">(<span class="org-keyword">use-package</span> <span class="org-constant">wgrep</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">setq</span> wgrep-auto-save-buffer t))
</pre>
</div>

<p>
Ag integration.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org038e62f">(<span class="org-keyword">use-package</span> <span class="org-constant">ag</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">setq</span> ag-highlight-search t)
  (<span class="org-keyword">setq</span> ag-reuse-window nil)
  (<span class="org-keyword">setq</span> ag-reuse-buffers nil)
  (<span class="org-keyword">setq</span> ag-arguments (<span class="org-keyword">-insert-at</span> (- (length ag-arguments) 1) <span class="org-highlight-quoted-quote">'</span><span class="org-string">"--ignore-case"</span>
                                 ag-arguments))
  (<span class="org-keyword">defun</span> <span class="org-function-name">help/ag-mode-hook-fn</span> ()
    <span class="org-doc">"HELP ag customizations."</span>
    (<span class="org-keyword">interactive</span>)
    (turn-on-stripe-buffer-mode))
  (<span class="org-keyword">defun</span> <span class="org-function-name">help/ag-mode-finished-hook-fn</span> ()
    <span class="org-doc">"HELP ag finished hook function."</span>
    (<span class="org-keyword">interactive</span>)
    (<span class="org-keyword">let</span> ((compilation-scroll-output <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">first-error</span>))
      (pop-to-buffer next-error-last-buffer)))
  (add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">ag-mode-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/ag-mode-hook-fn</span>)
  (add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">ag-search-finished-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/ag-mode-finished-hook-fn</span>)
  (<span class="org-keyword">defhydra</span> help/hydra/ag (<span class="org-builtin">:color</span> <span class="custom"><span class="custom-1">blue</span></span>
                                  <span class="org-builtin">:hint</span> nil)
    <span class="org-doc">"</span>
<span class="org-doc">`</span><span class="org-doc"><span class="org-constant">ag</span></span><span class="org-doc">', The Silver Searcher:</span>
<span class="org-doc">  Present in window:</span>
<span class="org-doc">    Search in folder:</span>
<span class="org-doc">      _j_ limit search by file type _k_ search in everything</span>
<span class="org-doc">    Search in project:</span>
<span class="org-doc">      _l_ limit search by file type _;_ search in everything</span>
<span class="org-doc">  Present in dired:</span>
<span class="org-doc">    Search in folder:</span>
<span class="org-doc">      _u_ limit search by file type _i_ search in everything</span>
<span class="org-doc">    Search in project:</span>
<span class="org-doc">      _o_ limit search by file type _p_ search in everything</span>
<span class="org-doc">  Other:</span>
<span class="org-doc">    _n_ close every other buffer _m_ close every buffer _q_ quit</span>
<span class="org-doc">"</span>
    (<span class="org-string">"u"</span> ag-dired-regexp)
    (<span class="org-string">"i"</span> ag-dired)
    (<span class="org-string">"o"</span> ag-project-dired-regexp)
    (<span class="org-string">"p"</span> ag-project-dired)
    (<span class="org-string">"j"</span> ag-files)
    (<span class="org-string">"k"</span> ag)
    (<span class="org-string">"l"</span> ag-project-files)
    (<span class="org-string">";"</span> ag-project)
    (<span class="org-string">"n"</span> ag-kill-other-buffers)
    (<span class="org-string">"m"</span> ag-kill-buffers)
    (<span class="org-string">"q"</span> nil))
  (global-set-key (kbd <span class="org-string">"C-s-s"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/hydra/ag/body</span>))
</pre>
</div>

<p>
Writeable Ag.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org3482672">(<span class="org-keyword">use-package</span> <span class="org-constant">wgrep-ag</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:after</span> ag)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org89a27f5" class="outline-3">
<h3 id="org89a27f5"><span class="section-number-3">3.31</span> Spell Checking</h3>
<div class="outline-text-3" id="text-3-31">
<pre class="example">
ID: org_gcr_2017-05-12_mara:44909368-2D9A-40B9-A3F4-DF297A0EE570
</pre>

<p>
Ispell is simple and powerful.
</p>
</div>
