help.org
*** Org-Mode
    :PROPERTIES:
    :ID:       org_gcr_2017-05-12_mara:4892BEB5-C0B5-4506-BBB3-40E41F9E25FF
    :END:

Never ispell the following objects.

Block regex helper.

#+NAME: org_gcr_2017-05-12_mara_5EDEEFA9-7DED-41D9-AD9D-5C48BA580AC5
#+BEGIN_SRC emacs-lisp
(defun help/block-regex (special)
  "Make an ispell skip-region alist for a SPECIAL block."
  (interactive)
  `(,(concat help/org-special-pre "BEGIN_" special)
    .
    ,(concat help/org-special-pre "END_" special)))
#+END_SRC

Source-Blocks.

#+NAME: org_gcr_2017-05-12_mara_D15F7E3E-9D35-4AB3-A043-67154E3D588A
#+BEGIN_SRC emacs-lisp
(add-to-list 'ispell-skip-region-alist (help/block-regex "SRC"))
#+END_SRC

Example-Blocks. This system often uses Source-Blocks to edit content and
Example-Blocks to make it easily renderable when it is not for running.

#+NAME: org_gcr_2017-05-12_mara_EB14B834-8486-4750-96C5-E5E3CFB4C19B
#+BEGIN_SRC emacs-lisp
(add-to-list 'ispell-skip-region-alist (help/block-regex "EXAMPLE"))
#+END_SRC

Properties.

#+NAME: org_gcr_2017-05-12_mara_F7E77F03-5A3E-4DC1-A345-4BE8E4C7FF11
#+BEGIN_SRC emacs-lisp
(add-to-list 'ispell-skip-region-alist '("^\s*:PROPERTIES\:$" . "^\s*:END\:$"))
#+END_SRC

Footnotes.

#+NAME: org_gcr_2017-05-12_mara_5459C549-E938-4899-827D-D03707983E52
#+BEGIN_SRC emacs-lisp
(add-to-list 'ispell-skip-region-alist '("\\[fn:.+:" . "\\]"))
#+END_SRC

Footnotes with URLs that contain line-breaks.

#+NAME: org_gcr_2017-05-12_mara_ECD4198B-7335-4141-8256-971748EE4D22
#+BEGIN_SRC emacs-lisp
(add-to-list 'ispell-skip-region-alist '("^http" . "\\]"))
#+END_SRC

Bold text list items.

#+NAME: org_gcr_2017-05-12_mara_1048E593-5E66-4F70-A591-B17A18634D8F
#+BEGIN_SRC emacs-lisp
(add-to-list 'ispell-skip-region-alist '("- \\*.+" . ".*\\*: "))
#+END_SRC

Right arrows.

#+NAME: org_gcr_2017-05-12_mara_5DB6D56D-1C05-4816-8BB6-8F3E936E5EFC
#+BEGIN_SRC emacs-lisp
(add-to-list 'ispell-skip-region-alist '("\\rarr"))
#+END_SRC

Check =SPECIAL LINE= definitions, ignoring their type.

#+NAME: org_gcr_2017-05-12_mara_5C415ECB-91FC-44C2-9886-29704EF74836
#+BEGIN_SRC emacs-lisp
(let ()
  (--each
      '(("ATTR_LATEX" nil)
        ("AUTHOR" nil)
        ("BLOG" nil)
        ("CREATOR" nil)
        ("DATE" nil)
        ("DESCRIPTION" nil)
        ("EMAIL" nil)
        ("EXCLUDE_TAGS" nil)
        ("HTML_CONTAINER" nil)
        ("HTML_DOCTYPE" nil)
        ("HTML_HEAD" nil)
        ("HTML_HEAD_EXTRA" nil)
        ("HTML_LINK_HOME" nil)
        ("HTML_LINK_UP" nil)
        ("HTML_MATHJAX" nil)
        ("INFOJS_OPT" nil)
        ("KEYWORDS" nil)
        ("LANGUAGE" nil)
        ("LATEX_CLASS" nil)
        ("LATEX_CLASS_OPTIONS" nil)
        ("LATEX_HEADER" nil)
        ("LATEX_HEADER_EXTRA" nil)
        ("NAME" t)
        ("OPTIONS" t)
        ("POSTID" nil)
        ("RESULTS" t)
        ("SELECT_TAGS" nil)
        ("STARTUP" nil)
        ("TITLE" nil))
    (add-to-list
     'ispell-skip-region-alist
     (let ((special (concat "#[+]" (car it) ":")))
       (if (cadr it)
           (cons special "$")
         (list special))))))
#+END_SRC

** Sudo
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:7853E266-9462-4CEB-A6AB-873EAC06666F
   :END:

Configure Sudo with Ido.

#+NAME: org_gcr_2017-05-12_mara_BC64FFC2-D587-4D4F-B693-71B3731A71F1
#+BEGIN_SRC emacs-lisp
(help/on-osx
 (defun help/ido-find-file ()
   "Find file as root if necessary.

Attribution: URL `http://emacsredux.com/blog/2013/04/21/edit-files-as-root/'"
   (unless (and buffer-file-name
              (file-writable-p buffer-file-name))
     (find-alternate-file (concat "/sudo:root@localhost:" buffer-file-name))))

 (advice-add #'ido-find-file :after #'help/ido-find-file))
#+END_SRC

** Syntax Checking
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:DD506D5A-5F57-4939-B446-536437FDDC97
   :END:

Do not perform syntactic analysis on-demand. Something about my config makes
global-mode puke and kill Emacs every so often.

#+NAME: org_gcr_2017-05-12_mara_9931B79E-7900-4DE1-B097-45A8DE90CB44
#+BEGIN_SRC emacs-lisp
(use-package flycheck
  :ensure t
  :diminish flycheck-mode)
#+END_SRC

** TAB
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:C9ACAB8C-1D19-4CC2-ABE9-ACEBCDBCA9E6
   :END:

Most modes in this system will never use TAB stops.

#+NAME: org_gcr_2017-05-12_mara_C23EBD24-B2DC-40CB-9F9E-CAEB03FF8EDC
#+BEGIN_SRC emacs-lisp
(setq-default indent-tabs-mode nil)
#+END_SRC

Remove TAB from all buffers before persisting to the backing file unless it is
configured to retain TAB. The use case is a Makefile.

#+NAME: org_gcr_2017-05-12_mara_3FFCD7B4-0055-4BE8-938F-EEA09D077343
#+BEGIN_SRC emacs-lisp
(defun help/untabify-if-not-indent-tabs-mode ()
  "Untabify if `indent-tabs-mode' is false.

Attribution: URL `http://www.emacswiki.org/emacs/UntabifyUponSave'"
  (interactive)
  (when (not indent-tabs-mode)
    (untabify (point-min) (point-max))))

(add-hook 'before-save-hook #'help/untabify-if-not-indent-tabs-mode)
#+END_SRC

Most programing modes indent to 2 spaces. TABs should be the same width.

#+NAME: org_gcr_2017-05-12_mara_5A73C4A8-C2AE-4F36-9D64-3FB6A4FF31E0
#+BEGIN_SRC emacs-lisp
(setq-default tab-width 2)
#+END_SRC

