help.html

<div id="outline-container-org7f86051" class="outline-4">
<h4 id="org7f86051"><span class="section-number-4">3.31.1</span> Org-Mode</h4>
<div class="outline-text-4" id="text-3-31-1">
<pre class="example">
ID: org_gcr_2017-05-12_mara:4892BEB5-C0B5-4506-BBB3-40E41F9E25FF
</pre>

<p>
Never ispell the following objects.
</p>

<p>
Block regex helper.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org1c0864d">(<span class="org-keyword">defun</span> <span class="org-function-name">help/block-regex</span> (special)
  <span class="org-doc">"Make an ispell skip-region alist for a SPECIAL block."</span>
  (<span class="org-keyword">interactive</span>)
  <span class="org-highlight-quoted-quote">`</span>(,(concat help/org-special-pre <span class="org-string">"BEGIN_"</span> special)
    .
    ,(concat help/org-special-pre <span class="org-string">"END_"</span> special)))
</pre>
</div>

<p>
Source-Blocks.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgecf696a">(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">ispell-skip-region-alist</span> (help/block-regex <span class="org-string">"SRC"</span>))
</pre>
</div>

<p>
Example-Blocks. This system often uses Source-Blocks to edit content and
Example-Blocks to make it easily renderable when it is not for running.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgd5a3560">(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">ispell-skip-region-alist</span> (help/block-regex <span class="org-string">"EXAMPLE"</span>))
</pre>
</div>

<p>
Properties.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org8ec91e7">(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">ispell-skip-region-alist</span> <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">"^\s*:PROPERTIES\:$"</span> . <span class="org-string">"^\s*:END\:$"</span>))
</pre>
</div>

<p>
Footnotes.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org3e0dce1">(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">ispell-skip-region-alist</span> <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">"\\[fn:.+:"</span> . <span class="org-string">"\\]"</span>))
</pre>
</div>

<p>
Footnotes with URLs that contain line-breaks.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgd9041b1">(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">ispell-skip-region-alist</span> <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">"^http"</span> . <span class="org-string">"\\]"</span>))
</pre>
</div>

<p>
Bold text list items.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org28e698f">(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">ispell-skip-region-alist</span> <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">"- \\*.+"</span> . <span class="org-string">".*\\*: "</span>))
</pre>
</div>

<p>
Right arrows.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orge7d9d35">(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">ispell-skip-region-alist</span> <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">"\\rarr"</span>))
</pre>
</div>

<p>
Check <code>SPECIAL LINE</code> definitions, ignoring their type.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org13b9f35">(<span class="org-keyword">let</span> ()
  (<span class="org-keyword">--each</span>
      <span class="org-highlight-quoted-quote">'</span>((<span class="org-string">"ATTR_LATEX"</span> nil)
        (<span class="org-string">"AUTHOR"</span> nil)
        (<span class="org-string">"BLOG"</span> nil)
        (<span class="org-string">"CREATOR"</span> nil)
        (<span class="org-string">"DATE"</span> nil)
        (<span class="org-string">"DESCRIPTION"</span> nil)
        (<span class="org-string">"EMAIL"</span> nil)
        (<span class="org-string">"EXCLUDE_TAGS"</span> nil)
        (<span class="org-string">"HTML_CONTAINER"</span> nil)
        (<span class="org-string">"HTML_DOCTYPE"</span> nil)
        (<span class="org-string">"HTML_HEAD"</span> nil)
        (<span class="org-string">"HTML_HEAD_EXTRA"</span> nil)
        (<span class="org-string">"HTML_LINK_HOME"</span> nil)
        (<span class="org-string">"HTML_LINK_UP"</span> nil)
        (<span class="org-string">"HTML_MATHJAX"</span> nil)
        (<span class="org-string">"INFOJS_OPT"</span> nil)
        (<span class="org-string">"KEYWORDS"</span> nil)
        (<span class="org-string">"LANGUAGE"</span> nil)
        (<span class="org-string">"LATEX_CLASS"</span> nil)
        (<span class="org-string">"LATEX_CLASS_OPTIONS"</span> nil)
        (<span class="org-string">"LATEX_HEADER"</span> nil)
        (<span class="org-string">"LATEX_HEADER_EXTRA"</span> nil)
        (<span class="org-string">"NAME"</span> t)
        (<span class="org-string">"OPTIONS"</span> t)
        (<span class="org-string">"POSTID"</span> nil)
        (<span class="org-string">"RESULTS"</span> t)
        (<span class="org-string">"SELECT_TAGS"</span> nil)
        (<span class="org-string">"STARTUP"</span> nil)
        (<span class="org-string">"TITLE"</span> nil))
    (add-to-list
     <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">ispell-skip-region-alist</span>
     (<span class="org-keyword">let</span> ((special (concat <span class="org-string">"#[+]"</span> (car <span class="org-variable-name">it</span>) <span class="org-string">":"</span>)))
       (<span class="org-keyword">if</span> (cadr <span class="org-variable-name">it</span>)
           (cons special <span class="org-string">"$"</span>)
         (list special))))))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org0a2ed5e" class="outline-3">
<h3 id="org0a2ed5e"><span class="section-number-3">3.32</span> Sudo</h3>
<div class="outline-text-3" id="text-3-32">
<pre class="example">
ID: org_gcr_2017-05-12_mara:7853E266-9462-4CEB-A6AB-873EAC06666F
</pre>

<p>
Configure Sudo with Ido.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org1c5bd95">(<span class="org-keyword">help/on-osx</span>
 (<span class="org-keyword">defun</span> <span class="org-function-name">help/ido-find-file</span> ()
   <span class="org-doc">"Find file as root if necessary.</span>

<span class="org-doc">Attribution: URL `</span><span class="org-doc"><span class="org-constant">http://emacsredux.com/blog/2013/04/21/edit-files-as-root/</span></span><span class="org-doc">'"</span>
   (<span class="org-keyword">unless</span> (<span class="org-keyword">and</span> buffer-file-name
              (file-writable-p buffer-file-name))
     (find-alternate-file (concat <span class="org-string">"/sudo:root@localhost:"</span> buffer-file-name))))

 (advice-add <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">ido-find-file</span> <span class="org-builtin">:after</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/ido-find-file</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-org61a813f" class="outline-3">
<h3 id="org61a813f"><span class="section-number-3">3.33</span> Syntax Checking</h3>
<div class="outline-text-3" id="text-3-33">
<pre class="example">
ID: org_gcr_2017-05-12_mara:DD506D5A-5F57-4939-B446-536437FDDC97
</pre>

<p>
Do not perform syntactic analysis on-demand. Something about my config makes
global-mode puke and kill Emacs every so often.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orge35570a">(<span class="org-keyword">use-package</span> <span class="org-constant">flycheck</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:diminish</span> flycheck-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-org6bb7e5c" class="outline-3">
<h3 id="org6bb7e5c"><span class="section-number-3">3.34</span> TAB</h3>
<div class="outline-text-3" id="text-3-34">
<pre class="example">
ID: org_gcr_2017-05-12_mara:C9ACAB8C-1D19-4CC2-ABE9-ACEBCDBCA9E6
</pre>

<p>
Most modes in this system will never use TAB stops.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org62f85b1">(<span class="org-keyword">setq-default</span> indent-tabs-mode nil)
</pre>
</div>

<p>
Remove TAB from all buffers before persisting to the backing file unless it is
configured to retain TAB. The use case is a Makefile.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org833ba3e">(<span class="org-keyword">defun</span> <span class="org-function-name">help/untabify-if-not-indent-tabs-mode</span> ()
  <span class="org-doc">"Untabify if `</span><span class="org-doc"><span class="org-constant">indent-tabs-mode</span></span><span class="org-doc">' is false.</span>

<span class="org-doc">Attribution: URL `</span><span class="org-doc"><span class="org-constant">http://www.emacswiki.org/emacs/UntabifyUponSave</span></span><span class="org-doc">'"</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">when</span> (not indent-tabs-mode)
    (untabify (point-min) (point-max))))

(add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">before-save-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/untabify-if-not-indent-tabs-mode</span>)
</pre>
</div>

<p>
Most programing modes indent to 2 spaces. TABs should be the same width.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org3f61e66">(<span class="org-keyword">setq-default</span> tab-width 2)
</pre>
</div>
</div>
</div>
