help.org
** Version Control
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:BDC3035D-4F09-4A7B-8F14-1EE4604ACC0D
   :END:

Use VC for single files and Magit for multiple files.

The commit log editor uses With-Editor and Server modes. They are not
diminished because they are infrequently used.

#+NAME: org_gcr_2017-05-12_mara_3E77B825-E0A4-40EC-88DC-3F5C1E1445CE
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "~/src/magit/lisp")
(require 'magit)

(with-eval-after-load 'info
  (info-initialize)
  (add-to-list 'Info-directory-list
               "~/src/magit/Documentation/"))
#+END_SRC

Leave the VC message template empty.

#+NAME: org_gcr_2017-05-12_mara_A078BCD9-1559-412A-8D51-528CDDD4E402
#+BEGIN_SRC emacs-lisp
(eval-after-load "log-edit"
  '(remove-hook 'log-edit-hook 'log-edit-insert-message-template))
#+END_SRC

Change browsing.

#+NAME: org_gcr_2017-05-12_mara_A696BECA-ED39-4A7A-911A-66C396E0925C
#+BEGIN_SRC emacs-lisp
(use-package git-timemachine
  :ensure t)
#+END_SRC

VC activity keybindings.

#+NAME: org_gcr_2017-05-12_mara_A4E407FE-DD42-458A-BD83-2EFD71C1D728
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-M-w") #'git-timemachine)
(global-set-key (kbd "s-e") #'help/safb-help/magit-status)
(global-set-key (kbd "s-r") #'help/safb-vc-revert)
(global-set-key (kbd "s-f") #'help/safb-help/vc-next-action)
#+END_SRC

Git ignore files are text files.

#+NAME: org_gcr_2017-05-12_mara_C374930E-5AE3-478D-B3F1-E7791791D530
#+BEGIN_SRC emacs-lisp
(add-to-list 'auto-mode-alist '(".gitignore$" . text-mode))
#+END_SRC

Git config files.

#+NAME: org_gcr_2017-05-12_mara_0183A8E0-5A59-4A4B-9260-FF5E8C5CAF2C
#+BEGIN_SRC emacs-lisp
(use-package gitignore-mode
  :ensure t)

(use-package gitconfig-mode
  :ensure t)

(use-package gitattributes-mode
  :ensure t)
#+END_SRC

** Video
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:BB0F7B20-AC2C-49DB-B6A2-07D3C5D7A197
:END:

[[http://endlessparentheses.com/embedding-youtube-videos-with-org-mode-links.html][Embedding Youtube videos with org-mode links]].

#+NAME: org_gcr_2017-05-12_mara_BCF6CC3A-98AD-4845-BBE2-EB601E1A8550
#+BEGIN_SRC emacs-lisp
(defvar yt-iframe-format
  ;; You may want to change your width and height.
  (concat "<iframe width=\"440\""
          " height=\"335\""
          " src=\"https://www.youtube.com/embed/%s\""
          " frameborder=\"0\""
          " allowfullscreen>%s</iframe>"))

(org-add-link-type
 "yt"
 (lambda (handle)
   (browse-url
    (concat "https://www.youtube.com/embed/"
            handle)))
 (lambda (path desc backend)
   (cl-case backend
     (html (format yt-iframe-format
                   path (or desc "")))
     (latex (format "\href{%s}{%s}"
                    path (or desc "video"))))))
#+END_SRC

** Whitespace Management
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:9FBD1929-29C7-45CE-B9EC-DF0711778439
   :END:

- Visible Whitespace
  - Tabs

#+NAME: org_gcr_2017-05-12_mara_081024E6-F582-40DF-A96F-7216725FDD00
#+BEGIN_SRC emacs-lisp
(use-package whitespace
  :ensure t
  :config
  (setq whitespace-style '(tab-mark))
  (setq whitespace-display-mappings
        '((tab-mark ?\t [?↹ ?\t] [?␉ ?\t] [?\t])))
  (setq whitespace-line-column help/column-width)
  (global-whitespace-mode t)
  (setq whitespace-global-modes '(not go-mode))
  :diminish whitespace-mode global-whitespace-mode)
#+END_SRC

** Word Wrap
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:202157D8-58BB-4250-BDDD-98ADBF97F801
   :END:

#+NAME: org_gcr_2017-05-12_mara_BC6CD3BC-C736-40EE-84FD-33E2BB514A0C
#+BEGIN_SRC emacs-lisp
(diminish 'visual-line-mode)
#+END_SRC

Remind me that VLM is turned on so I pay attention to the wrap. There is a
Hydra that makes it easy to remember to turn it off.

#+NAME: org_gcr_2017-05-12_mara_EA8B5E3D-0F0B-4BD8-A510-864EC04BABD7
#+BEGIN_SRC emacs-lisp
(setq visual-line-fringe-indicators '(nil right-curly-arrow))
#+END_SRC

* Hacking
  :PROPERTIES:
  :ID:       org_gcr_2017-05-12_mara:E900FBB2-2D32-4253-BFE6-36BC951384A2
  :END:
Emacs has [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Basic-Major-Modes.html#Basic-Major-Modes][three primal major modes that you must understand]]:
- ~text-mode~
- ~prog-mode~
- ~special-mode~
