help.html

<div id="outline-container-org59c3cfc" class="outline-3">
<h3 id="org59c3cfc"><span class="section-number-3">3.35</span> Version Control</h3>
<div class="outline-text-3" id="text-3-35">
<pre class="example">
ID: org_gcr_2017-05-12_mara:BDC3035D-4F09-4A7B-8F14-1EE4604ACC0D
</pre>

<p>
Use VC for single files and Magit for multiple files.
</p>

<p>
The commit log editor uses With-Editor and Server modes. They are not
diminished because they are infrequently used.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org7498cac">(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">load-path</span> <span class="org-string">"~/src/magit/lisp"</span>)
(<span class="org-keyword">require</span> <span class="org-highlight-quoted-quote">'</span><span class="org-constant">magit</span>)

(<span class="org-keyword">with-eval-after-load</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">info</span>
  (info-initialize)
  (add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">Info-directory-list</span>
               <span class="org-string">"~/src/magit/Documentation/"</span>))
</pre>
</div>

<p>
Leave the VC message template empty.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org8f3f650">(eval-after-load <span class="org-string">"log-edit"</span>
  <span class="org-highlight-quoted-quote">'</span>(remove-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">log-edit-hook</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">log-edit-insert-message-template</span>))
</pre>
</div>

<p>
Change browsing.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org4e7237a">(<span class="org-keyword">use-package</span> <span class="org-constant">git-timemachine</span>
  <span class="org-builtin">:ensure</span> t)
</pre>
</div>

<p>
VC activity keybindings.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org477acff">(global-set-key (kbd <span class="org-string">"C-M-w"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">git-timemachine</span>)
(global-set-key (kbd <span class="org-string">"s-e"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/safb-help/magit-status</span>)
(global-set-key (kbd <span class="org-string">"s-r"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/safb-vc-revert</span>)
(global-set-key (kbd <span class="org-string">"s-f"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/safb-help/vc-next-action</span>)
</pre>
</div>

<p>
Git ignore files are text files.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org38b119e">(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">auto-mode-alist</span> <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">".gitignore$"</span> . text-mode))
</pre>
</div>

<p>
Git config files.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org61b96a0">(<span class="org-keyword">use-package</span> <span class="org-constant">gitignore-mode</span>
  <span class="org-builtin">:ensure</span> t)

(<span class="org-keyword">use-package</span> <span class="org-constant">gitconfig-mode</span>
  <span class="org-builtin">:ensure</span> t)

(<span class="org-keyword">use-package</span> <span class="org-constant">gitattributes-mode</span>
  <span class="org-builtin">:ensure</span> t)
</pre>
</div>
</div>
</div>

<div id="outline-container-org7094419" class="outline-3">
<h3 id="org7094419"><span class="section-number-3">3.36</span> Video</h3>
<div class="outline-text-3" id="text-3-36">
<pre class="example">
ID: org_gcr_2017-05-12_mara:BB0F7B20-AC2C-49DB-B6A2-07D3C5D7A197
</pre>

<p>
<a href="http://endlessparentheses.com/embedding-youtube-videos-with-org-mode-links.html">Embedding Youtube videos with org-mode links</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgcd9a03d">(<span class="org-keyword">defvar</span> <span class="org-variable-name">yt-iframe-format</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">You may want to change your width and height.</span>
  (concat <span class="org-string">"&lt;iframe width=\"440\""</span>
          <span class="org-string">" height=\"335\""</span>
          <span class="org-string">" src=\"https://www.youtube.com/embed/%s\""</span>
          <span class="org-string">" frameborder=\"0\""</span>
          <span class="org-string">" allowfullscreen&gt;%s&lt;/iframe&gt;"</span>))

(org-add-link-type
 <span class="org-string">"yt"</span>
 (<span class="org-keyword">lambda</span> (handle)
   (browse-url
    (concat <span class="org-string">"https://www.youtube.com/embed/"</span>
            handle)))
 (<span class="org-keyword">lambda</span> (path desc backend)
   (<span class="org-keyword">cl-case</span> backend
     (html (format yt-iframe-format
                   path (<span class="org-keyword">or</span> desc <span class="org-string">""</span>)))
     (latex (format <span class="org-string">"\href{%s}{%s}"</span>
                    path (<span class="org-keyword">or</span> desc <span class="org-string">"video"</span>))))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgac08020" class="outline-3">
<h3 id="orgac08020"><span class="section-number-3">3.37</span> Whitespace Management</h3>
<div class="outline-text-3" id="text-3-37">
<pre class="example">
ID: org_gcr_2017-05-12_mara:9FBD1929-29C7-45CE-B9EC-DF0711778439
</pre>

<ul class="org-ul">
<li>Visible Whitespace
<ul class="org-ul">
<li>Tabs</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org45c7d56">(<span class="org-keyword">use-package</span> <span class="org-constant">whitespace</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">setq</span> whitespace-style <span class="org-highlight-quoted-quote">'</span>(tab-mark))
  (<span class="org-keyword">setq</span> whitespace-display-mappings
        <span class="org-highlight-quoted-quote">'</span>((tab-mark ?\t [?&#8633; ?\t] [?&#9225; ?\t] [?\t])))
  (<span class="org-keyword">setq</span> whitespace-line-column help/column-width)
  (global-whitespace-mode t)
  (<span class="org-keyword">setq</span> whitespace-global-modes <span class="org-highlight-quoted-quote">'</span>(not go-mode))
  <span class="org-builtin">:diminish</span> whitespace-mode global-whitespace-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-org0cee29e" class="outline-3">
<h3 id="org0cee29e"><span class="section-number-3">3.38</span> Word Wrap</h3>
<div class="outline-text-3" id="text-3-38">
<pre class="example">
ID: org_gcr_2017-05-12_mara:202157D8-58BB-4250-BDDD-98ADBF97F801
</pre>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgd884468">(diminish <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">visual-line-mode</span>)
</pre>
</div>

<p>
Remind me that VLM is turned on so I pay attention to the wrap. There is a
Hydra that makes it easy to remember to turn it off.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org26d27b4">(<span class="org-keyword">setq</span> visual-line-fringe-indicators <span class="org-highlight-quoted-quote">'</span>(nil right-curly-arrow))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge87e60c" class="outline-2">
<h2 id="orge87e60c"><span class="section-number-2">4</span> Hacking</h2>
<div class="outline-text-2" id="text-4">
<pre class="example">
ID: org_gcr_2017-05-12_mara:E900FBB2-2D32-4253-BFE6-36BC951384A2
</pre>
<p>
Emacs has <a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Basic-Major-Modes.html#Basic-Major-Modes">three primal major modes that you must understand</a>:
</p>
<ul class="org-ul">
<li><code>text-mode</code></li>
<li><code>prog-mode</code></li>
<li><code>special-mode</code></li>
</ul>
</div>
