help.org
** Common Configurations
  :PROPERTIES:
  :ID:       org_gcr_2017-05-12_mara:1864484F-237D-4443-BDD6-D429AAB7BD1A
  :END:

This system configures ~text-mode~ and ~prog-mode~ very similarly:

- EMACS *exists* to help you work with text.
- EMACS' entire configuration helps you work with text whether it is in a
  specific mode or not.
- Org-Mode's motto is "*Organize Your Life In Plain Text!*".
- From an EMACS and a LP perspective ~text-mode~ *is a* programming mode.
- In this system: *Text is the User-Interface*.

This system does not rely on ~prog-mode~ inheritance to configure it's hacking
modes:

- The EMACS literature advises that modes extend ~text-mode~ or ~prog-mode~
- That /would/ make it easier to configure nearly everything using ~prog-mode-hook~.
- In practice ~prog-mode~ is too new.
- Not all programming modes inherit from it. Not even =IELM= is ready.

With that in mind this system:

- Defines common configuration here for reuse in every desired mode starting
  with =text-mode= and then all logical programming modes.
- Explicitly utilizes it directly instead of using inheritance.
- This system refers to this configuration of programming modes as =prog*-mode=.
- The line between "configuring EMACS", "configuring ~text-mode~", and
  "configuring ~prog*-mode~" is often blurred and sometimes confusing. The lines
  become wavy and intertwined with mastery of EMACS and LP.

Make sense of the current mode.

#+NAME: org_gcr_2017-05-23_mara_9517CF5A-C95B-454E-A68F-1E4BA677C08C
#+BEGIN_SRC emacs-lisp
(use-package parent-mode
  :ensure t
  :config
  (defun help/parent-mode-display ()
    "Display this buffer's mode hierarchy."
    (interactive)
    (let ((ls (parent-mode-list major-mode)))
      (princ ls))))
#+END_SRC

*** Special Mode
:PROPERTIES:
:ID:       org_gcr_2017-06-25_mara:7C9667D1-C881-40AC-9312-EB11A9F4F61E
:END:
Every special mode needs this. Which is nothing yet.
*** Text-Mode
    :PROPERTIES:
    :ID:       org_gcr_2017-05-12_mara:C3270DE0-55FD-4612-B3E3-226CAC5A8FDA
    :END:
Every text editing buffer needs this.

#+NAME: org_gcr_2017-05-12_mara_1FF81C16-BEB0-4B42-806A-D033566FC63F
#+BEGIN_SRC emacs-lisp
(defun help/text-mode-fn ()
  "HELP's standard configuration for buffer's working with text, often for
   programming."
  (interactive)
  (auto-fill-mode)
  (diminish 'auto-fill-function)
  (visual-line-mode)
  (nlinum-mode)
  (fci-mode)
  (rainbow-mode)
  (help/try-to-add-imenu)
  (turn-on-page-break-lines-mode))

(add-hook 'text-mode-hook #'help/text-mode-fn)
#+END_SRC
*** Prog-Mode Modes
    :PROPERTIES:
    :ID:       org_gcr_2017-05-12_mara:E20FE37A-E10D-406C-B95D-545607F7A93C
    :END:

- Mode inheritance is represented by list definition & indentation.
- Some modes are so simple that inheritance isn't defined.

- Hacking mode hooks.
  - Configurations common to every hacking vehicle.
    #+NAME: org_gcr_2017-05-12_mara_B9BA4FF5-62AC-4806-8E74-766E36C5148C
    #+BEGIN_SRC emacs-lisp
(setq help/prog-modes '(makefile-mode-hook
                        ruby-mode-hook
                        sh-mode-hook
                        plantuml-mode-hook
                        tex-mode-hook
                        R-mode-hook
                        SAS-mode-hook
                        graphviz-dot-mode-hook
                        c-mode-common-hook
                        php-mode-hook
                        scad-mode-hook
                        web-mode-hook
                        js2-mode-hook
                        json-mode-hook
                        crontab-mode-hook
                        apache-mode-hook
                        python-mode-hook
                        gnu-apl-mode-hook
                        geiser-mode-hook
                        geiser-repl-mode-hook
                        go-mode-hook
                        fsharp-mode-hook))
    #+END_SRC
  - LISP mode hooks.
    - Are hacking modes.
      #+NAME: org_gcr_2017-05-12_mara_F410CDAB-D4FE-42B8-BCB7-F37DC500CE86
      #+BEGIN_SRC emacs-lisp
(setq help/lisp-modes
      '(emacs-lisp-mode-hook
        ielm-mode-hook
        lisp-interaction-mode-hook
        scheme-mode-hook
        inferior-scheme-mode-hook
        geiser-mode-hook
        geiser-repl-mode-hook))
(setq help/prog-modes (append help/prog-modes help/lisp-modes))
      #+END_SRC
    - IELM mode hook.
      - Does one or two more things.

*** Prog-Mode Hook Function
    :PROPERTIES:
    :ID:       org_gcr_2017-05-12_mara:750D5ACE-FB06-4A71-A0C1-634C71198A5F
    :END:

**** Goal
     :PROPERTIES:
     :ID:       org_gcr_2017-05-12_mara:34B0116F-B50F-487A-A605-0D31C07F6773
     :END:

- Indent at every opportunity and automatically. Verify that it makes sense
  for the mode. Explicitly define instead of relying on ~prog-mode~ inheritance;
  use this documents logical ~prog*-mode~ approach instead.
  #+NAME: org_gcr_2017-05-12_mara_02408658-D767-4D6E-8AAA-2BE1933BCBD1
  #+BEGIN_SRC emacs-lisp
(use-package aggressive-indent
  :ensure t
  :config)
  #+END_SRC
- Always maintain balanced brackets. Easily wrap the selected region. Auto-escape
  strings pasted into other strings. Smartparens provides built-in correct
  behavior for most modes.
  #+NAME: org_gcr_2017-05-12_mara_3AB5C00B-E0FF-40A1-9C3B-420CB4E8D417
  #+BEGIN_SRC emacs-lisp
(use-package smartparens
  :ensure t
  :config
  (setq sp-show-pair-from-inside nil)
  (require 'smartparens-config)
  :diminish smartparens-mode)
  #+END_SRC

**** Implementation
     :PROPERTIES:
     :ID:       org_gcr_2017-05-12_mara:7917A66D-8F20-43A1-888A-E9F0C86C23A7
     :END:

#+NAME: org_gcr_2017-05-12_mara_A3C53136-65BE-4771-A214-19E102E0158B
#+BEGIN_SRC emacs-lisp
(defun help/prog-mode-hook-fn ()
  (interactive)
  (help/text-mode-fn)
  (smartparens-strict-mode)
  (aggressive-indent-mode)
  (hs-minor-mode)
  (help/not-on-gui (local-set-key (kbd "RET") #'newline-and-indent))
  (help/on-gui (local-set-key (kbd "<return>") #'newline-and-indent)))

(let ()
  (--each help/prog-modes
    (add-hook it #'help/prog-mode-hook-fn)))
#+END_SRC

