help.html
<div id="outline-container-org81bdb6b" class="outline-3">
<h3 id="org81bdb6b"><span class="section-number-3">4.1</span> Common Configurations</h3>
<div class="outline-text-3" id="text-4-1">
<pre class="example">
ID: org_gcr_2017-05-12_mara:1864484F-237D-4443-BDD6-D429AAB7BD1A
</pre>

<p>
This system configures <code>text-mode</code> and <code>prog-mode</code> very similarly:
</p>

<ul class="org-ul">
<li>EMACS <b>exists</b> to help you work with text.</li>
<li>EMACS&rsquo; entire configuration helps you work with text whether it is in a
specific mode or not.</li>
<li>Org-Mode&rsquo;s motto is &ldquo;<b>Organize Your Life In Plain Text!</b>&rdquo;.</li>
<li>From an EMACS and a LP perspective <code>text-mode</code> <b>is a</b> programming mode.</li>
<li>In this system: <b>Text is the User-Interface</b>.</li>
</ul>

<p>
This system does not rely on <code>prog-mode</code> inheritance to configure it&rsquo;s hacking
modes:
</p>

<ul class="org-ul">
<li>The EMACS literature advises that modes extend <code>text-mode</code> or <code>prog-mode</code></li>
<li>That <i>would</i> make it easier to configure nearly everything using <code>prog-mode-hook</code>.</li>
<li>In practice <code>prog-mode</code> is too new.</li>
<li>Not all programming modes inherit from it. Not even <code>IELM</code> is ready.</li>
</ul>

<p>
With that in mind this system:
</p>

<ul class="org-ul">
<li>Defines common configuration here for reuse in every desired mode starting
with <code>text-mode</code> and then all logical programming modes.</li>
<li>Explicitly utilizes it directly instead of using inheritance.</li>
<li>This system refers to this configuration of programming modes as <code>prog*-mode</code>.</li>
<li>The line between &ldquo;configuring EMACS&rdquo;, &ldquo;configuring <code>text-mode</code>&rdquo;, and
&ldquo;configuring <code>prog*-mode</code>&rdquo; is often blurred and sometimes confusing. The lines
become wavy and intertwined with mastery of EMACS and LP.</li>
</ul>

<p>
Make sense of the current mode.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org03126d9">(<span class="org-keyword">use-package</span> <span class="org-constant">parent-mode</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">defun</span> <span class="org-function-name">help/parent-mode-display</span> ()
    <span class="org-doc">"Display this buffer's mode hierarchy."</span>
    (<span class="org-keyword">interactive</span>)
    (<span class="org-keyword">let</span> ((ls (parent-mode-list major-mode)))
      (princ ls))))
</pre>
</div>
</div>

<div id="outline-container-org412b37f" class="outline-4">
<h4 id="org412b37f"><span class="section-number-4">4.1.1</span> Special Mode</h4>
<div class="outline-text-4" id="text-4-1-1">
<pre class="example">
ID: org_gcr_2017-06-25_mara:7C9667D1-C881-40AC-9312-EB11A9F4F61E
</pre>
<p>
Every special mode needs this. Which is nothing yet.
</p>
</div>
</div>
<div id="outline-container-org849fda6" class="outline-4">
<h4 id="org849fda6"><span class="section-number-4">4.1.2</span> Text-Mode</h4>
<div class="outline-text-4" id="text-4-1-2">
<pre class="example">
ID: org_gcr_2017-05-12_mara:C3270DE0-55FD-4612-B3E3-226CAC5A8FDA
</pre>
<p>
Every text editing buffer needs this.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orga495f13">(<span class="org-keyword">defun</span> <span class="org-function-name">help/text-mode-fn</span> ()
  <span class="org-doc">"HELP's standard configuration for buffer's working with text, often for</span>
<span class="org-doc">   programming."</span>
  (<span class="org-keyword">interactive</span>)
  (auto-fill-mode)
  (diminish <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">auto-fill-function</span>)
  (visual-line-mode)
  (nlinum-mode)
  (fci-mode)
  (rainbow-mode)
  (help/try-to-add-imenu)
  (turn-on-page-break-lines-mode))

(add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">text-mode-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/text-mode-fn</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb75baaa" class="outline-4">
<h4 id="orgb75baaa"><span class="section-number-4">4.1.3</span> Prog-Mode Modes</h4>
<div class="outline-text-4" id="text-4-1-3">
<pre class="example">
ID: org_gcr_2017-05-12_mara:E20FE37A-E10D-406C-B95D-545607F7A93C
</pre>

<ul class="org-ul">
<li>Mode inheritance is represented by list definition &amp; indentation.</li>
<li>Some modes are so simple that inheritance isn&rsquo;t defined.</li>

<li>Hacking mode hooks.
<ul class="org-ul">
<li><p>
Configurations common to every hacking vehicle.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgfe1c88d">(<span class="org-keyword">setq</span> help/prog-modes <span class="org-highlight-quoted-quote">'</span>(makefile-mode-hook
                        ruby-mode-hook
                        sh-mode-hook
                        plantuml-mode-hook
                        tex-mode-hook
                        R-mode-hook
                        SAS-mode-hook
                        graphviz-dot-mode-hook
                        c-mode-common-hook
                        php-mode-hook
                        scad-mode-hook
                        web-mode-hook
                        js2-mode-hook
                        json-mode-hook
                        crontab-mode-hook
                        apache-mode-hook
                        python-mode-hook
                        gnu-apl-mode-hook
                        geiser-mode-hook
                        geiser-repl-mode-hook
                        go-mode-hook
                        fsharp-mode-hook))
</pre>
</div></li>
<li>LISP mode hooks.
<ul class="org-ul">
<li><p>
Are hacking modes.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org9f25b11">(<span class="org-keyword">setq</span> help/lisp-modes
      <span class="org-highlight-quoted-quote">'</span>(emacs-lisp-mode-hook
        ielm-mode-hook
        lisp-interaction-mode-hook
        scheme-mode-hook
        inferior-scheme-mode-hook
        geiser-mode-hook
        geiser-repl-mode-hook))
(<span class="org-keyword">setq</span> help/prog-modes (append help/prog-modes help/lisp-modes))
</pre>
</div></li>
<li>IELM mode hook.
<ul class="org-ul">
<li>Does one or two more things.</li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org8c93341" class="outline-4">
<h4 id="org8c93341"><span class="section-number-4">4.1.4</span> Prog-Mode Hook Function</h4>
<div class="outline-text-4" id="text-4-1-4">
<pre class="example">
ID: org_gcr_2017-05-12_mara:750D5ACE-FB06-4A71-A0C1-634C71198A5F
</pre>
</div>

<ol class="org-ol">
<li><a id="org3908eaf"></a>Goal<br>
<div class="outline-text-5" id="text-4-1-4-1">
<pre class="example">
ID: org_gcr_2017-05-12_mara:34B0116F-B50F-487A-A605-0D31C07F6773
</pre>

<ul class="org-ul">
<li><p>
Indent at every opportunity and automatically. Verify that it makes sense
for the mode. Explicitly define instead of relying on <code>prog-mode</code> inheritance;
use this documents logical <code>prog*-mode</code> approach instead.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org4e1d9cd">(<span class="org-keyword">use-package</span> <span class="org-constant">aggressive-indent</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>)
</pre>
</div></li>
<li><p>
Always maintain balanced brackets. Easily wrap the selected region. Auto-escape
strings pasted into other strings. Smartparens provides built-in correct
behavior for most modes.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org16d7580">(<span class="org-keyword">use-package</span> <span class="org-constant">smartparens</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">setq</span> sp-show-pair-from-inside nil)
  (<span class="org-keyword">require</span> <span class="org-highlight-quoted-quote">'</span><span class="org-constant">smartparens-config</span>)
  <span class="org-builtin">:diminish</span> smartparens-mode)
</pre>
</div></li>
</ul>
</div>
</li>

<li><a id="org4fab669"></a>Implementation<br>
<div class="outline-text-5" id="text-4-1-4-2">
<pre class="example">
ID: org_gcr_2017-05-12_mara:7917A66D-8F20-43A1-888A-E9F0C86C23A7
</pre>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orga5e2145">(<span class="org-keyword">defun</span> <span class="org-function-name">help/prog-mode-hook-fn</span> ()
  (<span class="org-keyword">interactive</span>)
  (help/text-mode-fn)
  (smartparens-strict-mode)
  (aggressive-indent-mode)
  (hs-minor-mode)
  (<span class="org-keyword">help/not-on-gui</span> (local-set-key (kbd <span class="org-string">"RET"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">newline-and-indent</span>))
  (<span class="org-keyword">help/on-gui</span> (local-set-key (kbd <span class="org-string">"&lt;return&gt;"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">newline-and-indent</span>)))

(<span class="org-keyword">let</span> ()
  (<span class="org-keyword">--each</span> help/prog-modes
    (add-hook <span class="org-variable-name">it</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/prog-mode-hook-fn</span>)))
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
