help.org
** Literate Programming
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:18EBD4EF-AFAD-4421-A09F-A7DB14AD1398
   :END:
*** Emacs Lisp
  :PROPERTIES:
  :ID:       org_gcr_2017-05-12_mara:3A31F89D-2534-4E5F-8C3B-3CEBAFAC9E2D
  :END:

Have fun with scratch.

#+NAME: org_gcr_2017-05-12_mara_C344E972-D31C-48F4-8E3B-83A799DE7D37
#+BEGIN_SRC emacs-lisp
(setq initial-scratch-message ";; Happy Hacking 🖖\n\n")
#+END_SRC

Use ~emacs-lisp~ in scratch.

#+NAME: org_gcr_2017-05-12_mara_A929CBE0-E6D3-4A45-8341-15F50EF2F93A
#+BEGIN_SRC emacs-lisp
(setq initial-major-mode 'emacs-lisp-mode)
#+END_SRC

Immortal scratch [[https://www.reddit.com/r/emacs/comments/4cmfwp/scratch_buffer_hacks_to_increase_its_utility/][via]].

#+NAME: org_gcr_2017-05-12_mara_1F06F375-41F5-48FA-B787-8B937BDF56FC
#+BEGIN_SRC emacs-lisp
(with-current-buffer "*scratch*"
  (emacs-lock-mode 'kill))
#+END_SRC

Persistent scratch.

#+NAME: org_gcr_2017-05-12_mara_2757B16C-18ED-4F29-8DFD-CE51B930BA81
#+BEGIN_SRC emacs-lisp
(use-package persistent-scratch
  :ensure t
  :config
  (persistent-scratch-setup-default))
#+END_SRC

Broadcast scoping mode.

#+NAME: org_gcr_2017-05-12_mara_BEA970EF-78FA-448D-96B3-1E135640D16A
#+BEGIN_SRC emacs-lisp
(use-package lexbind-mode)
#+END_SRC

Slime navigation:
- "navigation to the symbol at point": ~M-.~
- "pop back to previous marks": ~M-,~
- "describe the symbol at point": ~C-c C-d C-d~

Symbol visualization.

#+NAME: org_gcr_2017-07-16_mara_766EBC8F-2A7C-49BB-9916-BE2AAEE019A4
#+BEGIN_SRC emacs-lisp
(use-package highlight-quoted
  :ensure t)
#+END_SRC

Quasi-Quote visualization.

#+NAME: org_gcr_2017-07-16_mara_A1EC88B1-71CF-458E-A626-D6A07108BA3F
#+BEGIN_SRC emacs-lisp
(use-package highlight-stages
  :ensure t)
#+END_SRC

#+NAME: org_gcr_2017-05-12_mara_26AEDAD1-36FC-490D-92F4-86E0966467E2
#+BEGIN_SRC emacs-lisp
(use-package elisp-slime-nav
  :ensure t
  :diminish elisp-slime-nav-mode)
#+END_SRC

#+NAME: org_gcr_2017-05-12_mara_D8F41BFE-D2F5-4B86-BFED-B3DE5EA2133C
#+BEGIN_SRC emacs-lisp
(defun help/elisp-eval-buffer ()
  "Intelligently evaluate an Elisp buffer."
  (interactive)
  (help/save-all-file-buffers)
  (eval-buffer))

(defun help/elisp-mode-local-bindings ()
  "Helpful behavior for Elisp buffers."
  (local-set-key (kbd "s-l eb") #'help/elisp-eval-buffer)
  (local-set-key (kbd "s-l ep") #'eval-print-last-sexp)
  (local-set-key (kbd "s-l td") #'toggle-debug-on-error)
  (local-set-key (kbd "s-l mef") #'macroexpand)
  (local-set-key (kbd "s-l mea") #'macroexpand-all)
  (local-set-key (kbd "C-c e") #'macrostep-expand))

(defhydra help/hydra-elisp-mode (:color blue
                                        :hint nil)
  "
elisp-mode:
 _d_ describe-thing _f_ find-thing
  _q_ quit
"
  ("d" elisp-slime-nav-describe-elisp-thing-at-point)
  ("f" elisp-slime-nav-find-elisp-thing-at-point)
  ("q" nil))
(key-chord-define emacs-lisp-mode-map "hh" #'help/hydra-elisp-mode/body)

(defun help/emacs-lisp-mode-hook-fn ()
  (interactive)
  (help/elisp-mode-local-bindings)
  (lexbind-mode)
  (eldoc-mode)
  (diminish 'eldoc-mode)
  (turn-on-elisp-slime-nav-mode)
  (highlight-quoted-mode)
  (highlight-stages-mode))

(setq ielm-noisy nil)

(setq ielm-prompt "𝔼LISP> ")

(setq ielm-dynamic-return nil)

(setq ielm-dynamic-multiline-inputs nil)

(defun help/ielm-mode-hook-fn ()
  "HELP customizations."
  (interactive)
  (help/ielm-auto-complete)
  (turn-on-elisp-slime-nav-mode))

(add-hook 'ielm-mode-hook #'help/ielm-mode-hook-fn)

(defun help/general-lisp-mode-hook-fn ()
  (highlight-quoted-mode)
  (highlight-stages-mode)
  (local-set-key (kbd "#") #'endless/sharp))

(let ()
  (--each help/lisp-modes
    (add-hook it #'help/general-lisp-mode-hook-fn)))
#+END_SRC

"find callers of elisp functions or macros".

#+NAME: org_gcr_2017-05-12_mara_7DB4D819-0D2D-482B-AA02-9CB14F6DA288
#+BEGIN_SRC emacs-lisp
(use-package elisp-refs
  :ensure t)
#+END_SRC

Package lint.

#+NAME: org_gcr_2017-05-12_mara_2B359320-563A-4E80-BB8E-04965E20EBEE
#+BEGIN_SRC emacs-lisp
(use-package package-lint
  :ensure t)

(use-package flycheck-package
  :ensure t
  :after (package-lint))
#+END_SRC

*** Org-Mode
  :PROPERTIES:
  :ID:       org_gcr_2017-05-12_mara:D017621F-5169-442A-A52C-7D91EEB7D796
  :END:

