help.html

<div id="outline-container-org1600d24" class="outline-3">
<h3 id="org1600d24"><span class="section-number-3">4.2</span> Literate Programming</h3>
<div class="outline-text-3" id="text-4-2">
<pre class="example">
ID: org_gcr_2017-05-12_mara:18EBD4EF-AFAD-4421-A09F-A7DB14AD1398
</pre>
</div>
<div id="outline-container-org4445795" class="outline-4">
<h4 id="org4445795"><span class="section-number-4">4.2.1</span> Emacs Lisp</h4>
<div class="outline-text-4" id="text-4-2-1">
<pre class="example">
ID: org_gcr_2017-05-12_mara:3A31F89D-2534-4E5F-8C3B-3CEBAFAC9E2D
</pre>

<p>
Have fun with scratch.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org1a83bed">(<span class="org-keyword">setq</span> initial-scratch-message <span class="org-string">";; Happy Hacking &#128406;\n\n"</span>)
</pre>
</div>

<p>
Use <code>emacs-lisp</code> in scratch.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org7d1a7ce">(<span class="org-keyword">setq</span> initial-major-mode <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">emacs-lisp-mode</span>)
</pre>
</div>

<p>
Immortal scratch <a href="https://www.reddit.com/r/emacs/comments/4cmfwp/scratch_buffer_hacks_to_increase_its_utility/">via</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org3883c58">(<span class="org-keyword">with-current-buffer</span> <span class="org-string">"*scratch*"</span>
  (emacs-lock-mode <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">kill</span>))
</pre>
</div>

<p>
Persistent scratch.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org294ed81">(<span class="org-keyword">use-package</span> <span class="org-constant">persistent-scratch</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (persistent-scratch-setup-default))
</pre>
</div>

<p>
Broadcast scoping mode.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org246f12f">(<span class="org-keyword">use-package</span> <span class="org-constant">lexbind-mode</span>)
</pre>
</div>

<p>
Slime navigation:
</p>
<ul class="org-ul">
<li>&ldquo;navigation to the symbol at point&rdquo;: <code>M-.</code></li>
<li>&ldquo;pop back to previous marks&rdquo;: <code>M-,</code></li>
<li>&ldquo;describe the symbol at point&rdquo;: <code>C-c C-d C-d</code></li>
</ul>

<p>
Symbol visualization.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orge7736a2">(<span class="org-keyword">use-package</span> <span class="org-constant">highlight-quoted</span>
  <span class="org-builtin">:ensure</span> t)
</pre>
</div>

<p>
Quasi-Quote visualization.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org3ffe590">(<span class="org-keyword">use-package</span> <span class="org-constant">highlight-stages</span>
  <span class="org-builtin">:ensure</span> t)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgbb7c1b9">(<span class="org-keyword">use-package</span> <span class="org-constant">elisp-slime-nav</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:diminish</span> elisp-slime-nav-mode)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgf21fe51">(<span class="org-keyword">defun</span> <span class="org-function-name">help/elisp-eval-buffer</span> ()
  <span class="org-doc">"Intelligently evaluate an Elisp buffer."</span>
  (<span class="org-keyword">interactive</span>)
  (help/save-all-file-buffers)
  (eval-buffer))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/elisp-mode-local-bindings</span> ()
  <span class="org-doc">"Helpful behavior for Elisp buffers."</span>
  (local-set-key (kbd <span class="org-string">"s-l eb"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/elisp-eval-buffer</span>)
  (local-set-key (kbd <span class="org-string">"s-l ep"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">eval-print-last-sexp</span>)
  (local-set-key (kbd <span class="org-string">"s-l td"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">toggle-debug-on-error</span>)
  (local-set-key (kbd <span class="org-string">"s-l mef"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">macroexpand</span>)
  (local-set-key (kbd <span class="org-string">"s-l mea"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">macroexpand-all</span>)
  (local-set-key (kbd <span class="org-string">"C-c e"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">macrostep-expand</span>))

(<span class="org-keyword">defhydra</span> help/hydra-elisp-mode (<span class="org-builtin">:color</span> <span class="custom"><span class="custom-1">blue</span></span>
                                        <span class="org-builtin">:hint</span> nil)
  <span class="org-doc">"</span>
<span class="org-doc">elisp-mode:</span>
<span class="org-doc"> _d_ describe-thing _f_ find-thing</span>
<span class="org-doc">  _q_ quit</span>
<span class="org-doc">"</span>
  (<span class="org-string">"d"</span> elisp-slime-nav-describe-elisp-thing-at-point)
  (<span class="org-string">"f"</span> elisp-slime-nav-find-elisp-thing-at-point)
  (<span class="org-string">"q"</span> nil))
(key-chord-define emacs-lisp-mode-map <span class="org-string">"hh"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/hydra-elisp-mode/body</span>)

(<span class="org-keyword">defun</span> <span class="org-function-name">help/emacs-lisp-mode-hook-fn</span> ()
  (<span class="org-keyword">interactive</span>)
  (help/elisp-mode-local-bindings)
  (lexbind-mode)
  (eldoc-mode)
  (diminish <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">eldoc-mode</span>)
  (turn-on-elisp-slime-nav-mode)
  (highlight-quoted-mode)
  (highlight-stages-mode))

(<span class="org-keyword">setq</span> ielm-noisy nil)

(<span class="org-keyword">setq</span> ielm-prompt <span class="org-string">"&#120124;LISP&gt; "</span>)

(<span class="org-keyword">setq</span> ielm-dynamic-return nil)

(<span class="org-keyword">setq</span> ielm-dynamic-multiline-inputs nil)

(<span class="org-keyword">defun</span> <span class="org-function-name">help/ielm-mode-hook-fn</span> ()
  <span class="org-doc">"HELP customizations."</span>
  (<span class="org-keyword">interactive</span>)
  (help/ielm-auto-complete)
  (turn-on-elisp-slime-nav-mode))

(add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">ielm-mode-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/ielm-mode-hook-fn</span>)

(<span class="org-keyword">defun</span> <span class="org-function-name">help/general-lisp-mode-hook-fn</span> ()
  (highlight-quoted-mode)
  (highlight-stages-mode)
  (local-set-key (kbd <span class="org-string">"#"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">endless/sharp</span>))

(<span class="org-keyword">let</span> ()
  (<span class="org-keyword">--each</span> help/lisp-modes
    (add-hook <span class="org-variable-name">it</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/general-lisp-mode-hook-fn</span>)))
</pre>
</div>

<p>
&ldquo;find callers of elisp functions or macros&rdquo;.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org6953441">(<span class="org-keyword">use-package</span> <span class="org-constant">elisp-refs</span>
  <span class="org-builtin">:ensure</span> t)
</pre>
</div>

<p>
Package lint.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgb07a060">(<span class="org-keyword">use-package</span> <span class="org-constant">package-lint</span>
  <span class="org-builtin">:ensure</span> t)

(<span class="org-keyword">use-package</span> <span class="org-constant">flycheck-package</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:after</span> (package-lint))
</pre>
</div>
</div>
</div>

<div id="outline-container-org5b2a68b" class="outline-4">
<h4 id="org5b2a68b"><span class="section-number-4">4.2.2</span> Org-Mode</h4>
<div class="outline-text-4" id="text-4-2-2">
<pre class="example">
ID: org_gcr_2017-05-12_mara:D017621F-5169-442A-A52C-7D91EEB7D796
</pre>
</div>

<ol class="org-ol">
