help.org
**** Literate Programming
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:CD4943EE-DE3D-4B3A-AB12-525580DC8EB7
:END:

When source blocks are evaluated, their results get stored in a result area,
typically for display. If the results are small, they are displayed with colons
instead of an =example= block. Instead, *always* place them in an
example block. This makes exports more consistent and other Org-Mode features seem
to behave more predictably.

#+NAME: org_gcr_2017-05-12_mara_9D21E326-1742-4DD0-BDF9-624D21873F92
#+BEGIN_SRC emacs-lisp
(setq org-babel-min-lines-for-block-output 0)
#+END_SRC

Configure Org-Mode to manage it's Source-Block backed buffers the same as the
rest of this system.

#+NAME: org_gcr_2017-05-12_mara_9427EB38-B623-4B99-B562-C2FD737EB0D7
#+BEGIN_SRC emacs-lisp
(setq org-edit-src-auto-save-idle-delay 0)
(setq org-edit-src-turn-on-auto-save nil)
#+END_SRC

Update in-buffer images after Source-Block execution. This is a programming task.
That is why it is under this heading and Evaluation. This is a setting configuring
how the results of evaluation are refreshed in EMACS.

#+NAME: org_gcr_2017-05-12_mara_780AFFD3-B8F3-4D0F-A3C1-DB30C2182730
#+BEGIN_SRC emacs-lisp
(defun help/org-babel-after-execute-hook ()
  "HELP settings for the `org-babel-after-execute-hook'.

This does not interfere with exports.

Attribution: URL `https://lists.gnu.org/archive/html/emacs-orgmode/2015-01/msg00534.html'"
  (interactive)
  (org-redisplay-inline-images))

(add-hook 'org-babel-after-execute-hook #'help/org-babel-after-execute-hook)
#+END_SRC

Never "automatically" evaluate a source block.

#+NAME: org_gcr_2017-05-12_mara_F0536A1B-195D-4AB9-90B8-D73651740849
#+BEGIN_SRC emacs-lisp
(setq org-confirm-babel-evaluate nil)
#+END_SRC

Make it unpleasant for Sysop to modify source-block outside of a source-block
backed buffer. The next step is to write some code to prevent modifying
source-blocks outside of that place.

#+NAME: org_gcr_2017-05-12_mara_B804AA93-9D3B-4DC8-BFA3-658DD1FB0601
#+BEGIN_SRC emacs-lisp
(setq org-src-tab-acts-natively nil)
#+END_SRC

**** Workflow
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:0CFAE46B-8D06-48FB-8D7E-7B636C91D443
:END:

- Custom TODO workflow states requirements, each answering the following questions:
  - Version 01
    - What needs to be done? TODO
    - What is being done right now? IN-PROGRESS
    - What is waiting because an external agent? HELD-BLOCKED
    - What is waiting because I have put it on hold? HELD-FROZEN
    - What is waiting until another date? (although I'm not using the Agenda) HELD-UNTIL
    - What is complete and needs to be reviewed? REVIEW
    - What is complete? DONE
  - Version 02
    - Questions about every state
      - When was it created?
        - The purpose of its creation is contained within its Headline and its
          contents "when?" and "why?" aren't required
      - When was it changed and why?
        - The reason for the change is probably in the body of the Headline so
          why bother keeping a note here? Bother because it makes it easier to
          review the state-change of a task because
          - It probably isn't worth keeping in the task long-term (it is
            transient)
            - But it still matters and I want to know about it
          - If it is worth keeping in the task long-term then it will be there
            but
            - It makes it easier to review the modification of a task without
              - Having to re-read the entire task to understand the context
              - Track down the why it modified
      - When did it complete (done or not) and why?
        - The goals for completion are probably in the body of the Headline
          itself so why keeping a note here? Bother because it makes it easier
          to review the completion of a task without
          - Having to re-read the entire task to understand the context
          - Track down the why it completed
    - Migration from Version 01
      - TODO \rarr no change (timestamp)
      - IN-PROGRESS \rarr GO (timestamp) (not DO because of DONE fastkey)
      - HELD-BLOCKED \rarr WAIT with note (timestamp, explanation)
      - HELD-FROZEN \rarr WAIT with note (timestamp, explanation)
      - HELD-UNTIL \rarr WAIT with note (timestamp, explanation)
      - REVIEW \rarr no change (timestamp)
      - DONE \rarr no change (timestamp, explanation)
    - Workflow cheatsheet for every state change
      - Entry related
        - =!= store a timestamp when *entered*
        - =@= store a timestamp with a note when *entered*
          - =C-c C-c= provides an empty note
      - Exit related
        - =/!= *in addition* to the state's entry configuration
          - record a timestamp when *leaving*
          - /if and only if/
            - the target state not already configure logging when entering it
      - Access related
        - =char= defines a fast-access key for the state name

#+NAME: org_gcr_2017-05-12_mara_9DE5CE12-157D-4516-9FB1-7DAFA02C571E
#+BEGIN_SRC emacs-lisp
(setq org-todo-keywords
      '((sequence
         "TODO(t!)"
         "GO(g@)"
         "WAIT(w@)"
         "BLOCKED(b@)"
         "REVIEW(r!)"
         "|"
         "DONE(d@)"
         "CANCELED(c@)"
         )))
#+END_SRC

- Reference
  - [[http://stackoverflow.com/questions/12262220/add-created-date-property-to-todos-in-org-mode][StackOverflow: Add CREATED date property to TODOs in org-mode]]
  - [[http://orgmode.org/org.html#Workflow-states][Org: 5.2.1 TODO keywords as workflow states]]
  - [[http://orgmode.org/org.html#Tracking-TODO-state-changes][5.3.2 Tracking TODO state changes]]

It is easier to understand the history of a task by reading it in chronological
order.

#+NAME: org_gcr_2017-05-12_mara_B237C004-4827-4C39-A9B9-4D0FF9B01053
#+BEGIN_SRC emacs-lisp
(setq org-log-states-order-reversed nil)
#+END_SRC

Make it easy to hide the state changes until I want to see them with a Drawer.

#+NAME: org_gcr_2017-05-12_mara_32AAD797-A7D7-416D-9CE2-425EB96781A7
#+BEGIN_SRC emacs-lisp
(setq org-log-into-drawer t)
#+END_SRC

Maintain state when archiving a heading.

#+NAME: org_gcr_2017-05-12_mara_B6F42ECC-14C0-4C60-8E00-6BBF883B3043
#+BEGIN_SRC emacs-lisp
(setq org-archive-mark-done nil)
#+END_SRC

**** Refile
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:C09D993C-6E48-4C84-8460-585F0A10DA63
:END:

