help.html
<li><a id="org4c3ffac"></a>Literate Programming<br>
<div class="outline-text-5" id="text-4-2-2-1">
<pre class="example">
ID: org_gcr_2017-05-12_mara:CD4943EE-DE3D-4B3A-AB12-525580DC8EB7
</pre>

<p>
When source blocks are evaluated, their results get stored in a result area,
typically for display. If the results are small, they are displayed with colons
instead of an <code>example</code> block. Instead, <b>always</b> place them in an
example block. This makes exports more consistent and other Org-Mode features seem
to behave more predictably.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgf4adaa1">(<span class="org-keyword">setq</span> org-babel-min-lines-for-block-output 0)
</pre>
</div>

<p>
Configure Org-Mode to manage it&rsquo;s Source-Block backed buffers the same as the
rest of this system.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgd729b8b">(<span class="org-keyword">setq</span> org-edit-src-auto-save-idle-delay 0)
(<span class="org-keyword">setq</span> org-edit-src-turn-on-auto-save nil)
</pre>
</div>

<p>
Update in-buffer images after Source-Block execution. This is a programming task.
That is why it is under this heading and Evaluation. This is a setting configuring
how the results of evaluation are refreshed in EMACS.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org6eb5caa">(<span class="org-keyword">defun</span> <span class="org-function-name">help/org-babel-after-execute-hook</span> ()
  <span class="org-doc">"HELP settings for the `</span><span class="org-doc"><span class="org-constant">org-babel-after-execute-hook</span></span><span class="org-doc">'.</span>

<span class="org-doc">This does not interfere with exports.</span>

<span class="org-doc">Attribution: URL `</span><span class="org-doc"><span class="org-constant">https://lists.gnu.org/archive/html/emacs-orgmode/2015-01/msg00534.html</span></span><span class="org-doc">'"</span>
  (<span class="org-keyword">interactive</span>)
  (org-redisplay-inline-images))

(add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">org-babel-after-execute-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/org-babel-after-execute-hook</span>)
</pre>
</div>

<p>
Never &ldquo;automatically&rdquo; evaluate a source block.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org7107f47">(<span class="org-keyword">setq</span> org-confirm-babel-evaluate nil)
</pre>
</div>

<p>
Make it unpleasant for Sysop to modify source-block outside of a source-block
backed buffer. The next step is to write some code to prevent modifying
source-blocks outside of that place.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org52e03a8">(<span class="org-keyword">setq</span> org-src-tab-acts-natively nil)
</pre>
</div>
</div>
</li>

<li><a id="org29c6e73"></a>Workflow<br>
<div class="outline-text-5" id="text-4-2-2-2">
<pre class="example">
ID: org_gcr_2017-05-12_mara:0CFAE46B-8D06-48FB-8D7E-7B636C91D443
</pre>

<ul class="org-ul">
<li>Custom TODO workflow states requirements, each answering the following questions:
<ul class="org-ul">
<li>Version 01
<ul class="org-ul">
<li>What needs to be done? TODO</li>
<li>What is being done right now? IN-PROGRESS</li>
<li>What is waiting because an external agent? HELD-BLOCKED</li>
<li>What is waiting because I have put it on hold? HELD-FROZEN</li>
<li>What is waiting until another date? (although I&rsquo;m not using the Agenda) HELD-UNTIL</li>
<li>What is complete and needs to be reviewed? REVIEW</li>
<li>What is complete? DONE</li>
</ul></li>
<li>Version 02
<ul class="org-ul">
<li>Questions about every state
<ul class="org-ul">
<li>When was it created?
<ul class="org-ul">
<li>The purpose of its creation is contained within its Headline and its
contents &ldquo;when?&rdquo; and &ldquo;why?&rdquo; aren&rsquo;t required</li>
</ul></li>
<li>When was it changed and why?
<ul class="org-ul">
<li>The reason for the change is probably in the body of the Headline so
why bother keeping a note here? Bother because it makes it easier to
review the state-change of a task because
<ul class="org-ul">
<li>It probably isn&rsquo;t worth keeping in the task long-term (it is
transient)
<ul class="org-ul">
<li>But it still matters and I want to know about it</li>
</ul></li>
<li>If it is worth keeping in the task long-term then it will be there
but
<ul class="org-ul">
<li>It makes it easier to review the modification of a task without
<ul class="org-ul">
<li>Having to re-read the entire task to understand the context</li>
<li>Track down the why it modified</li>
</ul></li>
</ul></li>
</ul></li>
</ul></li>
<li>When did it complete (done or not) and why?
<ul class="org-ul">
<li>The goals for completion are probably in the body of the Headline
itself so why keeping a note here? Bother because it makes it easier
to review the completion of a task without
<ul class="org-ul">
<li>Having to re-read the entire task to understand the context</li>
<li>Track down the why it completed</li>
</ul></li>
</ul></li>
</ul></li>
<li>Migration from Version 01
<ul class="org-ul">
<li>TODO &rarr; no change (timestamp)</li>
<li>IN-PROGRESS &rarr; GO (timestamp) (not DO because of DONE fastkey)</li>
<li>HELD-BLOCKED &rarr; WAIT with note (timestamp, explanation)</li>
<li>HELD-FROZEN &rarr; WAIT with note (timestamp, explanation)</li>
<li>HELD-UNTIL &rarr; WAIT with note (timestamp, explanation)</li>
<li>REVIEW &rarr; no change (timestamp)</li>
<li>DONE &rarr; no change (timestamp, explanation)</li>
</ul></li>
<li>Workflow cheatsheet for every state change
<ul class="org-ul">
<li>Entry related
<ul class="org-ul">
<li><code>!</code> store a timestamp when <b>entered</b></li>
<li><code>@</code> store a timestamp with a note when <b>entered</b>
<ul class="org-ul">
<li><code>C-c C-c</code> provides an empty note</li>
</ul></li>
</ul></li>
<li>Exit related
<ul class="org-ul">
<li><code>/!</code> <b>in addition</b> to the state&rsquo;s entry configuration
<ul class="org-ul">
<li>record a timestamp when <b>leaving</b></li>
<li><i>if and only if</i>
<ul class="org-ul">
<li>the target state not already configure logging when entering it</li>
</ul></li>
</ul></li>
</ul></li>
<li>Access related
<ul class="org-ul">
<li><code>char</code> defines a fast-access key for the state name</li>
</ul></li>
</ul></li>
</ul></li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgdb831ab">(<span class="org-keyword">setq</span> org-todo-keywords
      <span class="org-highlight-quoted-quote">'</span>((sequence
         <span class="org-string">"TODO(t!)"</span>
         <span class="org-string">"GO(g@)"</span>
         <span class="org-string">"WAIT(w@)"</span>
         <span class="org-string">"BLOCKED(b@)"</span>
         <span class="org-string">"REVIEW(r!)"</span>
         <span class="org-string">"|"</span>
         <span class="org-string">"DONE(d@)"</span>
         <span class="org-string">"CANCELED(c@)"</span>
         )))
</pre>
</div>

<ul class="org-ul">
<li>Reference
<ul class="org-ul">
<li><a href="http://stackoverflow.com/questions/12262220/add-created-date-property-to-todos-in-org-mode">StackOverflow: Add CREATED date property to TODOs in org-mode</a></li>
<li><a href="http://orgmode.org/org.html#Workflow-states">Org: 5.2.1 TODO keywords as workflow states</a></li>
<li><a href="http://orgmode.org/org.html#Tracking-TODO-state-changes">5.3.2 Tracking TODO state changes</a></li>
</ul></li>
</ul>

<p>
It is easier to understand the history of a task by reading it in chronological
order.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org7a9de5b">(<span class="org-keyword">setq</span> org-log-states-order-reversed nil)
</pre>
</div>

<p>
Make it easy to hide the state changes until I want to see them with a Drawer.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org8b8cbdf">(<span class="org-keyword">setq</span> org-log-into-drawer t)
</pre>
</div>

<p>
Maintain state when archiving a heading.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org1e72e6f">(<span class="org-keyword">setq</span> org-archive-mark-done nil)
</pre>
</div>
</div>
</li>

<li><a id="org025a4e0"></a>Refile<br>
<div class="outline-text-5" id="text-4-2-2-3">
<pre class="example">
ID: org_gcr_2017-05-12_mara:C09D993C-6E48-4C84-8460-585F0A10DA63
</pre>
</div>

<ol class="org-ol">
