help.html
<li><a id="org39bfc46"></a>Context<br>
<div class="outline-text-6" id="text-4-2-2-3-1">
<pre class="example">
ID: org_gcr_2017-05-12_mara:DFCC7C00-F3B3-4C35-BBE6-A5ADBB60326D
</pre>

<p>
I wrote my first to-do list on a funeral home notepad. It was either that or
it was from the furniture store. My dad worked at both. The National Selected
Morticians logo sat somewhere on its pages. There wasn&rsquo;t much for me to note
back then and the notepad worked fine. When I got a little older I graduated
to a Mead spiral notebook. I wasn&rsquo;t organized and wasted space. When you tore
out the pages they made a mess. At home we had two computers over the years an
Apple 2E and then a IBM PC compatible. Mom used PFS Write on the 2E and I used
Notepad once in a while but my usage on both games. They were at home but they
were not my home. The mad was my home until college where I made two new
friends: Composition Book (CB) and Bill Joy&rsquo;s <code>vi</code>. CB seemed like an elegant
upgrade from the Mead spiral but it didn&rsquo;t last. CB&rsquo;s lines were too tall and
the pages were too short, the worst of both worlds. The speckled black and
white covers were its most useful part which was it&rsquo;s beauty as no one would
ever have guessed. Compared to the Mead, the CB&rsquo;s were downright elegant. That
leaves <code>vi</code>. Mrs. Marian Manyo prepared a handout to help us learn <code>vi</code>. It was a
single page. <code>SunOS</code> was at a whopping version of 5.7 yet the handout left ink
on your finger suggesting that it a mimeograph instead of a Xerox that
deposited it into our awaiting writing fingers. It has seven commands that I
learned: open, close, save, close and save, insert and command mode. That
worked to store my todo list for years. This as before CVS usurped RCS so
backups were basic. My workflow had two states: existence and non-existence.
Simple. This well for another nineteen years. Until I followed the GTD
approach but in a simpler ad-hock form. Emacs was never part of my life
even when it lived next door to vi. Growing up on the cusp of beefy IDEs
living on puny desktops most schools weren&rsquo;t rooted in the tradition of LISP
and Emacs and I never joined it. Scheme got my attention though and it sucked
me into Emacs, but it didn&rsquo;t keep me. Twice I tried. Nope. Three times I tried
and at the end I liked Emacs a little bit worse. Then something funny happened:
I wanted to learn OCaml. Emacs was the only good editor for it, so I dug up
Emacs. Then I wanted to learn SML and go figure: Emacs was the only good
editor for it. The same story was retold ten or fifteen times. The proverbial
lotus kept expanding every time you touched because not only did satisfy your
ideas but it gave you new ones. Totally hooked, I am still keeping my todo
lists in ASCII text files. Then three years I heard about Org-Mode. My first
Org file had you guessed it: lists converted into headings. Oops, that wasn&rsquo;t
right so I converted them all to lists. That worked well for years. Then I got
interested in publishing and spent another year with headings and lists. A
year or so ago I got tired of my ad-hock workflow I checked if Org had a way
to deal with workflow. Of course it did! Then I got interested in tracking
state changes, and of course it had that. Beautiful. This whole story lives
here to introduce refile. When I moved headings I moved them by selecting the
whole subtree, killing it, and pasting it somewhere else. Fifteen or twenty
times I lost the heading. Sure VCS saved it but it was a hassle and a mess, a
total frustration. My error was not marking the entire subtree. Oops. When I
searched for a solution I ended up on the refile page. Of course that is how
you do it. Now <i>what</i> was the <i>it</i> that I wanted to do?
</p>
</div>
</li>

<li><a id="org149b532"></a>Desire<br>
<div class="outline-text-6" id="text-4-2-2-3-2">
<pre class="example">
ID: org_gcr_2017-05-12_mara:E2BDFB86-4DCC-41BE-9F00-BFB085E547D6
</pre>

<p>
Three or four Org-Mode files sit open in buffers for the entire year. Once in
a while there are new ones added but they usually replace one of the original
four. Exceptions are one-offs like provisioning scripts for my systems at work
or at home. Rarely a heading grows so large that it graduates to its own file.
This is by design: I refuse to pre-optimize and grow a menagerie files to
house every ever taxonomy conceivable only to end up retiring the file having
closed only a single heading.
</p>

<p>
Here is how my usage looks to me:
</p>
<ul class="org-ul">
<li>99.00% of the time I am working in the same three files
<ul class="org-ul">
<li>Refiling across subtrees at level two</li>
</ul></li>
<li>&lt;00.90% of the time I am moving headings to level zero, or the top level of the
document</li>
<li>&lt;00.09% of the time I am moving headings into a different file</li>
</ul>

<p>
My predictable and small usage makes for an easy system configuration goal
below.
</p>
</div>
</li>

<li><a id="orgb99c28c"></a>Implementation<br>
<div class="outline-text-6" id="text-4-2-2-3-3">
<pre class="example">
ID: org_gcr_2017-05-12_mara:BB186822-AFD2-4609-8CFB-DD7542E3D532
</pre>
</div>

<ol class="org-ol">
<li><a id="org887fbf6"></a>Core<br>
<div class="outline-text-7" id="text-4-2-2-3-3-1">
<pre class="example">
ID: org_gcr_2017-05-12_mara:59F948C7-2606-4637-8EF6-4922BD231A9B
</pre>

<p>
Because 99% of the time I will refile headings as sub-headings within the same
file I never need to configure <code>Refile</code> file targets in <code>org-refile-targets</code>.
Refiling at any depth makes
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org7872c43">(<span class="org-keyword">setq</span> org-refile-targets <span class="org-highlight-quoted-quote">'</span>((nil . (<span class="org-builtin">:maxlevel</span> . 10))))
(<span class="org-keyword">setq</span> org-refile-use-outline-path t)
</pre>
</div>

<p>
doing so natural, flexible and efficient
</p>

<p>
Because &lt;90% I&rsquo;m moving headings to level zero I want to
</p>
<ul class="org-ul">
<li>Make it easy when I need it which is not often</li>
<li>Make it difficult the rest of the time because I don&rsquo;t want to accidentally
move headings there. It isn&rsquo;t the end of the world I just don&rsquo;t want to do
it accidentally because I will be <i>rarely</i> doing so in the first place.</li>
<li>Single previx argument (4)</li>
</ul>

<p>
Because &lt;09% of the time I am moving headings into a new file
</p>
<ul class="org-ul">
<li>Make it as easy and a difficult as moving to the top-level</li>
<li>Prompt for the file name
<ul class="org-ul">
<li>If it does not exist <code>Org</code> will transparently create it</li>
</ul></li>
<li>Perform the move</li>
<li>Single previx argument (16)</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgdead10b">(<span class="org-keyword">defun</span> <span class="org-function-name">help/org-refile</span> (arg)
  <span class="org-doc">"Refile to /level/ in /file/ by using use /prefix args/: 2+/this/[none], 1+/this/1, 1/choose-file/2"</span>
  (<span class="org-keyword">interactive</span> <span class="org-string">"P"</span>)
  (<span class="org-keyword">cond</span>
   ((not (null arg))
    (<span class="org-keyword">let</span> ((val (car current-prefix-arg))
          (current-prefix-arg nil)
          (org-refile-use-outline-path <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">file</span>)
          (org-reverse-note-order nil))
      (<span class="org-keyword">cond</span> ((= val 4)
             (call-interactively <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">org-refile</span>))
            ((= val 16)
             (<span class="org-keyword">let*</span> ((fil (read-file-name <span class="org-string">"Enter destination file: "</span>))
                    (xfil (expand-file-name fil))
                    (_ (<span class="org-keyword">when</span> (not (file-exists-p xfil))
                         (<span class="org-keyword">with-temp-file</span> xfil (insert))))
                    (org-refile-targets
                     <span class="org-highlight-quoted-quote">`</span>((,xfil <span class="org-builtin">:maxlevel</span> . 10))))
               (<span class="org-keyword">progn</span> (call-interactively <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">org-refile</span>)
                      (find-file xfil)))))))
   (t
    (call-interactively <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">org-refile</span>))))
</pre>
</div>
</div>
</li>
