help.org
****** General Operation
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:16842F15-40C2-4E68-83F2-EBD425569FCB
:END:

- Refiles are always coming from another headline to this headline. They are
  new and need to be prioritized. When they are in front it is easy to notice
  because your eyes go there first (even know you /are/ the one refiling)
  #+NAME: org_gcr_2017-05-12_mara_29930A09-6462-4BE7-9AE2-18DC1858666C
  #+BEGIN_SRC emacs-lisp
(setq org-reverse-note-order t)
  #+END_SRC
- Select headings with the full path immediately instead of with clunky
  depth-first navigation
  #+NAME: org_gcr_2017-05-12_mara_E0E01F45-C01E-4F6E-AE8D-1B0073ECB377
  #+BEGIN_SRC emacs-lisp
(setq org-outline-path-complete-in-steps nil)
  #+END_SRC
- Create a new parent heading destination first instead of using this GUI to
  do it because it is error prone to do it in the naviation GUI despite the
  available confirmation message
  #+NAME: org_gcr_2017-05-12_mara_07650079-9AE1-4291-97A3-BCFD0628C95D
  #+BEGIN_SRC emacs-lisp
(setq org-refile-allow-creating-parent-nodes nil)
  #+END_SRC
- Track refile operations to make sense of why the =Refile= occurred in the same
  spirit of how the workflow state changes are recorded
  #+NAME: org_gcr_2017-05-12_mara_7E513EE1-3EF9-415B-BB94-2135CBFB0E74
  #+BEGIN_SRC emacs-lisp
(setq org-log-refile 'note)
  #+END_SRC

**** Properties
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:D73BDF5F-AA12-4832-9B28-CADEC71D2B6C
:END:

Select a region, yank it, maybe choose a property under the current headline
and set it's value to the killed text.

#+NAME: org_gcr_2017-05-12_mara_1F938B98-B056-4381-833C-2C9B835B1C23
#+BEGIN_SRC emacs-lisp
(defun org-read-entry-property-name ()
  "Read a property name from the current entry."
  (let ((completion-ignore-case t)
        (default-prop (or (and (org-at-property-p)
                            (org-match-string-no-properties 2))
                         org-last-set-property)))
    (org-completing-read
     (format "Property [%s]: " (if default-prop default-prop ""))
     (org-entry-properties nil nil)
     nil nil nil nil default-prop)))

(defun my-org-region-to-property (&optional property)
  "Copies the region as value to an Org-mode property"
  (interactive)
  ;; if no region is defined, do nothing
  (if (use-region-p)
      ;; if a region string is found, ask for a property and set property to
      ;; the string in the region
      (let ((val (replace-regexp-in-string
                  "\\`[ \t\n]*" ""
                  (replace-regexp-in-string "[ \t\n]*\\'" ""
                                            (substring (buffer-string)
                                                       (- (region-beginning) 1)
                                                       (region-end))))
                 )
            ;; if none was stated by user, read property from user
            (prop (or property
                     (org-read-entry-property-name))))
        ;; set property
        (org-set-property prop val))))

#+END_SRC
**** Tables
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:862B1BEA-4FAD-4FA1-8666-39E2FFA2BB4F
:END:
Essential for using tables with split windows.
#+NAME: org_gcr_2017-05-12_mara_8CE235AC-A7C4-48DF-8C97-46CC7F31CDF4
#+BEGIN_SRC emacs-lisp
(use-package org-table-sticky-header
  :ensure t
  :diminish org-table-sticky-header-mode
  :config
  (add-hook 'org-mode-hook #'org-table-sticky-header-mode))
#+END_SRC
