help.html

<li><a id="org4c756a0"></a>General Operation<br>
<div class="outline-text-7" id="text-4-2-2-3-3-2">
<pre class="example">
ID: org_gcr_2017-05-12_mara:16842F15-40C2-4E68-83F2-EBD425569FCB
</pre>

<ul class="org-ul">
<li><p>
Refiles are always coming from another headline to this headline. They are
new and need to be prioritized. When they are in front it is easy to notice
because your eyes go there first (even know you <i>are</i> the one refiling)
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org10aa688">(<span class="org-keyword">setq</span> org-reverse-note-order t)
</pre>
</div></li>
<li><p>
Select headings with the full path immediately instead of with clunky
depth-first navigation
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org7812fdc">(<span class="org-keyword">setq</span> org-outline-path-complete-in-steps nil)
</pre>
</div></li>
<li><p>
Create a new parent heading destination first instead of using this GUI to
do it because it is error prone to do it in the naviation GUI despite the
available confirmation message
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgeae0a35">(<span class="org-keyword">setq</span> org-refile-allow-creating-parent-nodes nil)
</pre>
</div></li>
<li><p>
Track refile operations to make sense of why the <code>Refile</code> occurred in the same
spirit of how the workflow state changes are recorded
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org8cbd835">(<span class="org-keyword">setq</span> org-log-refile <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">note</span>)
</pre>
</div></li>
</ul>
</div>
</li>
</ol>
</li>
</ol>
</li>

<li><a id="orga05ff16"></a>Properties<br>
<div class="outline-text-5" id="text-4-2-2-4">
<pre class="example">
ID: org_gcr_2017-05-12_mara:D73BDF5F-AA12-4832-9B28-CADEC71D2B6C
</pre>

<p>
Select a region, yank it, maybe choose a property under the current headline
and set it&rsquo;s value to the killed text.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org4c7885c">(<span class="org-keyword">defun</span> <span class="org-function-name">org-read-entry-property-name</span> ()
  <span class="org-doc">"Read a property name from the current entry."</span>
  (<span class="org-keyword">let</span> ((completion-ignore-case t)
        (default-prop (<span class="org-keyword">or</span> (<span class="org-keyword">and</span> (org-at-property-p)
                            (org-match-string-no-properties 2))
                         org-last-set-property)))
    (org-completing-read
     (format <span class="org-string">"Property [%s]: "</span> (<span class="org-keyword">if</span> default-prop default-prop <span class="org-string">""</span>))
     (org-entry-properties nil nil)
     nil nil nil nil default-prop)))

(<span class="org-keyword">defun</span> <span class="org-function-name">my-org-region-to-property</span> (<span class="org-type">&amp;optional</span> property)
  <span class="org-doc">"Copies the region as value to an Org-mode property"</span>
  (<span class="org-keyword">interactive</span>)
  <span class="org-comment-delimiter">;; </span><span class="org-comment">if no region is defined, do nothing</span>
  (<span class="org-keyword">if</span> (use-region-p)
      <span class="org-comment-delimiter">;; </span><span class="org-comment">if a region string is found, ask for a property and set property to</span>
      <span class="org-comment-delimiter">;; </span><span class="org-comment">the string in the region</span>
      (<span class="org-keyword">let</span> ((val (replace-regexp-in-string
                  <span class="org-string">"\\`[ \t\n]*"</span> <span class="org-string">""</span>
                  (replace-regexp-in-string <span class="org-string">"[ \t\n]*\\'"</span> <span class="org-string">""</span>
                                            (substring (buffer-string)
                                                       (- (region-beginning) 1)
                                                       (region-end))))
                 )
            <span class="org-comment-delimiter">;; </span><span class="org-comment">if none was stated by user, read property from user</span>
            (prop (<span class="org-keyword">or</span> property
                     (org-read-entry-property-name))))
        <span class="org-comment-delimiter">;; </span><span class="org-comment">set property</span>
        (org-set-property prop val))))

</pre>
</div>
</div>
</li>
<li><a id="orgeb236a1"></a>Tables<br>
<div class="outline-text-5" id="text-4-2-2-5">
<pre class="example">
ID: org_gcr_2017-05-12_mara:862B1BEA-4FAD-4FA1-8666-39E2FFA2BB4F
</pre>
<p>
Essential for using tables with split windows.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org8864a6c">(<span class="org-keyword">use-package</span> <span class="org-constant">org-table-sticky-header</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:diminish</span> org-table-sticky-header-mode
  <span class="org-builtin">:config</span>
  (add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">org-mode-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">org-table-sticky-header-mode</span>))
</pre>
</div>
</div>
</li>
