help.html
<li><a id="org55cbbe2"></a>Unclassified<br>
<div class="outline-text-5" id="text-4-2-2-6">
<pre class="example">
ID: org_gcr_2017-05-12_mara:FD7E89EA-72DC-4395-AE07-4CAA66B8BD28
</pre>

<p>
When running in a GUI, I would like linked images to be displayed inside of
Emacs.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org90b3b9a">(<span class="org-keyword">setq</span> org-startup-with-inline-images (display-graphic-p))
</pre>
</div>

<p>
Use Ido completion in Org-Mode.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org9964b3f">(<span class="org-keyword">setq</span> org-completion-use-ido t)
(<span class="org-keyword">setq</span> org-completion-use-iswitchb nil)
</pre>
</div>

<p>
Org-Mode lets you use single letter commands to do stuff on headers. I like to
use <code>c</code> for cycling the header expansion.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgd0dd208">(<span class="org-keyword">setq</span> org-use-speed-commands t)
</pre>
</div>

<p>
Ask before execution of shell links. This might seem like an Evaluation
activity. It is. It is interactive.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org0cdc6bd">(<span class="org-keyword">setq</span> org-confirm-shell-link-function <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">y-or-n-p</span>)
</pre>
</div>

<p>
Ask before execution of Emacs-Lisp.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgcb736a7">(<span class="org-keyword">setq</span> org-confirm-elisp-link-function <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">y-or-n-p</span>)
</pre>
</div>

<p>
Make sure that incomplete TODO entries prevent the enclosing parent from ever
turning to DONE.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org22b76de">(<span class="org-keyword">setq</span> org-enforce-todo-dependencies t)
</pre>
</div>

<p>
Allow the mouse to do Org-Mode things like expand and collapse headings.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org7771aeb">(<span class="org-keyword">when</span> (display-graphic-p)
  (<span class="org-keyword">use-package</span> <span class="org-constant">org-mouse</span>))
</pre>
</div>

<p>
Use a real ellipsis to render an ellipsis for Org-Mode stuff like showing that a
header is collapsed. <a href="http://endlessparentheses.com/changing-the-org-mode-ellipsis.html?source=rss">Artur</a> Artur go me thinking that an arrow would be more
expressive; in particular revealing that there is more content to be &ldquo;unrolled&rdquo;
below the current line.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org54aa379">(<span class="org-keyword">setq</span> org-ellipsis <span class="org-string">"&#8230;"</span>)
</pre>
</div>

<p>
It is easy to see indentation of headlines without having to count asterisks, so
don&rsquo;t show them, only show the significant and last one.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org2662c80">(<span class="org-keyword">setq</span> org-hide-leading-stars t)
</pre>
</div>

<p>
Maximize character space for writing. Do not indent according to the outline
node level because it would waste a lot of space. Ident the next body just like
any other text document.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgaa827da">(<span class="org-keyword">setq</span> org-adapt-indentation nil)
</pre>
</div>

<p>
Display emphasized text as you would in a WYSIWYG editor.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgcbb4852">(<span class="org-keyword">setq</span> org-fontify-emphasized-text t)
</pre>
</div>

<p>
Use Unicode characters to visualize things like right arrow eg &rarr; . Most of those
symbols are correctly exported to the destination format. The most obvious is
this example in LaTeX versus Text.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgb28f07c">(<span class="org-keyword">setq</span> org-pretty-entities t)
</pre>
</div>

<p>
Enable sub and super scripts <b>only</b> when wrapped in squiggly brackets.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org25d0202">(<span class="org-keyword">setq</span> org-use-sub-superscripts <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">{}</span>)
</pre>
</div>

<p>
Highlight LaTeX and related markup.
</p>

<p>
Normally, I don&rsquo;t do any syntax highlighting, as I believe that should be
delegated to source buffers, thinking that to do otherwise is distracting.
However, I already do configure subscripts and Greek letters to be displayed
with syntax highlighting, because I want to indicate to the human reader that
they are special, and specifically <i>not</i>-Unicode. Do the same thing for LaTeX
and related markup.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org1f4bc0f">(<span class="org-keyword">setq</span> org-highlight-latex-and-related <span class="org-highlight-quoted-quote">'</span>(latex script entities))
</pre>
</div>

<p>
Allow &ldquo;refactoring&rdquo; of Footnotes between documents.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgec92856">(<span class="org-keyword">setq</span> org-footnote-define-inline t)
(<span class="org-keyword">setq</span> org-footnote-auto-label <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">random</span>)
(<span class="org-keyword">setq</span> org-footnote-auto-adjust nil)
(<span class="org-keyword">setq</span> org-footnote-section nil)
</pre>
</div>

<p>
This is an amazingly easy way to screw up your document. The more you edit
org docs, the more you realize how you must truly protect it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org8d73807">(<span class="org-keyword">setq</span> org-catch-invisible-edits <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">error</span>)
</pre>
</div>

<p>
Though I am not delving deep, it is hard not to want to customize some stuff
and perhaps this is the start. Even though I enabled this, I don&rsquo;t think that I
ever used it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org140d2fc">(<span class="org-keyword">setq</span> org-loop-over-headlines-in-active-region t)
</pre>
</div>

<p>
It is <i>almost always</i> faster to work with org documents when they are fully
expanded. Anyway, the structure cycling makes it really, really easy to get an
<i>outline view</i> again.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org59340f9">(<span class="org-keyword">setq</span> org-startup-folded <span class="org-string">"nofold"</span>)
</pre>
</div>

<p>
When images are displayed in the buffer, display them in their actual size. As
the operator, I want to know their true form. Any modifications required for
export will be stated explicitly. Override this by setting
<code>#+ATTR_ORG: :width N</code> in the file.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orga72fd99">(<span class="org-keyword">setq</span> org-image-actual-width t)
</pre>
</div>

<p>
Hide the delimeter for emphasized text. Unicode characters break table
alignment.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgbcda678">(<span class="org-keyword">setq</span> org-hide-emphasis-markers t)
</pre>
</div>

<p>
Realign tables automatically.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgb9fc77d">(<span class="org-keyword">setq</span> org-startup-align-all-tables t)
</pre>
</div>

<p>
Always use Unicode checkboxes.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgbcf0f42">(<span class="org-keyword">setq</span> org-html-checkbox-type <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">unicode</span>)
</pre>
</div>

<p>
You may display syntax highlighting for code in source blocks. I don&rsquo;t.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org69406e8">(<span class="org-keyword">setq</span> org-src-fontify-natively nil)
</pre>
</div>

<p>
When edit mode is exited, the option exists to automatically remove empty
opening and closed lines for the source block. Never do this. The thing is that
I forgot why. When I was working on a recent analysis with R there was a
space appearing in the opening and closing line of the source block that didn&rsquo;t
appear in the source editing buffer. That surprised me. I am sure that I&rsquo;ve
forgotten why this is the case. I don&rsquo;t like it because you add a bunch of
empty lines in the source buffer for every source block. With that in mind I
will enable this feature and try it out again.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org1fbdb9f">(<span class="org-keyword">setq</span> org-src-strip-leading-and-trailing-blank-lines t)
</pre>
</div>

<p>
The source block buffer may be configured to appear in a few different places.
For a while I really liked <code>reorganize-frame</code> because sometimes you want to be
able to see the code you are editing in edition to the rest of the document. At
least that is what I am telling myself. Once I learned you could change it I
realized that 1 I should have asked if it could be changed and 2 I should have
changed it. The flow that I&rsquo;ve got configured here is that you are either in the
source document where code blocks are not highlighted or you are in the source
block so you are editing in a buffer that is full-fledged HELP. That is the best
way so you can focus completely on each task at hand in the ideal mode for that
task. Anything else results in distractions and errors.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgb54ba28">(<span class="org-keyword">setq</span> org-src-window-setup <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">current-window</span>)
</pre>
</div>

<p>
Org-Mode has a really nice feature that hitting <code>C-c C-c</code> will generally just do
the <i>right thing</i>. It is really nice. That feature extends to source blocks of
course. Ironically I had a typo here, typing <i>of curse</i> instead of <i>of course</i>.
The thing is that you really, really need to develop a personal workflow, and
then configure the tool to enable it. The more I learn about Org-Mode, the more
leery I am about making it really easy to evaluate code. I want it to be a
really, really specific and decided action to evaluate a code block, so don&rsquo;t
make it so easy as <code>C-c C-c</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org0a73b4d">(<span class="org-keyword">setq</span> org-babel-no-eval-on-ctrl-c-ctrl-c t)
</pre>
</div>

<p>
Configure the system to successfully use <code>vc-next-action</code> while editing a
Source-Block. Before perfoming the edit, check if it is Org-Mode and
exit the Source-Block Buffer (SBB). If this system stays in the SBB
when calling <code>vc-next-action</code> the entire contents of the buffer are escaped
as Org-Mode source code upon returning to the source buffer (this). Do the same
thing before any version control modes that would result in the same condition.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org1bb3047">(<span class="org-keyword">defun</span> <span class="org-function-name">help/vc-next-action</span> ()
  <span class="org-doc">"If in org source block, exit it before `</span><span class="org-doc"><span class="org-constant">vc-next-action</span></span><span class="org-doc">'."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">when</span> (<span class="org-keyword">condition-case</span> nil
            (org-src-edit-buffer-p)
          (<span class="org-warning">error</span> nil))
    (org-edit-src-exit))
  (vc-next-action nil))
(<span class="org-keyword">defun</span> <span class="org-function-name">help/magit-status</span> ()
  <span class="org-doc">"If in org source block, exit it before `</span><span class="org-doc"><span class="org-constant">magit-status</span></span><span class="org-doc">'."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">when</span> (<span class="org-keyword">condition-case</span> nil
            (org-src-edit-buffer-p)
          (<span class="org-warning">error</span> nil))
    (org-edit-src-exit))
  (magit-status))
</pre>
</div>

<p>
Never use the original version.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org72b6d75">(<span class="org-keyword">setq</span> org-edit-src-code nil)
</pre>
</div>

<p>
Easily wrap text in Org-Mode. This is not used by the rest of HELP because
Smartparens provides that functionality for programming modes.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgc1a5d94">(<span class="org-keyword">use-package</span> <span class="org-constant">wrap-region</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  <span class="org-builtin">:diminish</span> wrap-region-mode
  <span class="org-builtin">:config</span>
  (add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">org-mode-hook</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">wrap-region-mode</span>))
</pre>
</div>

<p>
<b>Bold</b>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgdc9dd08">(wrap-region-add-wrapper <span class="org-string">"*"</span> <span class="org-string">"*"</span> nil <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">org-mode</span>)
</pre>
</div>

<p>
<i>Italic</i>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org6af034a">(wrap-region-add-wrapper <span class="org-string">"/"</span> <span class="org-string">"/"</span> nil <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">org-mode</span>)
</pre>
</div>

<p>
<code>Verbatim</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgb71630c">(wrap-region-add-wrapper <span class="org-string">"="</span> <span class="org-string">"="</span> nil <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">org-mode</span>)
</pre>
</div>

<p>
<code>Code</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgc9e07d8">(wrap-region-add-wrapper <span class="org-string">"~"</span> <span class="org-string">"~"</span> nil <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">org-mode</span>)
</pre>
</div>

<p>
<del>Strike-Through</del>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org8cc7310">(wrap-region-add-wrapper <span class="org-string">"+"</span> <span class="org-string">"+"</span> nil <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">org-mode</span>)
</pre>
</div>

<p>
Minimize Macro text.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org61c2651">(<span class="org-keyword">setq</span> org-hide-macro-markers t)
</pre>
</div>

<p>
Follow links without using the mouse or more.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org7851d50">(<span class="org-keyword">setq</span> org-return-follows-link t)
</pre>
</div>
</div>
</li>
