help.html

<li><a id="orgb889a07"></a>Keybindings<br>
<div class="outline-text-5" id="text-4-2-2-7">
<pre class="example">
ID: org_gcr_2017-05-12_mara:F5256DB3-BD52-409B-80CF-6E601A29AA4A
</pre>

<p>
Started questioning why after hitting RETURN while in lists I have to hit TAB to
get indented properly. Kind of a dead giveaway that I should be
return-and-indenting! Looked at <code>org-return</code> to find that it has an argument
about indenting and then saw that <code>org-return-indent</code> passes it for you. With that
in mind, RETURN is bound to that now. Now HELP has four different kinds of
&ldquo;returns&rdquo; in Org in order of likelihood of usage:
</p>

<dl class="org-dl">
<dt>org-return-indent</dt><dd>Make it really easy to work in existing list items,
headings, and tables
<ul class="org-ul">
<li>This is listed first because I often go back to modify entries</li>
<li>&lt;return&gt; because it is used the most</li>
</ul></dd>
<dt>org-meta-return</dt><dd>Make it really easy to add new list items, headings, and
table contents
<ul class="org-ul">
<li>M-&lt;return&gt; because the binding comes with Org</li>
</ul></dd>
<dt>electric-indent-just-newline</dt><dd>For when I want to break out of the default
Org indentation to start working at the beginning of the line for example when
I&rsquo;m done working in a list or have just created a new heading
<ul class="org-ul">
<li>C-M-&lt;return&gt; because it is next step &ldquo;lower&rdquo; in the binding</li>
</ul></dd>
<dt>help/smart-open-line</dt><dd>When I want to insert a new line between the current
and next line then position the cursor correctly indented at the start of it.
<ul class="org-ul">
<li>s-&lt;return&gt; because it is that is the last place in the modifier key chain</li>
</ul></dd>
</dl>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org3abed9a">(<span class="org-keyword">help/not-on-gui</span>
 (define-key org-mode-map (kbd <span class="org-string">"RET"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">org-return-indent</span>)
 (define-key org-mode-map (kbd <span class="org-string">"C-M-RET"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">electric-indent-just-newline</span>))
(<span class="org-keyword">help/on-gui</span>
 (define-key org-mode-map (kbd <span class="org-string">"&lt;return&gt;"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">org-return-indent</span>)
 (define-key org-mode-map (kbd <span class="org-string">"C-M-&lt;return&gt;"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">electric-indent-just-newline</span>))
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="org84e03a7"></a>Row 5<br>
<div class="outline-text-6" id="text-4-2-2-7-1">
<pre class="example">
ID: org_gcr_2017-05-12_mara:B493B118-37D7-4C49-B300-EFBBEF91F0D6
</pre>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgae290f4">(global-set-key [(shift f6)] <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">kmacro-name-last-macro</span>)
(global-set-key [(f6)] <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">insert-kbd-macro</span>)
(global-set-key [(f5)] <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">elmacro-show-last-macro</span>)
(define-key org-mode-map (kbd <span class="org-string">"s-6"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">org-babel-load-in-session</span>)
(define-key org-mode-map (kbd <span class="org-string">"s-7"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">org-babel-switch-to-session</span>)
(define-key org-mode-map (kbd <span class="org-string">"s-8"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">org-babel-switch-to-session-with-code</span>)
(define-key org-mode-map (kbd <span class="org-string">"s-9"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">org-todo</span>)
</pre>
</div>

<p>
Easily manipulate lists and headlines staying close to home.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgc8f263d">(key-chord-define org-mode-map <span class="org-string">"U*"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">org-metaup</span>)
(key-chord-define org-mode-map <span class="org-string">"I("</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">org-metadown</span>)
(key-chord-define org-mode-map <span class="org-string">"u8"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">org-metaleft</span>)
(key-chord-define org-mode-map <span class="org-string">"i9"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">org-metaright</span>)
</pre>
</div>
</div>
</li>

<li><a id="org7b3ffdf"></a>Row 4<br>
<div class="outline-text-6" id="text-4-2-2-7-2">
<pre class="example">
ID: org_gcr_2017-05-12_mara:ADB2113A-6D9F-4145-9D78-1DDFE5A2C916
</pre>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgc7b88d8">(define-key org-mode-map (kbd <span class="org-string">"s-]"</span>) (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>)
                                       (message <span class="org-string">"Removing all source block resuls"</span>)
                                       (help/org-2every-src-block
                                        <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">org-babel-remove-result</span>)
                                       (message <span class="org-string">"Done removing all source block resuls"</span>)))
(define-key org-mode-map (kbd <span class="org-string">"s-y"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/safb-org-babel-execute-buffer</span>)
(define-key org-mode-map (kbd <span class="org-string">"s-u"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/safb-org-babel-execute-subtree</span>)
(define-key org-mode-map (kbd <span class="org-string">"s-U"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">org-mark-ring-goto</span>)
(define-key org-mode-map (kbd <span class="org-string">"s-i"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">org-babel-execute-src-block</span>)
(define-key org-mode-map (kbd <span class="org-string">"s-o"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">org-babel-remove-result</span>)
(define-key org-mode-map (kbd <span class="org-string">"s-p"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">org-babel-execute-maybe</span>)
(define-key org-mode-map (kbd <span class="org-string">"s-["</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">org-babel-remove-inline-result</span>)
(define-key org-mode-map (kbd <span class="org-string">"M-{"</span>) (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>) (insert <span class="org-string">"- [ ] "</span>)))
</pre>
</div>
</div>
</li>
