help.org
***** Row 3
     :PROPERTIES:
     :ID:       org_gcr_2017-05-12_mara:AA97F835-E969-43E4-AC84-B3CF472B8726
     :END:

#+NAME: org_gcr_2017-05-12_mara_EC7D6149-4451-443D-BFFF-1A40073D7D98
#+BEGIN_SRC emacs-lisp
(define-key org-mode-map (kbd "C-c C-k") nil)
(define-key org-mode-map (kbd "s-h") #'help/safb-org-babel-tangle)
(define-key org-mode-map (kbd "s-j") #'org-babel-next-src-block)
(define-key org-mode-map (kbd "s-k") #'org-babel-previous-src-block)
(define-key org-mode-map (kbd "s-l") #'help/safb-org-edit-src-code)
(define-key org-mode-map (kbd "s-;") #'help/safb-help/org-babel-demarcate-block)
(define-key org-mode-map (kbd "C->") #'(lambda () (interactive) (insert "\\rarr{}")))
(defun help/org-insert-subscript (arg)
  "Maybe insert a subscript with the postfix space."
  (interactive "MSubscript: ")
  (if (s-blank? arg)
      (message "Nothing to insert")
    (insert "_{" arg "} ")))
(define-key org-mode-map (kbd "s-s") #'help/org-insert-subscript)
(defun help/org-insert-superscript (arg)
  "Maybe insert a super with the postfix space."
  (interactive "MSuperscript: ")
  (if (s-blank? arg)
      (message "Nothing to insert")
    (insert "^{" arg "} ")))
(define-key org-mode-map (kbd "s-S") #'help/org-insert-superscript)
#+END_SRC

Because I only use this for Org-Mode.

#+NAME: org_gcr_2017-07-12_mara_65D0CDCC-66C7-4C81-ABF3-D22AAF71868E
#+BEGIN_SRC emacs-lisp
(define-key global-map (kbd "s-o") nil)
#+END_SRC

***** Row 2
     :PROPERTIES:
     :ID:       org_gcr_2017-05-12_mara:680824E4-2C0B-4E0F-BA6E-62AA84D484E4
     :END:

#+NAME: org_gcr_2017-05-12_mara_8C00E3FE-4AE1-49BA-97E7-FAB2784DD0A9
#+BEGIN_SRC emacs-lisp
(define-key org-mode-map (kbd "s-n") #'org-babel-view-src-block-info)
(define-key org-mode-map (kbd "s-m") #'org-babel-expand-src-block)
(define-key org-mode-map (kbd "s-,") #'org-babel-open-src-block-result)
(define-key org-mode-map (kbd "s-.") #'org-time-stamp)
#+END_SRC

Because I only use this for Org-Mode.

#+NAME: org_gcr_2017-07-12_mara_97C70CDA-DFBF-4422-942A-00E732D3AB6A
#+BEGIN_SRC emacs-lisp
(define-key global-map (kbd "s-m") nil)
#+END_SRC

***** Hydra
     :PROPERTIES:
     :ID:       org_gcr_2017-05-12_mara:08A11E45-D41A-44D6-945D-45DF85F8D037
     :END:

#+NAME: org_gcr_2017-05-12_mara_90AA8396-E8A0-439C-A1E4-373E90C4DC84
#+BEGIN_SRC emacs-lisp
(defhydra help/hydra/right-side/org-mode (:color blue
                                                 :hint nil)
  "
_1_ SHA-1-hash _2_ +imgs _3_ -imgs _4_ id-create _5_ toggle-macro
_q_ ←/w-code _w_ tbletfld _e_ g2nmrst _r_ help/org-refile _R_ g2nms-b _t_ g2s-b/hd _T_ table export format _p_ copy/property
_a_ archive-subtree _s_ sort _S_ lobigst _u_ goto _h_ dksieb _k_ ob-check-src-blk _l_ lint
_c_ org-fill-para _b_ swtch2sessn _n_ n2sbtre _m_ mark-subtree"
  ;; Row 5
  ("1" org-babel-sha1-hash)
  ("2" org-display-inline-images)
  ("3" org-remove-inline-images)
  ("4" org-id-get-create)
  ("5" help/org-toggle-macro-markers)
  ;; Row 4
  ("q" org-babel-switch-to-session-with-code)
  ("w" org-table-edit-field)
  ("W" help/org-mark-subtree/kill-ring-save)
  ("e" org-babel-goto-named-result)
  ("E" org-entities-help)
  ("r" help/org-refile)
  ("R" org-babel-goto-named-src-block)
  ("t" org-babel-goto-src-block-head)
  ("T" (lambda () (interactive) (insert "#+ATTR_HTML: :border 2 :rules all :frame border")))
  ("u" org-goto)
  ("p" my-org-region-to-property)
  ;; Row 3
  ("a" org-archive-subtree-default)
  ("s" org-sort)
  ("S" org-babel-lob-ingest)
  ("g" org-goto)
  ("h" org-babel-do-key-sequence-in-edit-buffer)
  ("H" org-babel-insert-header-arg)
  ("k" org-babel-check-src-block)
  ("l" org-lint)
  ;; Row 2
  ("c" org-fill-paragraph)
  ("b" org-babel-switch-to-session)
  ("n" org-narrow-to-subtree)
  ("m" org-mark-subtree)
  ("M" org-mark-element))
(defun help/org-mark-subtree/kill-ring-save ()
  ""
  (interactive)
  (call-interactively 'org-mark-subtree)
  (call-interactively 'kill-ring-save))
(key-chord-define org-mode-map "hh" #'help/hydra/right-side/org-mode/body)
#+END_SRC

Save all buffers before working with Exports.

#+NAME: org_gcr_2017-05-12_mara_B41A9D3F-254B-4E44-8585-380BF23D158D
#+BEGIN_SRC emacs-lisp
(define-key org-mode-map (kbd "C-c C-e") #'help/safb-org-export-dispatch)
#+END_SRC

Make =s-l= do the same thing to leave the Source-Block-Buffer.

#+NAME: org_gcr_2017-05-12_mara_5DE43FD1-AEF3-40D0-8C67-1ACBB6EA8317
#+BEGIN_SRC emacs-lisp
(define-key org-src-mode-map (kbd "s-l") #'org-edit-src-exit)
#+END_SRC

Easily enter guillemots.

#+NAME: org_gcr_2017-05-12_mara_BF73D071-57B8-4DBA-93E9-5A1D532A6321
#+BEGIN_SRC emacs-lisp
(key-chord-define org-mode-map "<<" (lambda () (interactive) (insert "\\laquo{}")))
(key-chord-define org-mode-map ">>" (lambda () (interactive) (insert "\\raquo{}")))
#+END_SRC

