help.html

<li><a id="org9070704"></a>Row 3<br>
<div class="outline-text-6" id="text-4-2-2-7-3">
<pre class="example">
ID: org_gcr_2017-05-12_mara:AA97F835-E969-43E4-AC84-B3CF472B8726
</pre>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org3d97f58">(define-key org-mode-map (kbd <span class="org-string">"C-c C-k"</span>) nil)
(define-key org-mode-map (kbd <span class="org-string">"s-h"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/safb-org-babel-tangle</span>)
(define-key org-mode-map (kbd <span class="org-string">"s-j"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">org-babel-next-src-block</span>)
(define-key org-mode-map (kbd <span class="org-string">"s-k"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">org-babel-previous-src-block</span>)
(define-key org-mode-map (kbd <span class="org-string">"s-l"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/safb-org-edit-src-code</span>)
(define-key org-mode-map (kbd <span class="org-string">"s-;"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/safb-help/org-babel-demarcate-block</span>)
(define-key org-mode-map (kbd <span class="org-string">"C-&gt;"</span>) <span class="org-highlight-quoted-quote">#'</span>(lambda () (<span class="org-keyword">interactive</span>) (insert <span class="org-string">"\\rarr{}"</span>)))
(<span class="org-keyword">defun</span> <span class="org-function-name">help/org-insert-subscript</span> (arg)
  <span class="org-doc">"Maybe insert a subscript with the postfix space."</span>
  (<span class="org-keyword">interactive</span> <span class="org-string">"MSubscript: "</span>)
  (<span class="org-keyword">if</span> (s-blank? arg)
      (message <span class="org-string">"Nothing to insert"</span>)
    (insert <span class="org-string">"_{"</span> arg <span class="org-string">"} "</span>)))
(define-key org-mode-map (kbd <span class="org-string">"s-s"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/org-insert-subscript</span>)
(<span class="org-keyword">defun</span> <span class="org-function-name">help/org-insert-superscript</span> (arg)
  <span class="org-doc">"Maybe insert a super with the postfix space."</span>
  (<span class="org-keyword">interactive</span> <span class="org-string">"MSuperscript: "</span>)
  (<span class="org-keyword">if</span> (s-blank? arg)
      (message <span class="org-string">"Nothing to insert"</span>)
    (insert <span class="org-string">"^{"</span> arg <span class="org-string">"} "</span>)))
(define-key org-mode-map (kbd <span class="org-string">"s-S"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/org-insert-superscript</span>)
</pre>
</div>

<p>
Because I only use this for Org-Mode.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org800e521">(define-key global-map (kbd <span class="org-string">"s-o"</span>) nil)
</pre>
</div>
</div>
</li>

<li><a id="org8bd4954"></a>Row 2<br>
<div class="outline-text-6" id="text-4-2-2-7-4">
<pre class="example">
ID: org_gcr_2017-05-12_mara:680824E4-2C0B-4E0F-BA6E-62AA84D484E4
</pre>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org3a24810">(define-key org-mode-map (kbd <span class="org-string">"s-n"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">org-babel-view-src-block-info</span>)
(define-key org-mode-map (kbd <span class="org-string">"s-m"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">org-babel-expand-src-block</span>)
(define-key org-mode-map (kbd <span class="org-string">"s-,"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">org-babel-open-src-block-result</span>)
(define-key org-mode-map (kbd <span class="org-string">"s-."</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">org-time-stamp</span>)
</pre>
</div>

<p>
Because I only use this for Org-Mode.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org9b8ac57">(define-key global-map (kbd <span class="org-string">"s-m"</span>) nil)
</pre>
</div>
</div>
</li>

<li><a id="org6940c02"></a>Hydra<br>
<div class="outline-text-6" id="text-4-2-2-7-5">
<pre class="example">
ID: org_gcr_2017-05-12_mara:08A11E45-D41A-44D6-945D-45DF85F8D037
</pre>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgc6e0c92">(<span class="org-keyword">defhydra</span> help/hydra/right-side/org-mode (<span class="org-builtin">:color</span> <span class="custom-1"><span class="custom">blue</span></span>
                                                 <span class="org-builtin">:hint</span> nil)
  <span class="org-doc">"</span>
<span class="org-doc">_1_ SHA-1-hash _2_ +imgs _3_ -imgs _4_ id-create _5_ toggle-macro</span>
<span class="org-doc">_q_ &#8592;/w-code _w_ tbletfld _e_ g2nmrst _r_ help/org-refile _R_ g2nms-b _t_ g2s-b/hd _T_ table export format _p_ copy/property</span>
<span class="org-doc">_a_ archive-subtree _s_ oblobigst _u_ goto _h_ dksieb _k_ ob-check-src-blk _l_ lint</span>
<span class="org-doc">_c_ org-fill-para _b_ swtch2sessn _n_ n2sbtre _m_ mark-subtree"</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Row 5</span>
  (<span class="org-string">"1"</span> org-babel-sha1-hash)
  (<span class="org-string">"2"</span> org-display-inline-images)
  (<span class="org-string">"3"</span> org-remove-inline-images)
  (<span class="org-string">"4"</span> org-id-get-create)
  (<span class="org-string">"5"</span> help/org-toggle-macro-markers)
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Row 4</span>
  (<span class="org-string">"q"</span> org-babel-switch-to-session-with-code)
  (<span class="org-string">"w"</span> org-table-edit-field)
  (<span class="org-string">"W"</span> help/org-mark-subtree/kill-ring-save)
  (<span class="org-string">"e"</span> org-babel-goto-named-result)
  (<span class="org-string">"E"</span> org-entities-help)
  (<span class="org-string">"r"</span> help/org-refile)
  (<span class="org-string">"R"</span> org-babel-goto-named-src-block)
  (<span class="org-string">"t"</span> org-babel-goto-src-block-head)
  (<span class="org-string">"T"</span> (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>) (insert <span class="org-string">"#+ATTR_HTML: :border 2 :rules all :frame border"</span>)))
  (<span class="org-string">"u"</span> org-goto)
  (<span class="org-string">"p"</span> my-org-region-to-property)
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Row 3</span>
  (<span class="org-string">"a"</span> org-archive-subtree-default)
  (<span class="org-string">"s"</span> org-babel-lob-ingest)
  (<span class="org-string">"g"</span> org-goto)
  (<span class="org-string">"h"</span> org-babel-do-key-sequence-in-edit-buffer)
  (<span class="org-string">"H"</span> org-babel-insert-header-arg)
  (<span class="org-string">"k"</span> org-babel-check-src-block)
  (<span class="org-string">"l"</span> org-lint)
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Row 2</span>
  (<span class="org-string">"c"</span> org-fill-paragraph)
  (<span class="org-string">"b"</span> org-babel-switch-to-session)
  (<span class="org-string">"n"</span> org-narrow-to-subtree)
  (<span class="org-string">"m"</span> org-mark-subtree)
  (<span class="org-string">"M"</span> org-mark-element))
(<span class="org-keyword">defun</span> <span class="org-function-name">help/org-mark-subtree/kill-ring-save</span> ()
  <span class="org-doc">""</span>
  (<span class="org-keyword">interactive</span>)
  (call-interactively <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">org-mark-subtree</span>)
  (call-interactively <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">kill-ring-save</span>))
(key-chord-define org-mode-map <span class="org-string">"hh"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/hydra/right-side/org-mode/body</span>)
</pre>
</div>

<p>
Save all buffers before working with Exports.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org05ecec1">(define-key org-mode-map (kbd <span class="org-string">"C-c C-e"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/safb-org-export-dispatch</span>)
</pre>
</div>

<p>
Make <code>s-l</code> do the same thing to leave the Source-Block-Buffer.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org8b474c9">(define-key org-src-mode-map (kbd <span class="org-string">"s-l"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">org-edit-src-exit</span>)
</pre>
</div>

<p>
Easily enter guillemots.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org9b527a8">(key-chord-define org-mode-map <span class="org-string">"&lt;&lt;"</span> (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>) (insert <span class="org-string">"\\laquo{}"</span>)))
(key-chord-define org-mode-map <span class="org-string">"&gt;&gt;"</span> (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>) (insert <span class="org-string">"\\raquo{}"</span>)))
</pre>
</div>
</div>
</li>
</ol>
</li>
</ol>
</div>
