help.org
*** Transliteration
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:D15B4305-4503-4D8C-8CDA-258FA4AF7EB2
:END:

Black board bold characters.

#+NAME: org_gcr_2017-05-12_mara_37C3019C-7C06-4952-888C-AA4660B4310E
#+BEGIN_SRC emacs-lisp
(use-package blackboard-bold-mode
  :ensure t)
#+END_SRC

Fraktur characters.

#+NAME: org_gcr_2017-05-12_mara_AF4667B6-7922-4BC4-840F-63F099E1BC63
#+BEGIN_SRC emacs-lisp
(use-package fraktur-mode
  :ensure t)
#+END_SRC

#+NAME: org_gcr_2017-05-12_mara_A27A9A2F-11B8-4B31-A68C-6A5E27BCCD8D
#+BEGIN_SRC emacs-lisp
(defhydra help/hydra/transliterate (:color blue :hint nil)
  "
_b_ black-board-bold _f_ fraktur
"
  ("b" blackboard-bold-mode)
  ("f" fraktur-mode))
#+END_SRC

*** Unicode
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:ADAE0A1B-3FD8-4605-8611-388E5ADBAFA8
:END:

Easily identify Unicode homoglyphs most often utilized by pranksters.

Good reference for Unicode character study and exploration.

Used intermittently so don't diminish it.

#+NAME: org_gcr_2017-05-12_mara_96974788-400B-439B-9005-04569A326C29
#+BEGIN_SRC emacs-lisp
(use-package unicode-troll-stopper
  :ensure t)
#+END_SRC

Easily escape and un-escape Unicode hex notation.

#+NAME: org_gcr_2017-05-12_mara_B7889E2D-2E2E-402B-BFC6-F8EC056D1F6E
#+BEGIN_SRC emacs-lisp
(use-package unicode-escape
  :ensure t
  :config)
#+END_SRC

Warn of UTF [[https://en.wikipedia.org/wiki/Byte_order_mark][BOM]] bytes via [[https://www.reddit.com/r/emacs/comments/4tw0iz/can_i_have_a_warning_if_i_open_a_file_with_utf8/d5kszsh][skeeto]].

#+BEGIN_QUOTE
The UTF-8 representation of the BOM is the byte sequence 0xEF,0xBB,0xBF.
#+END_QUOTE

Test using [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Editing-Binary-Files.html][Hexl mode]].

#+NAME: org_gcr_2017-05-12_mara_063B5AFB-C687-49D3-8FE2-3BE2BDCB8E84
#+BEGIN_SRC emacs-lisp
(defun warn-if-utf-8-bom ()
  "Warn if UTF-8 BOM bytes are present.

Attribution: URL `https://www.reddit.com/r/emacs/comments/4tw0iz/can_i_have_a_warning_if_i_open_a_file_with_utf8/d5kszsh'"
  (let ((name (symbol-name buffer-file-coding-system)))
    (when (string-match-p "utf-8-with-signature" name)
      (message "Call the BOM squad! This UTF-8 file has a BOM!"))))

(add-hook 'find-file-hook #'warn-if-utf-8-bom)
#+END_SRC

*** Content
:PROPERTIES:
:ID:       org_gcr_2017-08-04_mara:0A02BFBE-91BE-4629-B4B3-F72F2AAEAD3E
:END:
#+NAME: org_gcr_2017-08-04_mara_24E4983A-3842-4365-8C3A-8D2019AB223D
#+BEGIN_SRC emacs-lisp
(use-package lorem-ipsum
  :ensure t)
#+END_SRC
*** Dash
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:B541F7EE-BF7E-4055-9EE6-3B0AC34A1602
:END:
#+NAME: org_gcr_2017-05-12_mara_AAEBDA8A-3939-42B1-B7A2-230C43EEF1AB
#+BEGIN_SRC emacs-lisp
(use-package dash-at-point
 :ensure t)
#+END_SRC

** Applied Mathematics
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:423BA6AA-5F7D-450D-B686-78A028A37FE2
   :END:
