help.html

<div id="outline-container-orgcfa5cf8" class="outline-4">
<h4 id="orgcfa5cf8"><span class="section-number-4">4.2.3</span> Transliteration</h4>
<div class="outline-text-4" id="text-4-2-3">
<pre class="example">
ID: org_gcr_2017-05-12_mara:D15B4305-4503-4D8C-8CDA-258FA4AF7EB2
</pre>

<p>
Black board bold characters.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgb5004c0">(<span class="org-keyword">use-package</span> <span class="org-constant">blackboard-bold-mode</span>
  <span class="org-builtin">:ensure</span> t)
</pre>
</div>

<p>
Fraktur characters.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org5c3d212">(<span class="org-keyword">use-package</span> <span class="org-constant">fraktur-mode</span>
  <span class="org-builtin">:ensure</span> t)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orge36b02b">(<span class="org-keyword">defhydra</span> help/hydra/transliterate (<span class="org-builtin">:color</span> <span class="custom-2"><span class="custom-1">blue</span></span> <span class="org-builtin">:hint</span> nil)
  <span class="org-doc">"</span>
<span class="org-doc">_b_ </span><span class="custom"><span class="custom-1">black</span></span><span class="org-doc">-board-bold _f_ fraktur</span>
<span class="org-doc">"</span>
  (<span class="org-string">"b"</span> blackboard-bold-mode)
  (<span class="org-string">"f"</span> fraktur-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc4733a5" class="outline-4">
<h4 id="orgc4733a5"><span class="section-number-4">4.2.4</span> Unicode</h4>
<div class="outline-text-4" id="text-4-2-4">
<pre class="example">
ID: org_gcr_2017-05-12_mara:ADAE0A1B-3FD8-4605-8611-388E5ADBAFA8
</pre>

<p>
Easily identify Unicode homoglyphs most often utilized by pranksters.
</p>

<p>
Good reference for Unicode character study and exploration.
</p>

<p>
Used intermittently so don&rsquo;t diminish it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgd73a7d1">(<span class="org-keyword">use-package</span> <span class="org-constant">unicode-troll-stopper</span>
  <span class="org-builtin">:ensure</span> t)
</pre>
</div>

<p>
Easily escape and un-escape Unicode hex notation.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgaa8d535">(<span class="org-keyword">use-package</span> <span class="org-constant">unicode-escape</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>)
</pre>
</div>

<p>
Warn of UTF <a href="https://en.wikipedia.org/wiki/Byte_order_mark">BOM</a> bytes via <a href="https://www.reddit.com/r/emacs/comments/4tw0iz/can_i_have_a_warning_if_i_open_a_file_with_utf8/d5kszsh">skeeto</a>.
</p>

<blockquote>
<p>
The UTF-8 representation of the BOM is the byte sequence 0xEF,0xBB,0xBF.
</p>
</blockquote>

<p>
Test using <a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Editing-Binary-Files.html">Hexl mode</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org26fdc42">(<span class="org-keyword">defun</span> <span class="org-function-name">warn-if-utf-8-bom</span> ()
  <span class="org-doc">"Warn if UTF-8 BOM bytes are present.</span>

<span class="org-doc">Attribution: URL `</span><span class="org-doc"><span class="org-constant">https://www.reddit.com/r/emacs/comments/4tw0iz/can_i_have_a_warning_if_i_open_a_file_with_utf8/d5kszsh</span></span><span class="org-doc">'"</span>
  (<span class="org-keyword">let</span> ((name (symbol-name buffer-file-coding-system)))
    (<span class="org-keyword">when</span> (string-match-p <span class="org-string">"utf-8-with-signature"</span> name)
      (message <span class="org-string">"Call the BOM squad! This UTF-8 file has a BOM!"</span>))))

(add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">find-file-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">warn-if-utf-8-bom</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb4e36a8" class="outline-4">
<h4 id="orgb4e36a8"><span class="section-number-4">4.2.5</span> Content</h4>
<div class="outline-text-4" id="text-4-2-5">
<pre class="example">
ID: org_gcr_2017-08-04_mara:0A02BFBE-91BE-4629-B4B3-F72F2AAEAD3E
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orge65e2f5">(<span class="org-keyword">use-package</span> <span class="org-constant">lorem-ipsum</span>
  <span class="org-builtin">:ensure</span> t)
</pre>
</div>
</div>
</div>
<div id="outline-container-org1223bb3" class="outline-4">
<h4 id="org1223bb3"><span class="section-number-4">4.2.6</span> Dash</h4>
<div class="outline-text-4" id="text-4-2-6">
<pre class="example">
ID: org_gcr_2017-05-12_mara:B541F7EE-BF7E-4055-9EE6-3B0AC34A1602
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org5dd5320">(<span class="org-keyword">use-package</span> <span class="org-constant">dash-at-point</span>
 <span class="org-builtin">:ensure</span> t)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgbc1b5c6" class="outline-3">
<h3 id="orgbc1b5c6"><span class="section-number-3">4.3</span> Applied Mathematics</h3>
<div class="outline-text-3" id="text-4-3">
<pre class="example">
ID: org_gcr_2017-05-12_mara:423BA6AA-5F7D-450D-B686-78A028A37FE2
</pre>
</div>
