help.html
<div id="outline-container-org8ca7a76" class="outline-4">
<h4 id="org8ca7a76"><span class="section-number-4">4.3.1</span> APL</h4>
<div class="outline-text-4" id="text-4-3-1">
<pre class="example">
ID: org_gcr_2017-05-12_mara:5CB03225-60DE-4AC2-8A67-3D7D21BF7818
</pre>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgc876401">(<span class="org-keyword">use-package</span> <span class="org-constant">gnu-apl-mode</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> gnu-apl-show-keymap-on-startup nil)
  (<span class="org-keyword">setq</span> gnu-apl-show-apl-welcome nil)
  (<span class="org-keyword">setq</span> gnu-apl-show-tips-on-start nil)
  (<span class="org-keyword">setq</span> gnu-apl-mode-map-prefix <span class="org-string">"M-s-"</span>)
  (<span class="org-keyword">setq</span> gnu-apl-interactive-mode-map-prefix gnu-apl-mode-map-prefix)
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">defun</span> <span class="org-function-name">em-gnu-apl-init</span> ()
    (<span class="org-keyword">setq</span> buffer-face-mode-face <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">gnu-apl-default</span>)
    (buffer-face-mode))
  (add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">gnu-apl-interactive-mode-hook</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">em-gnu-apl-init</span>)
  (add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">gnu-apl-mode-hook</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">em-gnu-apl-init</span>)
  (<span class="org-keyword">defun</span> <span class="org-function-name">help/gnu-apl-runningp</span> ()
    (<span class="org-keyword">interactive</span>)
    (<span class="org-keyword">let</span> ((session (gnu-apl--get-interactive-session-with-nocheck)))
      (<span class="org-keyword">if</span> session <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">ON</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">OFF</span>)))
  (<span class="org-keyword">defun</span> <span class="org-function-name">help/start-gnu-apl</span> ()
    (<span class="org-keyword">interactive</span>)
    (<span class="org-keyword">if</span> (equal (help/gnu-apl-runningp) <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">ON</span>) (message <span class="org-string">"GNU APL is already ON."</span>)
      (call-interactively <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">gnu-apl</span>)))
  (<span class="org-keyword">defun</span> <span class="org-function-name">help/stop-gnu-apl</span> ()
    (<span class="org-keyword">interactive</span>)
    (<span class="org-keyword">if</span> (equal (help/gnu-apl-runningp) <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">OFF</span>) (message <span class="org-string">"GNU APL is already OFF."</span>)
      (<span class="org-keyword">progn</span>
        (gnu-apl-switch-to-interactive)
        (switch-to-buffer <span class="org-string">"*gnu-apl*"</span>)
        (insert <span class="org-string">")off"</span>)
        (comint-send-input))))
  (<span class="org-keyword">defhydra</span> help/hydra/gnu-apl (<span class="org-builtin">:color</span> <span class="custom"><span class="custom-1">blue</span></span>
                                       <span class="org-builtin">:hint</span> nil)
    <span class="org-doc">"</span>
<span class="org-doc">GNU APL is: %(help/gnu-apl-runningp)</span>
<span class="org-doc"> _y_ eval-buffer _u_ eval-region _i_ eval-line _o_ eval-function</span>
<span class="org-doc">  _f_ apropos-symbol _g_ help-symbol _h_ keyboard _j_ next _k_ previous</span>
<span class="org-doc">   _q_ quit _c_ start APL _v_ stop APL _b_ switch to APL _n_ switch back</span>
<span class="org-doc">"</span>
    (<span class="org-string">"i"</span> help/gnu-apl-eval-line)
    (<span class="org-string">"o"</span> gnu-apl-interactive-send-current-function)
    (<span class="org-string">"j"</span> (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>) (call-interactively <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">next-logical-line</span>)) <span class="org-builtin">:exit</span> nil)
    (<span class="org-string">"k"</span> (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>) (call-interactively <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">previous-logical-line</span>))
     <span class="org-builtin">:exit</span> nil)
    (<span class="org-string">"b"</span> gnu-apl-switch-to-interactive)
    (<span class="org-string">"u"</span> gnu-apl-interactive-send-region)
    (<span class="org-string">"h"</span> gnu-apl-show-keyboard)
    (<span class="org-string">"y"</span> gnu-apl-interactive-send-buffer)
    (<span class="org-string">"t"</span> gnu-apl-trace)
    (<span class="org-string">"f"</span> gnu-apl-apropos-symbol)
    (<span class="org-string">"g"</span> gnu-apl-show-help-for-symbol)
    (<span class="org-string">"c"</span> help/start-gnu-apl)
    (<span class="org-string">"v"</span> help/stop-gnu-apl)
    (<span class="org-string">"n"</span> (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>) (other-window -1)))
    (<span class="org-string">"q"</span> nil))
  (key-chord-define gnu-apl-mode-map <span class="org-string">"hh"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/hydra/gnu-apl/body</span>)
  (key-chord-define gnu-apl-interactive-mode-map <span class="org-string">"hh"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/hydra/gnu-apl/body</span>)
  (<span class="org-keyword">defun</span> <span class="org-function-name">help/gnu-apl-eval-line</span> ()
    <span class="org-doc">"Evaluate this line and move to next."</span>
    (<span class="org-keyword">interactive</span>)
    (end-of-line)
    (set-mark (line-beginning-position))
    (call-interactively <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">gnu-apl-interactive-send-region</span>)
    (deactivate-mark)
    (call-interactively <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">next-logical-line</span>))
  (define-key gnu-apl-mode-map (kbd <span class="org-string">"C-&lt;return&gt;"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/gnu-apl-eval-line</span>)
  (<span class="org-keyword">defun</span> <span class="org-function-name">help/gnu-apl-interactive-mode-hook-fn</span> ()
    (nlinum-mode)
    (rainbow-mode))
  (add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">gnu-apl-interactive-mode-hook</span>
            <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/gnu-apl-interactive-mode-hook-fn</span>)
  (add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">org-babel-load-languages</span> <span class="org-highlight-quoted-quote">'</span>(gnu-apl . t)))
</pre>
</div>
</div>
</div>
