help.org
*** Emacs Speaks Statistics (ESS)
  :PROPERTIES:
  :ID:       org_gcr_2017-05-12_mara:92D8EC6D-9E6B-482A-B100-66CD75870EF5
  :END:

#+NAME: org_gcr_2017-05-12_mara_DB3C5279-6AF3-4EAE-AC9E-F1327BBDC959
#+BEGIN_SRC emacs-lisp
(use-package ess
  :ensure t)
#+END_SRC

Display object documentation.

#+NAME: org_gcr_2017-05-12_mara_FFED1F51-DA13-4049-85AE-A228F18BD7DA
#+BEGIN_SRC emacs-lisp
(setq ess-eldoc-show-on-symbol t)
#+END_SRC

Data viewing:
- *Never* rely upon on the REPL for data viewing
  - Will mix up exploratory code with data
    - Can't easily distinguish between code and data
    - Distracting you
    - Breaking your flow
- Sometimes
  - You end up somewhere
    - And the =ess= buffer cursor is at the top!
    - No problem, call =ess-switch-to-end-of-ESS=
- Make it easier to know what object values are.
  - =ess-describe-object-at-point=

#+NAME: org_gcr_2017-05-12_mara_2B155925-39F3-4DD9-A839-2DEF151FABD7
#+BEGIN_SRC emacs-lisp
(setq ess-describe-at-point-method 'tooltip)
#+END_SRC

Always start =ess= within the curent =emacs= frame, it doesn't need to be separate.

#+NAME: org_gcr_2017-05-12_mara_2187E82C-7742-45E6-BAA8-65C6A9D97451
#+BEGIN_SRC emacs-lisp
(setq inferior-ess-same-window nil)
(setq inferior-ess-own-frame nil)
#+END_SRC

Help buffers all belong in the same frame.

#+NAME: org_gcr_2017-05-12_mara_BEA01833-63E2-43D9-A8DB-B310281E74B0
#+BEGIN_SRC emacs-lisp
(setq ess-help-own-frame nil)
#+END_SRC

When commands are executed, display their output within the current buffer,
rather than to a new dedicated buffer for them.

#+NAME: org_gcr_2017-05-12_mara_103FFDAF-2A19-476D-95AB-819DE80F7CD4
#+BEGIN_SRC emacs-lisp
(setq ess-execute-in-process-buffer t)
#+END_SRC

When you cycle between a the REPL buffer and the script, you get to the process
buffer, you will go to the end of the buffer. This setting is specifically to
handle a buffer that is scrolling when you want to see the last result and will
scroll back after the fact to see the history.

#+NAME: org_gcr_2017-05-12_mara_FB93959C-6C29-4178-8DD4-BB9B3B51C721
#+BEGIN_SRC emacs-lisp
(setq ess-switch-to-end-of-proc-buffer t)
#+END_SRC

Use typical auto completion in buffers here, but don't do it when the
next char is a symbol or closed paren.

#+NAME: org_gcr_2017-05-12_mara_D5177392-0E32-45CA-AA51-7AFCDE448A7B
#+BEGIN_SRC emacs-lisp
(setq ess-tab-complete-in-script t)
(setq ess-first-tab-never-complete 'symbol-or-paren-or-punct)
#+END_SRC

Use =ido= completion whenever possible.

#+NAME: org_gcr_2017-05-12_mara_E88B46E3-DF6C-43DB-8769-E6B6516158B4
#+BEGIN_SRC emacs-lisp
(setq ess-use-ido t)
#+END_SRC

Use =eldoc= for this mode. Always show it when the point is on a symbol.
Try to keep help strings at 10 chars or less.

#+NAME: org_gcr_2017-05-12_mara_1CD410E0-89C4-49C0-A98D-2E892DA1E3BF
#+BEGIN_SRC emacs-lisp
(setq ess-use-eldoc t)
(setq ess-eldoc-show-on-symbol t)
(setq ess-eldoc-abbreviation-style 'normal)
#+END_SRC

These functions are mentioned, and I am not sure where or how to use them yet,
but Vitalie Spinu mentioned them as being useful:

- =comint-previous-matching-input-from-input=
- =comint-history-isearch-backward-regexp=

For a while I used =ess-eval-buffer-and-go=, but now I know that it is insanely
faster to use =ess-eval-buffer= instead. Previously I've read people saying that,
and it is true.

*Philosophy*

The current =ESS= maintainers philosophies about how to maintain an R code-base
make sense to me and are virtually the same as my own. Quite simply, the rule is
that the code artifacts are the single source of system definition. Consequently,
the system should be configured in this manner:

We want to keep dump files after loading them; never delete them. The idea
is that if we use them, then they are a valid part of the system definition and
need to be kept.

#+NAME: org_gcr_2017-05-12_mara_C3F71A4F-FDB8-46E6-AC97-A66D9DDDD8DA
#+BEGIN_SRC emacs-lisp
(setq ess-keep-dump-files +1)
#+END_SRC

=ESS= allows us to quite easily modify live R objects and functions. It provides
this functionality via =ess-dump-object-into-edit-buffer=. These changes are
considered to be experimental, and not part of the master record according to
our philosophy. As such, we don't care to know that these new versions ever
existed and their record will be forgotten from history. In other words, that
new, modified version of the object or function, is never saved to a file for
later reuse.

#+NAME: org_gcr_2017-05-12_mara_B40FC7A3-BBCF-4BAF-9B6B-B37C1A3198D6
#+BEGIN_SRC emacs-lisp
(setq ess-delete-dump-files nil)
#+END_SRC

Since our systems are entirely file-based, the entirety of the system most
likely lives in different files. Before loading any file for sourcing, save
any ESS source buffers. This approach is in addition to two other things:
(1) Emacs is auto-saving every file buffer quite frequently and (2) there is
advice before every manual =eval= call so that the buffers and their files stay
in sync. Yes, it is really that important.

#+NAME: org_gcr_2017-05-12_mara_BFF312BF-65F2-4C4E-8D6B-E263DF062CB3
#+BEGIN_SRC emacs-lisp
(setq ess-mode-silently-save +1)
#+END_SRC

=ESS= executes code in another process. That is no secret. When displaying output
from that code running in another process though, it can look like Emacs is
locking up. That is not the case: https://stackoverflow.com/questions/2770523/how-can-i-background-the-r-process-in-ess-emacs.
What is happening that Emacs is waiting for the output. Configure this mode to
continue to accept user input, which is obviously critical, but don't wait for
the process to provide its output. Instead, all output is printed after the last
input lines. What we gain is perceived speed, and what we lose is the nice
sequential this/that/this/that we get from a typical REPL interaction. As I
write this, I'm not totally sure how this will work, but the documentation and
post are consistent and describe what I had wanted here so I will give it a try
and see how it goes.

#+NAME: org_gcr_2017-05-12_mara_AE35E686-32C2-4E74-B80B-68913DAE3887
#+BEGIN_SRC emacs-lisp
(setq ess-eval-visibly 'nowait)
#+END_SRC

