help.html

<div id="outline-container-org0f7be35" class="outline-4">
<h4 id="org0f7be35"><span class="section-number-4">4.3.2</span> Emacs Speaks Statistics (ESS)</h4>
<div class="outline-text-4" id="text-4-3-2">
<pre class="example">
ID: org_gcr_2017-05-12_mara:92D8EC6D-9E6B-482A-B100-66CD75870EF5
</pre>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org3b05c78">(<span class="org-keyword">use-package</span> <span class="org-constant">ess</span>
  <span class="org-builtin">:ensure</span> t)
</pre>
</div>

<p>
Display object documentation.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org80d4485">(<span class="org-keyword">setq</span> ess-eldoc-show-on-symbol t)
</pre>
</div>

<p>
Data viewing:
</p>
<ul class="org-ul">
<li><b>Never</b> rely upon on the REPL for data viewing
<ul class="org-ul">
<li>Will mix up exploratory code with data
<ul class="org-ul">
<li>Can&rsquo;t easily distinguish between code and data</li>
<li>Distracting you</li>
<li>Breaking your flow</li>
</ul></li>
</ul></li>
<li>Sometimes
<ul class="org-ul">
<li>You end up somewhere
<ul class="org-ul">
<li>And the <code>ess</code> buffer cursor is at the top!</li>
<li>No problem, call <code>ess-switch-to-end-of-ESS</code></li>
</ul></li>
</ul></li>
<li>Make it easier to know what object values are.
<ul class="org-ul">
<li><code>ess-describe-object-at-point</code></li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgf6f99b4">(<span class="org-keyword">setq</span> ess-describe-at-point-method <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">tooltip</span>)
</pre>
</div>

<p>
Always start <code>ess</code> within the curent <code>emacs</code> frame, it doesn&rsquo;t need to be separate.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org981bd76">(<span class="org-keyword">setq</span> inferior-ess-same-window nil)
(<span class="org-keyword">setq</span> inferior-ess-own-frame nil)
</pre>
</div>

<p>
Help buffers all belong in the same frame.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgac41925">(<span class="org-keyword">setq</span> ess-help-own-frame nil)
</pre>
</div>

<p>
When commands are executed, display their output within the current buffer,
rather than to a new dedicated buffer for them.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgaf91139">(<span class="org-keyword">setq</span> ess-execute-in-process-buffer t)
</pre>
</div>

<p>
When you cycle between a the REPL buffer and the script, you get to the process
buffer, you will go to the end of the buffer. This setting is specifically to
handle a buffer that is scrolling when you want to see the last result and will
scroll back after the fact to see the history.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org5ce7c36">(<span class="org-keyword">setq</span> ess-switch-to-end-of-proc-buffer t)
</pre>
</div>

<p>
Use typical auto completion in buffers here, but don&rsquo;t do it when the
next char is a symbol or closed paren.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org54880df">(<span class="org-keyword">setq</span> ess-tab-complete-in-script t)
(<span class="org-keyword">setq</span> ess-first-tab-never-complete <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">symbol-or-paren-or-punct</span>)
</pre>
</div>

<p>
Use <code>ido</code> completion whenever possible.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org04b596b">(<span class="org-keyword">setq</span> ess-use-ido t)
</pre>
</div>

<p>
Use <code>eldoc</code> for this mode. Always show it when the point is on a symbol.
Try to keep help strings at 10 chars or less.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org05d3c10">(<span class="org-keyword">setq</span> ess-use-eldoc t)
(<span class="org-keyword">setq</span> ess-eldoc-show-on-symbol t)
(<span class="org-keyword">setq</span> ess-eldoc-abbreviation-style <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">normal</span>)
</pre>
</div>

<p>
These functions are mentioned, and I am not sure where or how to use them yet,
but Vitalie Spinu mentioned them as being useful:
</p>

<ul class="org-ul">
<li><code>comint-previous-matching-input-from-input</code></li>
<li><code>comint-history-isearch-backward-regexp</code></li>
</ul>

<p>
For a while I used <code>ess-eval-buffer-and-go</code>, but now I know that it is insanely
faster to use <code>ess-eval-buffer</code> instead. Previously I&rsquo;ve read people saying that,
and it is true.
</p>

<p>
<b>Philosophy</b>
</p>

<p>
The current <code>ESS</code> maintainers philosophies about how to maintain an R code-base
make sense to me and are virtually the same as my own. Quite simply, the rule is
that the code artifacts are the single source of system definition. Consequently,
the system should be configured in this manner:
</p>

<p>
We want to keep dump files after loading them; never delete them. The idea
is that if we use them, then they are a valid part of the system definition and
need to be kept.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org1f6f43c">(<span class="org-keyword">setq</span> ess-keep-dump-files +1)
</pre>
</div>

<p>
<code>ESS</code> allows us to quite easily modify live R objects and functions. It provides
this functionality via <code>ess-dump-object-into-edit-buffer</code>. These changes are
considered to be experimental, and not part of the master record according to
our philosophy. As such, we don&rsquo;t care to know that these new versions ever
existed and their record will be forgotten from history. In other words, that
new, modified version of the object or function, is never saved to a file for
later reuse.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgb630886">(<span class="org-keyword">setq</span> ess-delete-dump-files nil)
</pre>
</div>

<p>
Since our systems are entirely file-based, the entirety of the system most
likely lives in different files. Before loading any file for sourcing, save
any ESS source buffers. This approach is in addition to two other things:
(1) Emacs is auto-saving every file buffer quite frequently and (2) there is
advice before every manual <code>eval</code> call so that the buffers and their files stay
in sync. Yes, it is really that important.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgf4a2b64">(<span class="org-keyword">setq</span> ess-mode-silently-save +1)
</pre>
</div>

<p>
<code>ESS</code> executes code in another process. That is no secret. When displaying output
from that code running in another process though, it can look like Emacs is
locking up. That is not the case: <a href="https://stackoverflow.com/questions/2770523/how-can-i-background-the-r-process-in-ess-emacs">https://stackoverflow.com/questions/2770523/how-can-i-background-the-r-process-in-ess-emacs</a>.
What is happening that Emacs is waiting for the output. Configure this mode to
continue to accept user input, which is obviously critical, but don&rsquo;t wait for
the process to provide its output. Instead, all output is printed after the last
input lines. What we gain is perceived speed, and what we lose is the nice
sequential this/that/this/that we get from a typical REPL interaction. As I
write this, I&rsquo;m not totally sure how this will work, but the documentation and
post are consistent and describe what I had wanted here so I will give it a try
and see how it goes.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org9155d13">(<span class="org-keyword">setq</span> ess-eval-visibly <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">nowait</span>)
</pre>
</div>
</div>
</div>
