help.org
*** R (ESS)
  :PROPERTIES:
  :ID:       org_gcr_2017-05-12_mara:6AE60368-3D9F-400D-AAEC-A9B99F5CE480
  :END:

Enable a debugger.

#+NAME: org_gcr_2017-05-12_mara_3E9EA300-0CB2-4A98-A197-F45F7A5176D7
#+BEGIN_SRC emacs-lisp
(setq ess-use-tracebug t)
#+END_SRC

Configure debugger search path per-project.

#+NAME: org_gcr_2017-05-12_mara_DB26721B-A854-403D-BC8E-634F300AC859
#+BEGIN_SRC emacs-lisp
(setq ess-tracebug-search-path '())
#+END_SRC

Easily nevigate errors.

#+NAME: org_gcr_2017-05-12_mara_7C1845A7-2AE7-4B5E-8BF6-9F4D657446C8
#+BEGIN_SRC emacs-lisp
(define-key compilation-minor-mode-map [(?n)] #'next-error-no-select)
(define-key compilation-minor-mode-map [(?p)] #'previous-error-no-select)
#+END_SRC

Diminish watched variable font-size.

#+NAME: org_gcr_2017-05-12_mara_EF3B0A0A-2892-422F-A6F5-88CD33D04EAE
#+BEGIN_SRC emacs-lisp
(setq ess-watch-scale-amount -1)
#+END_SRC

When =ess= starts, or when R starts, it takes the current directory as its
working directory. This is totally fine; so don't ask what the working directory
should be.

#+NAME: org_gcr_2017-05-12_mara_4BCA5828-00AF-4D43-8153-5F9288FA669D
#+BEGIN_SRC emacs-lisp
(setq ess-ask-for-ess-directory nil)
#+END_SRC

My preference is for ESS to quit and not ask me whether or not I am sure. There
is an intentional line-break after the closing round bracket because that is the
approach of the original value here.

#+NAME: org_gcr_2017-05-12_mara_07110829-1986-4799-8E64-5A0BD8E09527
#+BEGIN_SRC emacs-lisp
(setq inferior-ess-exit-command "q('no')
")
#+END_SRC

Visualize just about anything with ~ess-R-object-popup~.

#+NAME: org_gcr_2017-05-12_mara_88C6413B-4F5B-4D81-BCA0-F4B385198724
#+BEGIN_SRC emacs-lisp
(use-package ess-R-object-popup
  :ensure t)
#+END_SRC

Rdired is another way to work with object:
- =ess-rdired=
- View, delete, plot, and update buffer (ala /revert/) are single key commands

#+NAME: org_gcr_2017-05-12_mara_B21C0C45-E1FB-4834-9FFD-DA57ABB1D6B7
#+BEGIN_SRC emacs-lisp
(autoload 'ess-rdired "ess-rdired")
#+END_SRC

Visualize data frames better:
- =ess-R-dv-ctable=
- =ess-R-dv-pprint=

#+NAME: org_gcr_2017-05-12_mara_0DE5790A-DDF5-4A42-A5EF-EE6AA1841913
#+BEGIN_SRC emacs-lisp
(use-package ess-R-data-view
  :ensure t)
#+END_SRC

inlineR
- /Not/ a competitor to =org-mode=
- Ultra lightweight LP, really

#+NAME: org_gcr_2017-05-12_mara_7C1735F9-2E77-433A-8A6C-DDA2F915AD6E
#+BEGIN_SRC emacs-lisp
(use-package inlineR
  :ensure t)
#+END_SRC

Documentation:
- Whole section on native documentation; I'll re-visit as needed.
- Roxygen, too.

=ess-developer= helps you to easily work within specific name-spaces.

Store history files and dump files in a single known location. If that location
doesn't exist, then make it.

#+NAME: org_gcr_2017-05-12_mara_208F3A57-5958-4B6B-BB9B-84EF13641A2E
#+BEGIN_SRC emacs-lisp
(setq help/r-dir "~/.R/")
(defun help/make-warn-R-dir ()
  "Handle of R directory misconfiguration."
  (interactive)
  (unless (f-directory? help/r-dir)
    (progn
      (message "Couldn't find %S… creating it." help/r-dir)
      (f-mkdir help/r-dir))))
(help/make-warn-R-dir)
(setq ess-history-directory help/r-dir)
(setq ess-source-directory help/r-dir)
#+END_SRC

Since I'm using R for everything, configure /everything/ to be using R.

#+NAME: org_gcr_2017-05-12_mara_05252C70-8257-4A7A-BB03-9C5358DCDF6B
#+BEGIN_SRC emacs-lisp
(setq inferior-ess-program "R")
(setq inferior-R-program-name "R")
(setq ess-local-process-name "R")
#+END_SRC

Handle rdoc and rmd files, though I have never used them... yet.

#+NAME: org_gcr_2017-05-12_mara_D1D3EE95-CC1D-4F12-9C50-44436CF7AAC8
#+BEGIN_SRC emacs-lisp
(add-to-list 'auto-mode-alist '("\\.rd\\'" . Rd-mode))
(add-to-list 'auto-mode-alist '("\\.Rmd$" . r-mode))
#+END_SRC

Make it really easy to search the R archives for anything.

#+NAME: org_gcr_2017-05-12_mara_9257DFB5-371B-4A1C-8654-931151FBE3C3
#+BEGIN_SRC emacs-lisp
(local-set-key (kbd "C-c C-. S") #'ess-rutils-rsitesearch)
#+END_SRC

Make it really easy to do common stuff for R with good keybindings.

#+NAME: org_gcr_2017-05-12_mara_D5290242-1B88-44F2-B387-C1EFC2B308C7
#+BEGIN_SRC emacs-lisp
(use-package ess-rutils
  :config
  (setq ess-rutils-keys t))
#+END_SRC

=r-autoyas= does argument completion. I had it working nice, and didn't use it for
a while, and now it doesn't work. This needs some TLC.

#+NAME: org_gcr_2017-05-12_mara_68A29F8E-1516-4524-91EA-552EBD8EFBAE
#+BEGIN_SRC emacs-lisp
(use-package r-autoyas
  :ensure t
  :config
  (setq r-autoyas-debug t)
  (setq r-autoyas-expand-package-functions-only nil)
  (setq r-autoyas-remove-explicit-assignments nil))
#+END_SRC

Save two spaces showing function information in the mini-buffer.

#+NAME: org_gcr_2017-05-12_mara_9B83F15B-249D-4B62-B929-E0AFADEA44C4
#+BEGIN_SRC emacs-lisp
(setq ess-R-argument-suffix "=")
#+END_SRC

Don't use the default assignment binding and allow underscores in names.

#+NAME: org_gcr_2017-05-12_mara_660E257F-4F4C-4235-A52F-6BDD62206288
#+BEGIN_SRC emacs-lisp
(setq ess-S-assign-key (kbd "C-<"))
(ess-toggle-S-assign-key t)
(ess-toggle-underscore nil)
#+END_SRC

Don't save the workspace when you quit R and don't restore *ANYTHING* when you
start it, either. This adheres to the philosopy that the system is file based.

#+NAME: org_gcr_2017-05-12_mara_F9AC8C22-E36D-4956-98AC-45AA00C2BFCC
#+BEGIN_SRC emacs-lisp
(setq inferior-R-args "--no-save --no-restore")
#+END_SRC

R mode hook.

#+NAME: org_gcr_2017-05-12_mara_CF490053-BBAA-4BDC-86CE-DB0E7A02A81B
#+BEGIN_SRC emacs-lisp
(defun help/R-mode-hook-fn ()
  (local-set-key (kbd "s-6") #'ess-switch-to-end-of-ESS)
  (local-set-key (kbd "s-7") #'ess-rdired)
  (local-set-key (kbd "s-8") #'ess-R-dv-ctable)
  (local-set-key (kbd "s-9") #'ess-R-dv-pprint)
  (local-set-key (kbd "s-y") #'r-autoyas-expand)
  (local-set-key (kbd "s-o") #'ess-describe-object-at-point)
  (local-set-key (kbd "s-p") #'ess-R-object-popup)
  (local-set-key (kbd "C->") #'(lambda () (interactive) (insert " -> ")))
  (key-chord-define-local "<<" #'(lambda () (interactive) (insert " <<- ")))
  (key-chord-define-local ">>" #'(lambda () (interactive) (insert " ->> ")))
  (key-chord-define-local "<>" #'(lambda () (interactive) (insert " %<>% ")))
  (local-set-key (kbd "s-.") #'(lambda () (interactive) (insert " %>% ")))
  (r-autoyas-ess-activate)
  (help/turn-on-r-hide-show)
  (lambda () (add-hook 'ess-presend-filter-functions
                  (lambda ()
                    (warn
                     "ESS now supports a standard pre-send filter hook. Please update your configuration to use it instead of using advice."))))
  (ess-set-style 'RRR))

(add-hook 'R-mode-hook #'help/R-mode-hook-fn)

(defun help/turn-on-r-hide-show ()
"Attribution: URL https://github.com/mlf176f2/EmacsMate/blob/master/EmacsMate-ess.org"
  (when (string= "S" ess-language)
    (set (make-local-variable 'hs-special-modes-alist) #'((ess-mode "{" "}" "#" nil nil)))
    (hs-minor-mode 1)
    (when (fboundp 'foldit-mode)
      (foldit-mode 1))
    (when (fboundp 'fold-dwim-org/minor-mode)
      (fold-dwim-org/minor-mode))))

(defun help/Rd-mode-hook-fn ()
  (help/R-mode-hook-fn))

(add-hook 'Rd-mode-hook #'help/Rd-mode-hook-fn)

(defun help/inferior-ess-mode-hook-fn ()
  (help/R-mode-hook-fn))

(add-hook 'inferior-ess-mode-hook #'help/inferior-ess-mode-hook-fn)

(defun help/ess-rdired-mode-hook-fn ()
  "Personal customizations."
  (interactive)
  (turn-on-stripe-buffer-mode)
  (stripe-listify-buffer))

(add-hook 'ess-rdired-mode-hook #'help/ess-rdired-mode-hook-fn)
#+END_SRC

