help.html

<div id="outline-container-orgea2e14a" class="outline-4">
<h4 id="orgea2e14a"><span class="section-number-4">4.3.3</span> R (ESS)</h4>
<div class="outline-text-4" id="text-4-3-3">
<pre class="example">
ID: org_gcr_2017-05-12_mara:6AE60368-3D9F-400D-AAEC-A9B99F5CE480
</pre>

<p>
Enable a debugger.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orge412a7c">(<span class="org-keyword">setq</span> ess-use-tracebug t)
</pre>
</div>

<p>
Configure debugger search path per-project.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgb0b21ee">(<span class="org-keyword">setq</span> ess-tracebug-search-path <span class="org-highlight-quoted-quote">'</span>())
</pre>
</div>

<p>
Easily nevigate errors.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org48a6851">(define-key compilation-minor-mode-map [(?n)] <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">next-error-no-select</span>)
(define-key compilation-minor-mode-map [(?p)] <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">previous-error-no-select</span>)
</pre>
</div>

<p>
Diminish watched variable font-size.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org7f8193a">(<span class="org-keyword">setq</span> ess-watch-scale-amount -1)
</pre>
</div>

<p>
When <code>ess</code> starts, or when R starts, it takes the current directory as its
working directory. This is totally fine; so don&rsquo;t ask what the working directory
should be.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org248c641">(<span class="org-keyword">setq</span> ess-ask-for-ess-directory nil)
</pre>
</div>

<p>
My preference is for ESS to quit and not ask me whether or not I am sure. There
is an intentional line-break after the closing round bracket because that is the
approach of the original value here.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgdd9c8c9">(<span class="org-keyword">setq</span> inferior-ess-exit-command <span class="org-string">"q('no')</span>
<span class="org-string">"</span>)
</pre>
</div>

<p>
Visualize just about anything with <code>ess-R-object-popup</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org51751b9">(<span class="org-keyword">use-package</span> <span class="org-constant">ess-R-object-popup</span>
  <span class="org-builtin">:ensure</span> t)
</pre>
</div>

<p>
Rdired is another way to work with object:
</p>
<ul class="org-ul">
<li><code>ess-rdired</code></li>
<li>View, delete, plot, and update buffer (ala <i>revert</i>) are single key commands</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgcd03b68">(autoload <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">ess-rdired</span> <span class="org-string">"ess-rdired"</span>)
</pre>
</div>

<p>
Visualize data frames better:
</p>
<ul class="org-ul">
<li><code>ess-R-dv-ctable</code></li>
<li><code>ess-R-dv-pprint</code></li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org545e6f2">(<span class="org-keyword">use-package</span> <span class="org-constant">ess-R-data-view</span>
  <span class="org-builtin">:ensure</span> t)
</pre>
</div>

<p>
inlineR
</p>
<ul class="org-ul">
<li><i>Not</i> a competitor to <code>org-mode</code></li>
<li>Ultra lightweight LP, really</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgaa59ee1">(<span class="org-keyword">use-package</span> <span class="org-constant">inlineR</span>
  <span class="org-builtin">:ensure</span> t)
</pre>
</div>

<p>
Documentation:
</p>
<ul class="org-ul">
<li>Whole section on native documentation; I&rsquo;ll re-visit as needed.</li>
<li>Roxygen, too.</li>
</ul>

<p>
<code>ess-developer</code> helps you to easily work within specific name-spaces.
</p>

<p>
Store history files and dump files in a single known location. If that location
doesn&rsquo;t exist, then make it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org1df711b">(<span class="org-keyword">setq</span> help/r-dir <span class="org-string">"~/.R/"</span>)
(<span class="org-keyword">defun</span> <span class="org-function-name">help/make-warn-R-dir</span> ()
  <span class="org-doc">"Handle of R directory misconfiguration."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">unless</span> (f-directory? help/r-dir)
    (<span class="org-keyword">progn</span>
      (message <span class="org-string">"Couldn't find %S&#8230; creating it."</span> help/r-dir)
      (f-mkdir help/r-dir))))
(help/make-warn-R-dir)
(<span class="org-keyword">setq</span> ess-history-directory help/r-dir)
(<span class="org-keyword">setq</span> ess-source-directory help/r-dir)
</pre>
</div>

<p>
Since I&rsquo;m using R for everything, configure <i>everything</i> to be using R.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org0cebcfa">(<span class="org-keyword">setq</span> inferior-ess-program <span class="org-string">"R"</span>)
(<span class="org-keyword">setq</span> inferior-R-program-name <span class="org-string">"R"</span>)
(<span class="org-keyword">setq</span> ess-local-process-name <span class="org-string">"R"</span>)
</pre>
</div>

<p>
Handle rdoc and rmd files, though I have never used them&#x2026; yet.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org3cc6399">(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">auto-mode-alist</span> <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">"\\.rd\\'"</span> . Rd-mode))
(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">auto-mode-alist</span> <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">"\\.Rmd$"</span> . r-mode))
</pre>
</div>

<p>
Make it really easy to search the R archives for anything.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org4a6d299">(local-set-key (kbd <span class="org-string">"C-c C-. S"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">ess-rutils-rsitesearch</span>)
</pre>
</div>

<p>
Make it really easy to do common stuff for R with good keybindings.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org419181d">(<span class="org-keyword">use-package</span> <span class="org-constant">ess-rutils</span>
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">setq</span> ess-rutils-keys t))
</pre>
</div>

<p>
<code>r-autoyas</code> does argument completion. I had it working nice, and didn&rsquo;t use it for
a while, and now it doesn&rsquo;t work. This needs some TLC.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgf98f6d8">(<span class="org-keyword">use-package</span> <span class="org-constant">r-autoyas</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">setq</span> r-autoyas-debug t)
  (<span class="org-keyword">setq</span> r-autoyas-expand-package-functions-only nil)
  (<span class="org-keyword">setq</span> r-autoyas-remove-explicit-assignments nil))
</pre>
</div>

<p>
Save two spaces showing function information in the mini-buffer.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgc383a58">(<span class="org-keyword">setq</span> ess-R-argument-suffix <span class="org-string">"="</span>)
</pre>
</div>

<p>
Don&rsquo;t use the default assignment binding and allow underscores in names.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org43b7a70">(<span class="org-keyword">setq</span> ess-S-assign-key (kbd <span class="org-string">"C-&lt;"</span>))
(ess-toggle-S-assign-key t)
(ess-toggle-underscore nil)
</pre>
</div>

<p>
Don&rsquo;t save the workspace when you quit R and don&rsquo;t restore <b>ANYTHING</b> when you
start it, either. This adheres to the philosopy that the system is file based.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org0ed7a64">(<span class="org-keyword">setq</span> inferior-R-args <span class="org-string">"--no-save --no-restore"</span>)
</pre>
</div>

<p>
R mode hook.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org2a449f3">(<span class="org-keyword">defun</span> <span class="org-function-name">help/R-mode-hook-fn</span> ()
  (local-set-key (kbd <span class="org-string">"s-6"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">ess-switch-to-end-of-ESS</span>)
  (local-set-key (kbd <span class="org-string">"s-7"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">ess-rdired</span>)
  (local-set-key (kbd <span class="org-string">"s-8"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">ess-R-dv-ctable</span>)
  (local-set-key (kbd <span class="org-string">"s-9"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">ess-R-dv-pprint</span>)
  (local-set-key (kbd <span class="org-string">"s-y"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">r-autoyas-expand</span>)
  (local-set-key (kbd <span class="org-string">"s-o"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">ess-describe-object-at-point</span>)
  (local-set-key (kbd <span class="org-string">"s-p"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">ess-R-object-popup</span>)
  (local-set-key (kbd <span class="org-string">"C-&gt;"</span>) <span class="org-highlight-quoted-quote">#'</span>(lambda () (<span class="org-keyword">interactive</span>) (insert <span class="org-string">" -&gt; "</span>)))
  (key-chord-define-local <span class="org-string">"&lt;&lt;"</span> <span class="org-highlight-quoted-quote">#'</span>(lambda () (<span class="org-keyword">interactive</span>) (insert <span class="org-string">" &lt;&lt;- "</span>)))
  (key-chord-define-local <span class="org-string">"&gt;&gt;"</span> <span class="org-highlight-quoted-quote">#'</span>(lambda () (<span class="org-keyword">interactive</span>) (insert <span class="org-string">" -&gt;&gt; "</span>)))
  (key-chord-define-local <span class="org-string">"&lt;&gt;"</span> <span class="org-highlight-quoted-quote">#'</span>(lambda () (<span class="org-keyword">interactive</span>) (insert <span class="org-string">" %&lt;&gt;% "</span>)))
  (local-set-key (kbd <span class="org-string">"s-."</span>) <span class="org-highlight-quoted-quote">#'</span>(lambda () (<span class="org-keyword">interactive</span>) (insert <span class="org-string">" %&gt;% "</span>)))
  (r-autoyas-ess-activate)
  (help/turn-on-r-hide-show)
  (<span class="org-keyword">lambda</span> () (add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">ess-presend-filter-functions</span>
                  (<span class="org-keyword">lambda</span> ()
                    (<span class="org-warning">warn</span>
                     <span class="org-string">"ESS now supports a standard pre-send filter hook. Please update your configuration to use it instead of using advice."</span>))))
  (ess-set-style <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">RRR</span>))

(add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">R-mode-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/R-mode-hook-fn</span>)

(<span class="org-keyword">defun</span> <span class="org-function-name">help/turn-on-r-hide-show</span> ()
<span class="org-doc">"Attribution: URL https://github.com/mlf176f2/EmacsMate/blob/master/EmacsMate-ess.org"</span>
  (<span class="org-keyword">when</span> (string= <span class="org-string">"S"</span> ess-language)
    (set (make-local-variable <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">hs-special-modes-alist</span>) <span class="org-highlight-quoted-quote">#'</span>((ess-mode <span class="org-string">"{"</span> <span class="org-string">"}"</span> <span class="org-string">"#"</span> nil nil)))
    (hs-minor-mode 1)
    (<span class="org-keyword">when</span> (fboundp <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">foldit-mode</span>)
      (foldit-mode 1))
    (<span class="org-keyword">when</span> (fboundp <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">fold-dwim-org/minor-mode</span>)
      (fold-dwim-org/minor-mode))))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/Rd-mode-hook-fn</span> ()
  (help/R-mode-hook-fn))

(add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">Rd-mode-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/Rd-mode-hook-fn</span>)

(<span class="org-keyword">defun</span> <span class="org-function-name">help/inferior-ess-mode-hook-fn</span> ()
  (help/R-mode-hook-fn))

(add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">inferior-ess-mode-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/inferior-ess-mode-hook-fn</span>)

(<span class="org-keyword">defun</span> <span class="org-function-name">help/ess-rdired-mode-hook-fn</span> ()
  <span class="org-doc">"Personal customizations."</span>
  (<span class="org-keyword">interactive</span>)
  (turn-on-stripe-buffer-mode)
  (stripe-listify-buffer))

(add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">ess-rdired-mode-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/ess-rdired-mode-hook-fn</span>)
</pre>
</div>
</div>
</div>
