help.org
*** Scheme
  :PROPERTIES:
  :ID:       org_gcr_2017-05-12_mara:80DF94ED-4868-47CE-BAC8-978863BEF5AF
  :END:

File extensions:
- Traditional.
  #+NAME: org_gcr_2017-05-12_mara_CC727094-99D3-4C48-BE27-C28FC738DF34
  #+BEGIN_SRC emacs-lisp
(add-to-list 'auto-mode-alist '("\\.scm\\'" . scheme-mode))
(add-to-list 'auto-mode-alist '("\\.ss\\'" . scheme-mode))
  #+END_SRC
- R6RS.
  #+NAME: org_gcr_2017-05-12_mara_998AB8A6-A934-4E5A-B869-E1348D919529
  #+BEGIN_SRC emacs-lisp
(add-to-list 'auto-mode-alist '("\\.sls\\'" . scheme-mode))
(add-to-list 'auto-mode-alist '("\\.sps\\'" . scheme-mode))
  #+END_SRC
- Racket.
  #+NAME: org_gcr_2017-05-12_mara_A80E9E8F-A5B7-4C48-A3E5-2C365178EFAF
  #+BEGIN_SRC emacs-lisp
(add-to-list 'auto-mode-alist '("\\.rkt\\'" . scheme-mode))
  #+END_SRC

Scheme.

#+NAME: org_gcr_2017-07-27_mara_EAEF335C-A35D-4746-AB2F-58BDDDFB6CC0
#+BEGIN_SRC emacs-lisp
(use-package scheme-mode
  :config
  (setq scheme-program-name "chez")
  (defun help/scheme-mode-hook-fn ())
  (add-hook 'scheme-mode-hook #'help/scheme-mode-hook-fn)
  (defun help/inferior-scheme-mode-hook-fn ()))
#+END_SRC

Geiser.

#+NAME: org_gcr_2017-05-12_mara_5457F0EC-AAB3-4502-ACCD-7F9C1579293D
#+BEGIN_SRC emacs-lisp
(use-package geiser
  :ensure t
  :config
  (setq geiser-active-implementations '(chez))
  (setq geiser-repl-history-no-dups-p t)
  (defun help/geiser-exit-chez ()
    (interactive)
    (call-interactively 'geiser-mode-switch-to-repl)
    (insert "(exit)")
    (geiser-repl--maybe-send))
  (defun help/geiser-on-p ()
    (if (geiser-repl--live-p) 'ON
      'OFF))
  (defun help/geiser-eval-line ()
    "Evaluate this line and move to next."
    (interactive)
    (end-of-line)
    (set-mark (line-beginning-position))
    (call-interactively 'geiser-eval-region)
    (deactivate-mark)
    (call-interactively 'next-logical-line))
  (defhydra help/hydra-geiser-mode (:color blue
                                           :hint nil)
    "
Geiser REPL is: %(help/geiser-on-p)
 _y_ eval-buffer _u_ eval-region _U_ (and go)
  _z_ run (another) geiser _x_ stop latest chez _c_ exit geiser _b_ to latest geiser _n_ switch back
   _q_ quit
"
    ("y" geiser-eval-buffer)
    ("u" geiser-eval-region)
    ("U" geiser-eval-region-and-go)
    ("z" run-geiser)
    ("x" help/geiser-exit-chez)
    ("b" geiser-mode-switch-to-repl)
    ("c" geiser-repl-exit)
    ("n" (lambda () (interactive) (other-window -1)))
    ("q" nil))
  (defun help/geiser-mode-hook-fn ()
    (turn-off-fci-mode)
    (unbind-key "C-." geiser-mode-map)
    (key-chord-define geiser-mode-map "hh" #'help/hydra-geiser-mode/body)
    (unbind-key "C-j")
    (define-key geiser-mode-map (kbd "C-j") #'help/geiser-eval-line))
  (add-hook 'geiser-mode-hook #'help/geiser-mode-hook-fn)
  (defun help/geiser-repl-mode-hook-fn ()
    (turn-off-fci-mode)
    (unbind-key "C-." geiser-repl-mode-map)
    (define-key geiser-repl-mode-map "\C-j" 'geiser-repl--maybe-send)
    (key-chord-define geiser-repl-mode-map "hh" #'help/hydra-geiser-mode/body))
  (add-hook 'geiser-repl-mode-hook #'help/geiser-repl-mode-hook-fn))
#+END_SRC

Enable Auto-Complete via Geiser.

#+NAME: org_gcr_2017-05-12_mara_221DF59F-0817-4F0A-BDE7-01FD9D87BAF9
#+BEGIN_SRC emacs-lisp
(use-package ac-geiser
  :ensure t
  :config
  (add-hook 'geiser-mode-hook 'ac-geiser-setup)
  (add-hook 'geiser-repl-mode-hook 'ac-geiser-setup)
  (eval-after-load "auto-complete"
    '(add-to-list 'ac-modes 'geiser-repl-mode)))
#+END_SRC

*** C
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:F72D838E-4540-4EC1-AECB-B521DF78D8D8
   :END:

#+NAME: org_gcr_2017-05-12_mara_3C48D997-170E-40F4-9BB6-F6BAA9DE77F2
#+BEGIN_SRC emacs-lisp
(defun help/c-mode-common-hook-fn ()
  "HELP c-mode-common customizations."
  (interactive)
  (rainbow-mode))
(add-hook 'c-mode-common-hook #'help/c-mode-common-hook-fn)
#+END_SRC
