help.html

<div id="outline-container-org1cbf96d" class="outline-4">
<h4 id="org1cbf96d"><span class="section-number-4">4.3.4</span> Scheme</h4>
<div class="outline-text-4" id="text-4-3-4">
<pre class="example">
ID: org_gcr_2017-05-12_mara:80DF94ED-4868-47CE-BAC8-978863BEF5AF
</pre>

<p>
File extensions:
</p>
<ul class="org-ul">
<li><p>
Traditional.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgb35c05b">(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">auto-mode-alist</span> <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">"\\.scm\\'"</span> . scheme-mode))
(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">auto-mode-alist</span> <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">"\\.ss\\'"</span> . scheme-mode))
</pre>
</div></li>
<li><p>
R6RS.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgec7b479">(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">auto-mode-alist</span> <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">"\\.sls\\'"</span> . scheme-mode))
(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">auto-mode-alist</span> <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">"\\.sps\\'"</span> . scheme-mode))
</pre>
</div></li>
<li><p>
Racket.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orge71f6f0">(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">auto-mode-alist</span> <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">"\\.rkt\\'"</span> . scheme-mode))
</pre>
</div></li>
</ul>

<p>
Scheme.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org5262c42">(<span class="org-keyword">use-package</span> <span class="org-constant">scheme-mode</span>
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">setq</span> scheme-program-name <span class="org-string">"chez"</span>)
  (<span class="org-keyword">defun</span> <span class="org-function-name">help/scheme-mode-hook-fn</span> ())
  (add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">scheme-mode-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/scheme-mode-hook-fn</span>)
  (<span class="org-keyword">defun</span> <span class="org-function-name">help/inferior-scheme-mode-hook-fn</span> ()))
</pre>
</div>

<p>
Geiser.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgd4316f8">(<span class="org-keyword">use-package</span> <span class="org-constant">geiser</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">setq</span> geiser-active-implementations <span class="org-highlight-quoted-quote">'</span>(chez))
  (<span class="org-keyword">setq</span> geiser-repl-history-no-dups-p t)
  (<span class="org-keyword">defun</span> <span class="org-function-name">help/geiser-exit-chez</span> ()
    (<span class="org-keyword">interactive</span>)
    (call-interactively <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">geiser-mode-switch-to-repl</span>)
    (insert <span class="org-string">"(exit)"</span>)
    (geiser-repl--maybe-send))
  (<span class="org-keyword">defun</span> <span class="org-function-name">help/geiser-on-p</span> ()
    (<span class="org-keyword">if</span> (geiser-repl--live-p) <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">ON</span>
      <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">OFF</span>))
  (<span class="org-keyword">defun</span> <span class="org-function-name">help/geiser-eval-line</span> ()
    <span class="org-doc">"Evaluate this line and move to next."</span>
    (<span class="org-keyword">interactive</span>)
    (end-of-line)
    (set-mark (line-beginning-position))
    (call-interactively <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">geiser-eval-region</span>)
    (deactivate-mark)
    (call-interactively <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">next-logical-line</span>))
  (<span class="org-keyword">defhydra</span> help/hydra-geiser-mode (<span class="org-builtin">:color</span> <span class="custom"><span class="custom-1">blue</span></span>
                                           <span class="org-builtin">:hint</span> nil)
    <span class="org-doc">"</span>
<span class="org-doc">Geiser REPL is: %(help/geiser-on-p)</span>
<span class="org-doc"> _y_ eval-buffer _u_ eval-region _U_ (and go)</span>
<span class="org-doc">  _z_ run (another) geiser _x_ stop latest chez _c_ exit geiser _b_ to latest geiser _n_ switch back</span>
<span class="org-doc">   _q_ quit</span>
<span class="org-doc">"</span>
    (<span class="org-string">"y"</span> geiser-eval-buffer)
    (<span class="org-string">"u"</span> geiser-eval-region)
    (<span class="org-string">"U"</span> geiser-eval-region-and-go)
    (<span class="org-string">"z"</span> run-geiser)
    (<span class="org-string">"x"</span> help/geiser-exit-chez)
    (<span class="org-string">"b"</span> geiser-mode-switch-to-repl)
    (<span class="org-string">"c"</span> geiser-repl-exit)
    (<span class="org-string">"n"</span> (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>) (other-window -1)))
    (<span class="org-string">"q"</span> nil))
  (<span class="org-keyword">defun</span> <span class="org-function-name">help/geiser-mode-hook-fn</span> ()
    (turn-off-fci-mode)
    (<span class="org-keyword">unbind-key</span> <span class="org-string">"C-."</span> geiser-mode-map)
    (key-chord-define geiser-mode-map <span class="org-string">"hh"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/hydra-geiser-mode/body</span>)
    (<span class="org-keyword">unbind-key</span> <span class="org-string">"C-j"</span>)
    (define-key geiser-mode-map (kbd <span class="org-string">"C-j"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/geiser-eval-line</span>))
  (add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">geiser-mode-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/geiser-mode-hook-fn</span>)
  (<span class="org-keyword">defun</span> <span class="org-function-name">help/geiser-repl-mode-hook-fn</span> ()
    (turn-off-fci-mode)
    (<span class="org-keyword">unbind-key</span> <span class="org-string">"C-."</span> geiser-repl-mode-map)
    (define-key geiser-repl-mode-map <span class="org-string">"\C-j"</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">geiser-repl--maybe-send</span>)
    (key-chord-define geiser-repl-mode-map <span class="org-string">"hh"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/hydra-geiser-mode/body</span>))
  (add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">geiser-repl-mode-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/geiser-repl-mode-hook-fn</span>))
</pre>
</div>

<p>
Enable Auto-Complete via Geiser.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgd31f1b7">(<span class="org-keyword">use-package</span> <span class="org-constant">ac-geiser</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">geiser-mode-hook</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">ac-geiser-setup</span>)
  (add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">geiser-repl-mode-hook</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">ac-geiser-setup</span>)
  (eval-after-load <span class="org-string">"auto-complete"</span>
    <span class="org-highlight-quoted-quote">'</span>(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">ac-modes</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">geiser-repl-mode</span>)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf4d8912" class="outline-4">
<h4 id="orgf4d8912"><span class="section-number-4">4.3.5</span> C</h4>
<div class="outline-text-4" id="text-4-3-5">
<pre class="example">
ID: org_gcr_2017-05-12_mara:F72D838E-4540-4EC1-AECB-B521DF78D8D8
</pre>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org0eaa5e8">(<span class="org-keyword">defun</span> <span class="org-function-name">help/c-mode-common-hook-fn</span> ()
  <span class="org-doc">"HELP c-mode-common customizations."</span>
  (<span class="org-keyword">interactive</span>)
  (rainbow-mode))
(add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">c-mode-common-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/c-mode-common-hook-fn</span>)
</pre>
</div>
</div>
</div>
