help.html
<div id="outline-container-org0658aeb" class="outline-4">
<h4 id="org0658aeb"><span class="section-number-4">4.3.6</span> Go</h4>
<div class="outline-text-4" id="text-4-3-6">
<pre class="example">
ID: org_gcr_2017-07-30_mara:2F891F22-5C0C-43BA-8891-62DA7E9540FD
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgaeddb83">(<span class="org-keyword">use-package</span> <span class="org-constant">go-mode</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">use-package</span> <span class="org-constant">go-eldoc</span>
    <span class="org-builtin">:ensure</span> t)
  (<span class="org-keyword">use-package</span> <span class="org-constant">go-autocomplete</span>
    <span class="org-builtin">:ensure</span> t
    <span class="org-builtin">:config</span>
    (ac-config-default))
  (<span class="org-keyword">use-package</span> <span class="org-constant">golint</span>
    <span class="org-builtin">:ensure</span> t)
  (<span class="org-keyword">use-package</span> <span class="org-constant">go-errcheck</span>
    <span class="org-builtin">:ensure</span> t)
  (<span class="org-keyword">use-package</span> <span class="org-constant">ob-go</span>
    <span class="org-builtin">:ensure</span> t
    <span class="org-builtin">:config</span>
    (add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">org-babel-load-languages</span> <span class="org-highlight-quoted-quote">'</span>(go . t)))
  (<span class="org-keyword">use-package</span> <span class="org-constant">go-snippets</span>
    <span class="org-builtin">:ensure</span> t)
  (<span class="org-keyword">use-package</span> <span class="org-constant">flycheck-gometalinter</span>
    <span class="org-builtin">:ensure</span> t
    <span class="org-builtin">:config</span>
    (add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">flycheck-mode-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">flycheck-gometalinter-setup</span>)
    (<span class="org-keyword">setq</span> flycheck-gometalinter-concurrency 2)
    (<span class="org-keyword">setq</span> flycheck-gometalinter-deadline <span class="org-string">"7s"</span>)
    (<span class="org-keyword">setq</span> flycheck-gometalinter-disable-all nil)
    (<span class="org-keyword">setq</span> flycheck-gometalinter-disable-linters nil)
    (<span class="org-keyword">setq</span> flycheck-gometalinter-enable-linters nil)
    (<span class="org-keyword">setq</span> flycheck-gometalinter-errors-only nil)
    (<span class="org-keyword">setq</span> flycheck-gometalinter-fast nil)
    (<span class="org-keyword">setq</span> flycheck-gometalinter-tests t)
    (<span class="org-keyword">setq</span> flycheck-gometalinter-vendor t))
  (<span class="org-keyword">use-package</span> <span class="org-constant">go-guru</span>
    <span class="org-builtin">:ensure</span> t)
  (<span class="org-keyword">use-package</span> <span class="org-constant">go-hydra</span>)
  (<span class="org-keyword">use-package</span> <span class="org-constant">gotest</span>
    <span class="org-builtin">:ensure</span> t)
  (<span class="org-keyword">use-package</span> <span class="org-constant">go-rename</span>
    <span class="org-builtin">:ensure</span> t)
  (<span class="org-keyword">use-package</span> <span class="org-constant">go-direx</span>
    <span class="org-builtin">:ensure</span> t)
  (add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">load-path</span> <span class="org-string">"~/src/go-snippets"</span>)
  (<span class="org-keyword">require</span> <span class="org-highlight-quoted-quote">'</span><span class="org-constant">go-snippets</span>)
  (<span class="org-keyword">defun</span> <span class="org-function-name">help/go-mode/safb/go-run</span> ()
    <span class="org-doc">""</span>
    (<span class="org-keyword">interactive</span>)
    (<span class="org-keyword">let*</span> ((compile-command (file-name-nondirectory
                             (directory-file-name default-directory))))
      (help/safb/compile)))
  (<span class="org-keyword">defun</span> <span class="org-function-name">help/go-mode/safb/go-rename</span> ()
    <span class="org-doc">""</span>
    (<span class="org-keyword">interactive</span>)
    (help/save-all-file-buffers)
    (call-interactively <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">go-rename</span>))
  (add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">load-path</span> <span class="org-string">"~/git/github/gorepl-mode"</span>)
  (<span class="org-keyword">require</span> <span class="org-highlight-quoted-quote">'</span><span class="org-constant">gorepl-mode</span>)
  (<span class="org-keyword">defhydra</span> help/hydra/right/go-mode (<span class="org-builtin">:color</span> <span class="custom"><span class="custom-1">blue</span></span> <span class="org-builtin">:hint</span> nil)
    <span class="org-doc">"</span>
<span class="org-doc"> Go: (_q_uit)              |^                   ^|^                ^|</span>
<span class="org-doc">-^------------------------^+^-------------------^+----------------^^+--------</span>
<span class="org-doc"> _e_: explorer             | _r_: run            | _t_: tools       | g_o_re</span>
<span class="org-doc"> _g_: guru                 | _j_: previous error | _k_: next error  |</span>
<span class="org-doc"> _c_: build                | _n_: rename         |                ^^|</span>
<span class="org-doc"> "</span>
    (<span class="org-string">"e"</span> go-direx-switch-to-buffer)
    (<span class="org-string">"r"</span> help/go-mode/safb/go-run)
    (<span class="org-string">"t"</span> go-hydra-go-mode/body)
    (<span class="org-string">"o"</span> gorepl-hydra/body)
    (<span class="org-string">"g"</span> go-hydra-guru-go-mode/body)
    (<span class="org-string">"k"</span> godef-jump-other-window)
    (<span class="org-string">"l"</span> pop-tag-mark)
    (<span class="org-string">"c"</span> help/safb/compile)
    (<span class="org-string">"n"</span> help/go-mode/safb/go-rename)
    (<span class="org-string">"j"</span> previous-error <span class="org-builtin">:exit</span> nil)
    (<span class="org-string">"k"</span> next-error <span class="org-builtin">:exit</span> nil)
    (<span class="org-string">"q"</span> nil))
  (key-chord-define go-mode-map <span class="org-string">"hh"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/hydra/right/go-mode/body</span>)
  (<span class="org-keyword">defun</span> <span class="org-function-name">help/go-mode-hook-fn</span> ()
    (go-eldoc-setup)
    (<span class="org-keyword">setq</span> gofmt-command <span class="org-string">"goimports"</span>)
    (add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">before-save-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">gofmt-before-save</span>)
    (<span class="org-keyword">setq</span> compilation-read-command nil)
    (<span class="org-keyword">setq</span> compile-command <span class="org-string">"go install &amp;&amp; go test -v &amp;&amp; gometalinter ./..."</span>)
    (local-set-key (kbd <span class="org-string">"s-i"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">godoc-at-point</span>)
    (local-set-key (kbd <span class="org-string">"s-I"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">godoc</span>)
    (local-set-key (kbd <span class="org-string">"s-j"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/safb/compile</span>)
    (local-set-key (kbd <span class="org-string">"s-k"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/go-mode/safb/go-run</span>)
    (local-set-key (kbd <span class="org-string">"="</span>) <span class="org-highlight-quoted-quote">#'</span>(lambda () (<span class="org-keyword">interactive</span>) (insert <span class="org-string">" = "</span>)))
    (local-set-key (kbd <span class="org-string">"s-="</span>) <span class="org-highlight-quoted-quote">#'</span>(lambda () (<span class="org-keyword">interactive</span>) (insert <span class="org-string">" := "</span>)))
    (local-set-key (kbd <span class="org-string">"s-&lt;"</span>) <span class="org-highlight-quoted-quote">#'</span>(lambda () (<span class="org-keyword">interactive</span>) (insert <span class="org-string">" &lt;- "</span>)))
    (local-set-key (kbd <span class="org-string">"s-o"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">gorepl-hydra/body</span>)
    (go-guru-hl-identifier-mode)
    (gorepl-mode))
  (add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">go-mode-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/go-mode-hook-fn</span>))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf290129" class="outline-4">
<h4 id="orgf290129"><span class="section-number-4">4.3.7</span> Python</h4>
<div class="outline-text-4" id="text-4-3-7">
<pre class="example">
ID: org_gcr_2017-05-12_mara:BA88E1CC-386E-4CFF-89B3-7E003EC92504
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org0900071">(<span class="org-keyword">defun</span> <span class="org-function-name">help/python-mode-hook-fn</span> ()
  <span class="org-doc">"HELP python mode customizatin."</span>
  (<span class="org-keyword">interactive</span>)
  (indent-guide-mode))
(add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">python-mode-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/python-mode-hook-fn</span>)
</pre>
</div>
</div>
</div>
