help.html
<div id="outline-container-org73294b7" class="outline-4">
<h4 id="org73294b7"><span class="section-number-4">4.3.8</span> YASnippet &amp; Abbrev</h4>
<div class="outline-text-4" id="text-4-3-8">
<pre class="example">
ID: org_gcr_2017-05-12_mara:8B8B0626-3A67-4F10-9106-ACFD4E9731E5
</pre>

<ul class="org-ul">
<li>Enable everywhere.</li>
<li>Never expand with <code>TAB</code> <b>anywhere</b>.
<ul class="org-ul">
<li>Allow expansion to occur within fields.</li>
</ul></li>
<li>Load HELP snippets.</li>
<li>Use Ido to handle user decisions.</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgeb960ab">(<span class="org-keyword">use-package</span> <span class="org-constant">yasnippet</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (yas-global-mode t)
  (<span class="org-keyword">help/not-on-gui</span> (define-key yas-minor-mode-map (kbd <span class="org-string">"TAB"</span>) nil))
  (<span class="org-keyword">help/on-gui</span> (define-key yas-minor-mode-map (kbd <span class="org-string">"&lt;tab&gt;"</span>) nil))
  (define-key yas-minor-mode-map (kbd <span class="org-string">"C-;"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">yas-expand</span>)
  (<span class="org-keyword">help/not-on-gui</span> (define-key yas-keymap (kbd <span class="org-string">"TAB"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">yas-next-field</span>))
  (<span class="org-keyword">help/on-gui</span> (define-key yas-keymap (kbd <span class="org-string">"&lt;tab&gt;"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">yas-next-field</span>))
  (add-to-list <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">yas-snippet-dirs</span> <span class="org-string">"~/src/help/yasnippet"</span>)
  (yas-reload-all)
  (<span class="org-keyword">setq</span> yas-prompt-functions <span class="org-highlight-quoted-quote">'</span>(yas-ido-prompt))
  <span class="org-builtin">:diminish</span> yas-minor-mode)
</pre>
</div>

<p>
Some modes turn on <code>abbrev-mode</code>. Diminish it.
</p>

<p>
Fails with <code>(eval-after-load 'abbrev (diminish 'abbrev-mode))</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org04f368d">(eval-after-load <span class="org-string">"abbrev"</span>
  <span class="org-highlight-quoted-quote">'</span>(diminish <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">abbrev-mode</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeeccff2" class="outline-4">
<h4 id="orgeeccff2"><span class="section-number-4">4.3.9</span> Structured Query Language (SQL)</h4>
<div class="outline-text-4" id="text-4-3-9">
<pre class="example">
ID: org_gcr_2017-05-12_mara:74BF0520-1F06-4FAF-921C-64E8109CEF03
</pre>
</div>
</div>

<div id="outline-container-org3e1c604" class="outline-4">
<h4 id="org3e1c604"><span class="section-number-4">4.3.10</span> Web Development</h4>
<div class="outline-text-4" id="text-4-3-10">
<pre class="example">
ID: org_gcr_2017-05-12_mara:58CFE4EF-8A8A-4C41-9ECF-C9F6D814218E
</pre>

<p>
<code>web-mode</code> works great for <code>AngularJS</code> and now I see a whole lot more.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org5a0fd17">(<span class="org-keyword">use-package</span> <span class="org-constant">web-mode</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> web-mode-enable-current-element-highlight t)
  <span class="org-builtin">:config</span>
  (add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">auto-mode-alist</span> <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">"\\.tpl'"</span> . web-mode))
  (add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">auto-mode-alist</span> <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">"\\.[agj]sp\\'"</span> . web-mode))
  (add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">auto-mode-alist</span> <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">"\\.as[cp]x\\'"</span> . web-mode))
  (add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">auto-mode-alist</span> <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">"\\.erb\\'"</span> . web-mode))
  (add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">auto-mode-alist</span> <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">"\\.mustache\\'"</span> . web-mode))
  (add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">auto-mode-alist</span> <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">"\\.djhtml\\'"</span> . web-mode))
  (add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">auto-mode-alist</span> <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">"\\.html?\\'"</span> . web-mode))
  (add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">auto-mode-alist</span> <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">"\\.js?\\'"</span> . web-mode))
  (add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">auto-mode-alist</span> <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">"\\.jsx?\\'"</span> . web-mode))
  (add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">auto-mode-alist</span> <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">"\\.css?\\'"</span> . web-mode))
  (add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">auto-mode-alist</span> <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">"\\.scss?\\'"</span> . web-mode))
  (add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">auto-mode-alist</span> <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">"\\.xml?\\'"</span> . web-mode))
  (add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">auto-mode-alist</span> <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">"\\.php?\\'"</span> . web-mode))
  (<span class="org-keyword">setq</span> web-mode-enable-engine-detection t)
  (define-key web-mode-map (kbd <span class="org-string">"s-n"</span>) <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">web-mode-tag-match</span>))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/web-mode-hook-fn</span> ()
  <span class="org-doc">"HELP web-mode customizations."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">setq</span> web-mode-enable-auto-indentation nil)
  (<span class="org-keyword">setq</span> web-mode-markup-indent-offset 2)
  (<span class="org-keyword">setq</span> web-mode-css-indent-offset 2)
  (<span class="org-keyword">setq</span> web-mode-code-indent-offset 2)
  (<span class="org-keyword">setq</span> web-mode-style-padding 1)
  (<span class="org-keyword">setq</span> web-mode-script-padding 1)
  (<span class="org-keyword">setq</span> web-mode-block-padding 0)
  (<span class="org-keyword">setq</span> web-mode-comment-style 2)
  (<span class="org-keyword">setq</span> web-mode-extra-snippets
        <span class="org-highlight-quoted-quote">'</span>( (<span class="org-string">"php"</span> . ((<span class="org-string">"dowhile"</span> . (<span class="org-string">"&lt;?php do { ?&gt;\n\n&lt;?php } while (|); ?&gt;"</span>))
                     (<span class="org-string">"debug"</span> . (<span class="org-string">"&lt;?php error_log(__LINE__); ?&gt;"</span>))))))
  (<span class="org-keyword">setq</span> web-mode-enable-auto-pairing nil)
  (<span class="org-keyword">defun</span> <span class="org-function-name">sp-web-mode-is-code-context</span> (id action context)
    (<span class="org-keyword">and</span> (eq action <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">insert</span>)
       (not (<span class="org-keyword">or</span> (get-text-property (point) <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">part-side</span>)
             (get-text-property (point) <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">block-side</span>)))))

  (sp-local-pair <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">web-mode</span> <span class="org-string">"&lt;"</span> nil <span class="org-builtin">:when</span> <span class="org-highlight-quoted-quote">'</span>(sp-web-mode-is-code-context))
  (<span class="org-keyword">setq</span> web-mode-enable-css-colorization t)
  (<span class="org-keyword">setq</span> web-mode-enable-block-face t)
  (<span class="org-keyword">setq</span> web-mode-enable-part-face t)
  (<span class="org-keyword">setq</span> web-mode-enable-comment-keywords t)
  (<span class="org-keyword">setq</span> web-mode-enable-heredoc-fontification t)
  (turn-off-fci-mode))

(add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">web-mode-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/web-mode-hook-fn</span>)
</pre>
</div>
</div>
</div>
