help.org
*** JavaScript
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:92C9A271-BC16-431B-8457-2901DE330164
:END:

Out of the box Emacs supports =js= with ~js-mode~. Define language =javascript= to
use ~js2-mode~.

#+NAME: org_gcr_2017-05-12_mara_56F80A50-4914-4F8F-8771-5800A54F8300
#+BEGIN_SRC emacs-lisp
(use-package js2-mode
  :ensure t
  :mode (("\\.js$" . js2-mode)
         ("\\.jsx$" . js2-mode))
  :interpreter ("node" . js2-mode)
  :config
  (add-hook 'js2-mode-hook #'js2-imenu-extras-mode)
  (add-to-list 'org-src-lang-modes '("javascript" . js2)))

(use-package js2-refactor
  :after (js2-mode)
  :ensure t
  :diminish js2-refactor-mode
  :config
  (add-hook 'js2-mode-hook #'js2-refactor-mode)
  (js2r-add-keybindings-with-prefix "C-c C-m"))
#+END_SRC

~json-mode~ is derived from ~javascript-mode~ so configure the latter's indent to
two.

#+NAME: org_gcr_2017-05-12_mara_498DAC46-DA9D-4AAA-82BF-46D712E4DBA5
#+BEGIN_SRC emacs-lisp
(use-package json-mode
  :ensure t
  :diminish json-mode
  :mode (("\\.jshintrc$" . json-mode))
  :config
  (progn
    (setq js-indent-level 2)
    (setq json-reformat:indent-width 2)
    (setq json-reformat:pretty-string\? t)))
#+END_SRC

*** F#
:PROPERTIES:
:ID:       org_gcr_2017-08-10_mara:A449A518-7BDF-4D95-971A-EEA942A1C8EA
:END:
#+NAME: org_gcr_2017-08-10_mara_AD0FE176-6CF0-4078-A6A8-ECB8C26BD93B
#+BEGIN_SRC emacs-lisp
(use-package fsharp-mode
  :ensure t
  :config
  (use-package ob-fsharp
    :ensure t
    :config
    (autoload 'fsharp-mode "fsharp-mode"     "Major mode for editing F# code." t)
    (add-to-list 'auto-mode-alist '("\\.fs[iylx]?$" . fsharp-mode))
    (add-to-list 'org-babel-load-languages '(fsharp . t))))
#+END_SRC
** Publishing
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:0A4A1510-41F7-4469-87D1-156D44A06216
   :END:
*** TeX
  :PROPERTIES:
  :ID:       org_gcr_2017-05-12_mara:2DF7BDAD-45C9-4D8D-AC34-FE77E119A093
  :END:

#+NAME: org_gcr_2017-05-12_mara_D035C4E4-B983-4D74-9E3C-764EF00B3795
#+BEGIN_SRC emacs-lisp
(use-package tex
  :ensure auctex
  :config
  (define-key TeX-mode-map (kbd "C-c C-c") #'help/safb-TeX-command-master))
#+END_SRC

Save style info. This doesn't control the buffer save.

#+NAME: org_gcr_2017-05-12_mara_86E4D060-B2E1-4F7E-B56C-A7D93C0024FA
#+BEGIN_SRC emacs-lisp
(setq TeX-auto-save t)
#+END_SRC

Parse on load.

#+NAME: org_gcr_2017-05-12_mara_1502A970-C03E-4D2D-8041-4B7AE8859AF0
#+BEGIN_SRC emacs-lisp
(setq TeX-parse-self t)
#+END_SRC

Parse on save.

#+NAME: org_gcr_2017-05-12_mara_C923F472-C10C-46D2-B9F2-5DBADE6E436D
#+BEGIN_SRC emacs-lisp
(setq TeX-auto-save t)
#+END_SRC

Use PDFTeX to generate both DVI and PDF files.

#+NAME: org_gcr_2017-05-12_mara_D30FAF98-9340-49C8-BE94-834BF2A2CB11
#+BEGIN_SRC emacs-lisp
(setq TeX-PDF-mode t)
(setq TeX-DVI-via-PDFTeX t)
#+END_SRC

Don't prompt every time you run =C-c C-c= about saving the file, instead, just
save it.

#+NAME: org_gcr_2017-05-12_mara_851CFD0C-D616-47D1-A0E0-044053B89B03
#+BEGIN_SRC emacs-lisp
(setq TeX-save-query nil)
#+END_SRC

Load LCO files with AucTeX.

#+NAME: org_gcr_2017-05-12_mara_5B99942E-0535-40CC-9C61-F895DAF8C545
#+BEGIN_SRC emacs-lisp
(add-to-list 'auto-mode-alist '("\\.lco?\\'" . TeX-latex-mode))
#+END_SRC

Culture-dependent typographical results.

#+NAME: org_gcr_2017-05-12_mara_5E9D3CF3-A603-4225-9BDD-06E2CAA9ED19
#+BEGIN_SRC emacs-lisp
(add-to-list 'org-latex-packages-alist '("english" "babel" t))
#+END_SRC

Use the closest thing to Times New Roman.

#+NAME: org_gcr_2017-05-12_mara_11FEAF4C-B3C6-4188-B642-DE57F7D2ADCD
#+BEGIN_SRC emacs-lisp
(add-to-list 'org-latex-packages-alist '("" "mathptmx" t))
#+END_SRC

Small margins.

#+NAME: org_gcr_2017-05-12_mara_55AF149A-B2A9-42ED-8E9F-0BDBEAF31301
#+BEGIN_SRC emacs-lisp
(add-to-list 'org-latex-packages-alist '("margin=1.5in" "geometry" nil))
#+END_SRC

One empty line between paragraphs.

#+NAME: org_gcr_2017-05-12_mara_0492362D-F615-4D40-9C64-49CD7A8E493E
#+BEGIN_SRC emacs-lisp
(add-to-list 'org-latex-packages-alist '("" "parskip" nil))
#+END_SRC

Dropped capitals.

#+NAME: org_gcr_2017-05-12_mara_5AF3546A-23E6-4DA3-BE95-108C3F8CB6D0
#+BEGIN_SRC emacs-lisp
(add-to-list 'org-latex-packages-alist '("" "lettrine" nil))
#+END_SRC

Standard LaTeX class options.

#+NAME: org_gcr_2017-05-12_mara_7EE5307A-ACC5-4FE9-A519-0F273B4589E9
#+BEGIN_SRC emacs-lisp
(defvar help/ltx-cls-opt "paper=letter, fontsize=12pt")
#+END_SRC

Standard article class.

#+NAME: org_gcr_2017-05-12_mara_006EB5E3-5478-43C7-AEAC-34CCF49127AC
#+BEGIN_SRC emacs-lisp
(eval-after-load "ox-latex"
  '(add-to-list 'org-latex-classes
                `("help-article"
                  ,(concat "\\documentclass["
                           help/ltx-cls-opt
                           "]{article}"))))

(setq org-latex-default-class "help-article")
#+END_SRC

Use "Smartquotes".

#+NAME: org_gcr_2017-05-12_mara_F8F77D4B-8958-49F2-8ED8-FE96F55ECAFB
#+BEGIN_SRC emacs-lisp
(setq org-export-with-smart-quotes t)
#+END_SRC

