help.html

<div id="outline-container-orgf9bcacb" class="outline-4">
<h4 id="orgf9bcacb"><span class="section-number-4">4.3.11</span> JavaScript</h4>
<div class="outline-text-4" id="text-4-3-11">
<pre class="example">
ID: org_gcr_2017-05-12_mara:92C9A271-BC16-431B-8457-2901DE330164
</pre>

<p>
Out of the box Emacs supports <code>js</code> with <code>js-mode</code>. Define language <code>javascript</code> to
use <code>js2-mode</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgcf99fd0">(<span class="org-keyword">use-package</span> <span class="org-constant">js2-mode</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:mode</span> ((<span class="org-string">"\\.js$"</span> . js2-mode)
         (<span class="org-string">"\\.jsx$"</span> . js2-mode))
  <span class="org-builtin">:interpreter</span> (<span class="org-string">"node"</span> . js2-mode)
  <span class="org-builtin">:config</span>
  (add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">js2-mode-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">js2-imenu-extras-mode</span>)
  (add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">org-src-lang-modes</span> <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">"javascript"</span> . js2)))

(<span class="org-keyword">use-package</span> <span class="org-constant">js2-refactor</span>
  <span class="org-builtin">:after</span> (js2-mode)
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:diminish</span> js2-refactor-mode
  <span class="org-builtin">:config</span>
  (add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">js2-mode-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">js2-refactor-mode</span>)
  (js2r-add-keybindings-with-prefix <span class="org-string">"C-c C-m"</span>))
</pre>
</div>

<p>
<code>json-mode</code> is derived from <code>javascript-mode</code> so configure the latter&rsquo;s indent to
two.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org5bf8d57">(<span class="org-keyword">use-package</span> <span class="org-constant">json-mode</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:diminish</span> json-mode
  <span class="org-builtin">:mode</span> ((<span class="org-string">"\\.jshintrc$"</span> . json-mode))
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">progn</span>
    (<span class="org-keyword">setq</span> js-indent-level 2)
    (<span class="org-keyword">setq</span> json-reformat:indent-width 2)
    (<span class="org-keyword">setq</span> json-reformat:pretty-string\? t)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org5afb568" class="outline-4">
<h4 id="org5afb568"><span class="section-number-4">4.3.12</span> F#</h4>
<div class="outline-text-4" id="text-4-3-12">
<pre class="example">
ID: org_gcr_2017-08-10_mara:A449A518-7BDF-4D95-971A-EEA942A1C8EA
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org1855a68">(<span class="org-keyword">use-package</span> <span class="org-constant">fsharp-mode</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">use-package</span> <span class="org-constant">ob-fsharp</span>
    <span class="org-builtin">:ensure</span> t
    <span class="org-builtin">:config</span>
    (autoload <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">fsharp-mode</span> <span class="org-string">"fsharp-mode"</span>     <span class="org-doc">"Major mode for editing F# code."</span> t)
    (add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">auto-mode-alist</span> <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">"\\.fs[iylx]?$"</span> . fsharp-mode))
    (add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">org-babel-load-languages</span> <span class="org-highlight-quoted-quote">'</span>(fsharp . t))))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org8ab7b62" class="outline-3">
<h3 id="org8ab7b62"><span class="section-number-3">4.4</span> Publishing</h3>
<div class="outline-text-3" id="text-4-4">
<pre class="example">
ID: org_gcr_2017-05-12_mara:0A4A1510-41F7-4469-87D1-156D44A06216
</pre>
</div>
<div id="outline-container-org451de69" class="outline-4">
<h4 id="org451de69"><span class="section-number-4">4.4.1</span> TeX</h4>
<div class="outline-text-4" id="text-4-4-1">
<pre class="example">
ID: org_gcr_2017-05-12_mara:2DF7BDAD-45C9-4D8D-AC34-FE77E119A093
</pre>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org0059a78">(<span class="org-keyword">use-package</span> <span class="org-constant">tex</span>
  <span class="org-builtin">:ensure</span> auctex
  <span class="org-builtin">:config</span>
  (define-key TeX-mode-map (kbd <span class="org-string">"C-c C-c"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/safb-TeX-command-master</span>))
</pre>
</div>

<p>
Save style info. This doesn&rsquo;t control the buffer save.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org97f2d99">(<span class="org-keyword">setq</span> TeX-auto-save t)
</pre>
</div>

<p>
Parse on load.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org1a56079">(<span class="org-keyword">setq</span> TeX-parse-self t)
</pre>
</div>

<p>
Parse on save.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org0211583">(<span class="org-keyword">setq</span> TeX-auto-save t)
</pre>
</div>

<p>
Use PDFTeX to generate both DVI and PDF files.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org98de8bf">(<span class="org-keyword">setq</span> TeX-PDF-mode t)
(<span class="org-keyword">setq</span> TeX-DVI-via-PDFTeX t)
</pre>
</div>

<p>
Don&rsquo;t prompt every time you run <code>C-c C-c</code> about saving the file, instead, just
save it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org15094d9">(<span class="org-keyword">setq</span> TeX-save-query nil)
</pre>
</div>

<p>
Load LCO files with AucTeX.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orge5f484b">(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">auto-mode-alist</span> <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">"\\.lco?\\'"</span> . TeX-latex-mode))
</pre>
</div>

<p>
Culture-dependent typographical results.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org44cebb8">(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">org-latex-packages-alist</span> <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">"english"</span> <span class="org-string">"babel"</span> t))
</pre>
</div>

<p>
Use the closest thing to Times New Roman.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org736e294">(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">org-latex-packages-alist</span> <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">""</span> <span class="org-string">"mathptmx"</span> t))
</pre>
</div>

<p>
Small margins.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org0c29c9a">(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">org-latex-packages-alist</span> <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">"margin=1.5in"</span> <span class="org-string">"geometry"</span> nil))
</pre>
</div>

<p>
One empty line between paragraphs.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgc1e63d1">(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">org-latex-packages-alist</span> <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">""</span> <span class="org-string">"parskip"</span> nil))
</pre>
</div>

<p>
Dropped capitals.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org2c88fe4">(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">org-latex-packages-alist</span> <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">""</span> <span class="org-string">"lettrine"</span> nil))
</pre>
</div>

<p>
Standard LaTeX class options.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org93d2d2d">(<span class="org-keyword">defvar</span> <span class="org-variable-name">help/ltx-cls-opt</span> <span class="org-string">"paper=letter, fontsize=12pt"</span>)
</pre>
</div>

<p>
Standard article class.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org055c994">(eval-after-load <span class="org-string">"ox-latex"</span>
  <span class="org-highlight-quoted-quote">'</span>(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">org-latex-classes</span>
                <span class="org-highlight-quoted-quote">`</span>(<span class="org-string">"help-article"</span>
                  ,(concat <span class="org-string">"\\documentclass["</span>
                           help/ltx-cls-opt
                           <span class="org-string">"]{article}"</span>))))

(<span class="org-keyword">setq</span> org-latex-default-class <span class="org-string">"help-article"</span>)
</pre>
</div>

<p>
Use &ldquo;Smartquotes&rdquo;.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgdfa938a">(<span class="org-keyword">setq</span> org-export-with-smart-quotes t)
</pre>
</div>
</div>
</div>
