help.html

<div id="outline-container-orge2d528d" class="outline-4">
<h4 id="orge2d528d"><span class="section-number-4">4.4.2</span> KOMA-Script</h4>
<div class="outline-text-4" id="text-4-4-2">
<pre class="example">
ID: org_gcr_2017-05-12_mara:623E9A43-A969-48FD-9045-356F83B135E2
</pre>

<p>
I enjoy writing letters. I enjoy reading letters. LaTeX produces letters that
are easy to print and read. Org provides a <a href="http://orgmode.org/worg/exporters/koma-letter-export.html">KOMA Script exporter</a> for <a href="https://www.ctan.org/pkg/koma-script?lang=en">KOMA-script</a>.
The Org documentation mentions that the user should read the <a href="http://orgmode.org/cgit.cgi/org-mode.git/plain/contrib/lisp/ox-koma-letter.el">ox-koma-letter.el</a>
header documentation.
</p>

<p>
The <a href="https://www.ctan.org/pkg/babel?lang=en">babel</a> packages is mentioned in the Org documentation. The package
documentation explains that it should be used with LaTeX, but not XeTeX. Some
time ago I decided to stick with LaTeX. This decision needs documentation. This
system leans towards LuaTeX because of its Unicode support and sticks with
PDFLaTeX because of its broad acceptance. Those two goals are at odds with each
other.
</p>

<p>
Load the KOMA exporter.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org4034e80">(eval-after-load <span class="org-string">"ox"</span> <span class="org-highlight-quoted-quote">'</span>(<span class="org-keyword">require</span> <span class="org-highlight-quoted-quote">'</span><span class="org-constant">ox-koma-letter</span>))
</pre>
</div>

<ul class="org-ul">
<li>Understanding KOMA and how to use it
<ul class="org-ul">
<li>There are 4 ways to set letter metadata, listed &ldquo;from the most specific to
the most general&rdquo; (not sure exactly what this statement means, and the conclusion of my notes tries to make sense of what is really going on here and what is the best way to do things)
<ul class="org-ul">
<li>Org option lines (ORG)</li>
<li>Separate Org latex classes (LTX)</li>
<li>Emacs Lisp variables (LISP)</li>
<li>Letter Class Option files (LCO)</li>
</ul></li>
</ul></li>
<li>Notes and thoughts on the ways to use it
<ul class="org-ul">
<li>LTX
<ul class="org-ul">
<li>By following the setup directions, you do this, creating &ldquo;help-letter&rdquo; class</li>
<li>Familiar and easy if you already know LaTeX
<ul class="org-ul">
<li>At some point in your workflow, you <b>must</b> define a class to use, anyway</li>
</ul></li>
<li>Very easy to do, just define the class template and set <code>org-koma-letter-default-class</code></li>
</ul></li>
<li>ORG
<ul class="org-ul">
<li>Simple way that makes it very easy to just focus on the document content</li>
<li>This metadata takes highest priority in the workflow
<ul class="org-ul">
<li>So you should set your typical defaults in LISP or LCO and customize it
here. This is exactly what I wanted to know.</li>
<li>This lets you do your tweaking in each unique file while relying on the
most common defaults defined elsewhere</li>
</ul></li>
</ul></li>
<li>LISP
<ul class="org-ul">
<li>Very familiar style of configuring things</li>
</ul></li>
<li>LCO
<ul class="org-ul">
<li>LCO == Letter Class Option files</li>
<li>LCO files are TeX</li>
<li>They are included in the generated TeX source code from the letter</li>
<li>Gives <b>full</b> access to KOMA-Script
<ul class="org-ul">
<li>Big deal, because not everything is exposed through ORG or LISP</li>
<li>Also gives full access to any and all TeX and LaTeX code</li>
</ul></li>
<li>LCO files are a KOMA-Script thing, so they are a LaTeX thing</li>
<li><blockquote>
<p>
Letter metadata set in LCO files overwrites letter metadata set in Emacs
variables but not letter metadata set in the Org file.
</p>
</blockquote></li>
<li>When you include multiple LCO files, they are evaluated LIFO. Properties
are set as they first appear, and are not set again. Say you include
&ldquo;MyGeneralStuffForAnyLetter.lco&rdquo; and then include
&ldquo;MyStuffSpecificToThisLetter.lco&rdquo;. The specific stuff will get set first.
Then general stuff will get set last.
<ul class="org-ul">
<li>Surely there is a better way to phrase this. I will work on that.</li>
</ul></li>
</ul></li>
</ul></li>
<li>Recommendations
<ul class="org-ul">
<li>What is the easiest way to start using KOMA-Script based on what you know
today?</li>
<li>If you don&rsquo;t know any of the approaches
<ul class="org-ul">
<li>Then choose between learning LaTeX and Org</li>
</ul></li>
<li>If you only know LaTeX
<ul class="org-ul">
<li>Then you will use the LTX/LCO metadata approach</li>
</ul></li>
<li>If you only know ORG
<ul class="org-ul">
<li>Then you will use the ORG metadata approach</li>
</ul></li>
<li>If you only know ORG and LISP
<ul class="org-ul">
<li>Then you will use the LISP approach for general metadata and the ORG
approach specific metadata</li>
</ul></li>
<li>If you know LTX/LCO, ORG, and LISP
<ul class="org-ul">
<li>Then you have total flexibility</li>
<li>The fact is that
<ul class="org-ul">
<li>ORG settings always trump LTX/LCO and LISP</li>
<li>LISP settings are a subset of all of the settings available in
KOMA-Script, so you will always have to fall back to LTX/LCO if you want
to use unexposed features</li>
<li>LCO files are just plain old LaTeX, which you already know</li>
</ul></li>
<li>So the best thing to do
<ul class="org-ul">
<li>Is to use ORG for letter-specific settings</li>
<li>And LTX for general settings</li>
<li>Everything is a lot simpler this way because
<ul class="org-ul">
<li>One less metadata approach to keep track of</li>
<li>All KOMA-Script features are present</li>
<li>Need to learn details of KOMA-Script package anyway</li>
</ul></li>
</ul></li>
</ul></li>
</ul></li>
</ul>

<p>
Configure the default class.
</p>

<p>
<a href="https://tex.stackexchange.com/questions/102922/how-can-i-get-us-letter-output-from-koma-scripts-scrlttr2-class">This</a> post explains how to default the US letter size. That is the likely default
for my printed correspondence.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org0cfecfe">(eval-after-load <span class="org-string">"ox-koma-letter"</span>
  <span class="org-highlight-quoted-quote">'</span>(<span class="org-keyword">progn</span>
     (add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">org-latex-classes</span>
                  <span class="org-highlight-quoted-quote">`</span>(<span class="org-string">"help-letter"</span>
                    ,(concat <span class="org-string">"\\documentclass["</span>
                             help/ltx-cls-opt
                             <span class="org-string">", pagesize, UScommercial9]{scrlttr2}"</span>)))

     (<span class="org-keyword">setq</span> org-koma-letter-default-class <span class="org-string">"help-letter"</span>)))
</pre>
</div>

<p>
There are two formats for the letters: <a href="http://orgmode.org/w/?p=worg.git;a=blob;f=exporters/koma-letter-new-example.org;h=180a9a0e10dd8f7483a67946daf36732c316f821;hb=180a9a0e10dd8f7483a67946daf36732c316f821">heading-based</a> and <a href="http://orgmode.org/w/?p=worg.git;a=blob;f=exporters/koma-letter-example.org;h=e21b8b00c3e895be9dd573d02ea84b08796296a3;hb=e21b8b00c3e895be9dd573d02ea84b08796296a3">property-based</a>.
</p>

<p>
Set up my default LCO files.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org8867315">(<span class="org-keyword">setq</span> org-koma-letter-class-option-file <span class="org-string">"KomaDefault"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeab7d21" class="outline-4">
<h4 id="orgeab7d21"><span class="section-number-4">4.4.3</span> Texinfo</h4>
<div class="outline-text-4" id="text-4-4-3">
<pre class="example">
ID: org_gcr_2017-05-12_mara:2A19DF86-96B0-4371-8DE9-1F79861F5E89
</pre>

<p>
Perhaps the <a href="https://lists.gnu.org/archive/html/emacs-orgmode/2015-07/msg00042.html">first</a> document typeset with Org-Texinfo.
</p>
</div>
</div>

<div id="outline-container-orgb6dddc3" class="outline-4">
<h4 id="orgb6dddc3"><span class="section-number-4">4.4.4</span> Pandoc</h4>
<div class="outline-text-4" id="text-4-4-4">
<pre class="example">
ID: org_gcr_2017-05-12_mara:BF923ADF-EB81-4695-9F98-F68D557D667B
</pre>
</div>
</div>
