help.org
*** Markdown
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:005B395D-AF3F-471D-AD11-45FDBAA85D7A
   :END:

Provide Github Flavored Markdown (GFM).

#+NAME: org_gcr_2017-05-12_mara_732CDF3A-C47A-4D5D-BFEC-69B765507B97
#+BEGIN_SRC emacs-lisp
(use-package ox-gfm
  :ensure t)
#+END_SRC

Program GFM.

#+NAME: org_gcr_2017-05-12_mara_42D37E52-A420-4196-8B2C-6755441A5FC3
#+BEGIN_SRC emacs-lisp
(use-package markdown-mode
  :ensure t
  :config
  (add-to-list 'auto-mode-alist '("\\.md\\'" . gfm-mode))
  (setq markdown-coding-system "utf-8"))
#+END_SRC

*** HTML
  :PROPERTIES:
  :ID:       org_gcr_2017-05-12_mara:5AE61C99-1862-456E-B6FA-44225675B208
  :END:

Load Htmlize for HTML export.

#+NAME: org_gcr_2017-05-12_mara_62E6542A-B340-470A-B7E0-2F4438EBBAE9
#+BEGIN_SRC emacs-lisp
(use-package htmlize
  :config
  (setq org-html-htmlize-output-type htmlize-output-type)
  (setq htmlize-output-type 'inline-css)
  (defvar help/htmlize-initial-fci-state nil
    "Variable to store the state of `fci-mode' upon calling `htmlize-buffer'.

Attribution: URL `http://permalink.gmane.org/gmane.emacs.orgmode/98153'.")
  (defvar help/htmlize-initial-flyspell-state nil
    "Variable to store the state of `flyspell-mode' upon calling `htmlize-buffer'.

Attribution: URL `http://permalink.gmane.org/gmane.emacs.orgmode/98153'.")

  (defun help/htmlize-before-hook-fn ()
    (when (fboundp 'fci-mode)
      (setq help/htmlize-initial-fci-state fci-mode)
      (when fci-mode
        (fci-mode -1))))
  (add-hook 'htmlize-before-hook #'help/htmlize-before-hook-fn)

  (defun help/htmlize-after-hook-fn ()
    (when (fboundp 'fci-mode)
      (when help/htmlize-initial-fci-state
        (fci-mode t))))
  (add-hook 'htmlize-after-hook #'help/htmlize-after-hook-fn))
#+END_SRC

Use in-line CSS.

#+NAME: org_gcr_2017-05-12_mara_03AEAE7A-99ED-42BE-BE6E-0485884B55BB
#+BEGIN_SRC emacs-lisp
(setq org-html-doctype "html5")
#+END_SRC

*** ASCII
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:7BEBFA9B-E445-41F3-ABC6-08AFB3020D30
   :END:

#+NAME: org_gcr_2017-05-12_mara_41F8B285-650A-4394-8ECD-85C81181DF14
#+BEGIN_SRC emacs-lisp
(setq org-ascii-text-width 80)
(setq org-ascii-global-margin 0)
#+END_SRC

Show non-ascii characters

#+NAME: org_gcr_2017-05-12_mara_96A9D762-036A-49C0-9E1B-5ACD3F5AE58E
#+BEGIN_SRC emacs-lisp
(defun help/occur-non-ascii ()
  "Find any non-ascii characters in the current buffer.
Attribution: URL `https://www.emacswiki.org/emacs/FindingNonAsciiCharacters'"
  (interactive)
  (occur "[^[:ascii:]]"))
#+END_SRC

*** Beamer
  :PROPERTIES:
  :ID:       org_gcr_2017-05-12_mara:1D459BA8-B1B0-40B9-B733-6B59216FD1B2
  :END:

Load Beamer for creating presentations.

#+NAME: org_gcr_2017-05-12_mara_8D4105B8-5215-4835-91BF-B0D03ACC3A78
#+BEGIN_SRC emacs-lisp
(use-package ox-beamer)
#+END_SRC

*** Screenwriting
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:AE18CBCE-F03C-4422-AAC8-E1E2C76A7C5E
:END:

#+NAME: org_gcr_2017-05-12_mara_B19CF074-8B77-4843-912C-F68B6FB0FE2F
#+BEGIN_SRC emacs-lisp
(use-package fountain-mode
  :config
  (add-to-list 'auto-mode-alist '("\\.fountain$" . fountain-mode))
  (let ((fountain-stx '(
                        "CONT'D"
                        "CROSSFADE"
                        "FLASHCUTS"
                        "FLASHFORWARD"
                        "INTERCUT"
                        "PRE"
                        "PRELAP"
                        )))
    (mapc (lambda (stx) (add-to-list 'ispell-skip-region-alist (list stx)))
          fountain-stx)))
#+END_SRC

*** Reveal.js
:PROPERTIES:
:ID:       org_gcr_2017-05-19_mara:73719624-5BA9-4000-B70C-77C30CAB592B
:END:
#+NAME: org_gcr_2017-05-19_mara_3FB67413-237F-425D-97D2-B2E164AE5F8F
#+BEGIN_SRC emacs-lisp
(use-package ox-reveal
  :ensure t
  :config
  (setq org-reveal-root (expand-file-name "~/src/reveal.js")))
#+END_SRC
** DevOps
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:F79C9679-7887-40B8-8882-51EE6EC1BDE2
   :END:
*** Shell Script
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:68AC26B4-B52C-4A1F-AF1E-78AFE5A3D91D
   :END:
