help.html

<div id="outline-container-orgba537bc" class="outline-4">
<h4 id="orgba537bc"><span class="section-number-4">4.4.5</span> Markdown</h4>
<div class="outline-text-4" id="text-4-4-5">
<pre class="example">
ID: org_gcr_2017-05-12_mara:005B395D-AF3F-471D-AD11-45FDBAA85D7A
</pre>

<p>
Provide Github Flavored Markdown (GFM).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgc085e5d">(<span class="org-keyword">use-package</span> <span class="org-constant">ox-gfm</span>
  <span class="org-builtin">:ensure</span> t)
</pre>
</div>

<p>
Program GFM.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgad49a4e">(<span class="org-keyword">use-package</span> <span class="org-constant">markdown-mode</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">auto-mode-alist</span> <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">"\\.md\\'"</span> . gfm-mode))
  (<span class="org-keyword">setq</span> markdown-coding-system <span class="org-string">"utf-8"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-org80ee7f5" class="outline-4">
<h4 id="org80ee7f5"><span class="section-number-4">4.4.6</span> HTML</h4>
<div class="outline-text-4" id="text-4-4-6">
<pre class="example">
ID: org_gcr_2017-05-12_mara:5AE61C99-1862-456E-B6FA-44225675B208
</pre>

<p>
Load Htmlize for HTML export.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgab36e4c">(<span class="org-keyword">use-package</span> <span class="org-constant">htmlize</span>
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">setq</span> org-html-htmlize-output-type htmlize-output-type)
  (<span class="org-keyword">setq</span> htmlize-output-type <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">inline-css</span>)
  (<span class="org-keyword">defvar</span> <span class="org-variable-name">help/htmlize-initial-fci-state</span> nil
    <span class="org-doc">"Variable to store the state of `</span><span class="org-doc"><span class="org-constant">fci-mode</span></span><span class="org-doc">' upon calling `</span><span class="org-doc"><span class="org-constant">htmlize-buffer</span></span><span class="org-doc">'.</span>

<span class="org-doc">Attribution: URL `</span><span class="org-doc"><span class="org-constant">http://permalink.gmane.org/gmane.emacs.orgmode/98153</span></span><span class="org-doc">'."</span>)
  (<span class="org-keyword">defvar</span> <span class="org-variable-name">help/htmlize-initial-flyspell-state</span> nil
    <span class="org-doc">"Variable to store the state of `</span><span class="org-doc"><span class="org-constant">flyspell-mode</span></span><span class="org-doc">' upon calling `</span><span class="org-doc"><span class="org-constant">htmlize-buffer</span></span><span class="org-doc">'.</span>

<span class="org-doc">Attribution: URL `</span><span class="org-doc"><span class="org-constant">http://permalink.gmane.org/gmane.emacs.orgmode/98153</span></span><span class="org-doc">'."</span>)

  (<span class="org-keyword">defun</span> <span class="org-function-name">help/htmlize-before-hook-fn</span> ()
    (<span class="org-keyword">when</span> (fboundp <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">fci-mode</span>)
      (<span class="org-keyword">setq</span> help/htmlize-initial-fci-state fci-mode)
      (<span class="org-keyword">when</span> fci-mode
        (fci-mode -1))))
  (add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">htmlize-before-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/htmlize-before-hook-fn</span>)

  (<span class="org-keyword">defun</span> <span class="org-function-name">help/htmlize-after-hook-fn</span> ()
    (<span class="org-keyword">when</span> (fboundp <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">fci-mode</span>)
      (<span class="org-keyword">when</span> help/htmlize-initial-fci-state
        (fci-mode t))))
  (add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">htmlize-after-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/htmlize-after-hook-fn</span>))
</pre>
</div>

<p>
Use in-line CSS.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgf58bb5a">(<span class="org-keyword">setq</span> org-html-doctype <span class="org-string">"html5"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgac6f748" class="outline-4">
<h4 id="orgac6f748"><span class="section-number-4">4.4.7</span> ASCII</h4>
<div class="outline-text-4" id="text-4-4-7">
<pre class="example">
ID: org_gcr_2017-05-12_mara:7BEBFA9B-E445-41F3-ABC6-08AFB3020D30
</pre>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org4402d13">(<span class="org-keyword">setq</span> org-ascii-text-width 80)
(<span class="org-keyword">setq</span> org-ascii-global-margin 0)
</pre>
</div>

<p>
Show non-ascii characters
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orge58afeb">(<span class="org-keyword">defun</span> <span class="org-function-name">help/occur-non-ascii</span> ()
  <span class="org-doc">"Find any non-ascii characters in the current buffer.</span>
<span class="org-doc">Attribution: URL `</span><span class="org-doc"><span class="org-constant">https://www.emacswiki.org/emacs/FindingNonAsciiCharacters</span></span><span class="org-doc">'"</span>
  (<span class="org-keyword">interactive</span>)
  (occur <span class="org-string">"[</span><span class="org-string"><span class="org-negation-char">^</span></span><span class="org-string">[:ascii:]]"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbbe1dd5" class="outline-4">
<h4 id="orgbbe1dd5"><span class="section-number-4">4.4.8</span> Beamer</h4>
<div class="outline-text-4" id="text-4-4-8">
<pre class="example">
ID: org_gcr_2017-05-12_mara:1D459BA8-B1B0-40B9-B733-6B59216FD1B2
</pre>

<p>
Load Beamer for creating presentations.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgb37be1d">(<span class="org-keyword">use-package</span> <span class="org-constant">ox-beamer</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org3e055be" class="outline-4">
<h4 id="org3e055be"><span class="section-number-4">4.4.9</span> Screenwriting</h4>
<div class="outline-text-4" id="text-4-4-9">
<pre class="example">
ID: org_gcr_2017-05-12_mara:AE18CBCE-F03C-4422-AAC8-E1E2C76A7C5E
</pre>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org3332513">(<span class="org-keyword">use-package</span> <span class="org-constant">fountain-mode</span>
  <span class="org-builtin">:config</span>
  (add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">auto-mode-alist</span> <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">"\\.fountain$"</span> . fountain-mode))
  (<span class="org-keyword">let</span> ((fountain-stx <span class="org-highlight-quoted-quote">'</span>(
                        <span class="org-string">"CONT'D"</span>
                        <span class="org-string">"CROSSFADE"</span>
                        <span class="org-string">"FLASHCUTS"</span>
                        <span class="org-string">"FLASHFORWARD"</span>
                        <span class="org-string">"INTERCUT"</span>
                        <span class="org-string">"PRE"</span>
                        <span class="org-string">"PRELAP"</span>
                        )))
    (mapc (<span class="org-keyword">lambda</span> (stx) (add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">ispell-skip-region-alist</span> (list stx)))
          fountain-stx)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd18c442" class="outline-4">
<h4 id="orgd18c442"><span class="section-number-4">4.4.10</span> Reveal.js</h4>
<div class="outline-text-4" id="text-4-4-10">
<pre class="example">
ID: org_gcr_2017-05-19_mara:73719624-5BA9-4000-B70C-77C30CAB592B
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org60c5daf">(<span class="org-keyword">use-package</span> <span class="org-constant">ox-reveal</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">setq</span> org-reveal-root (expand-file-name <span class="org-string">"~/src/reveal.js"</span>)))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgd0b26fd" class="outline-3">
<h3 id="orgd0b26fd"><span class="section-number-3">4.5</span> DevOps</h3>
<div class="outline-text-3" id="text-4-5">
<pre class="example">
ID: org_gcr_2017-05-12_mara:F79C9679-7887-40B8-8882-51EE6EC1BDE2
</pre>
</div>
<div id="outline-container-org21d97d2" class="outline-4">
<h4 id="org21d97d2"><span class="section-number-4">4.5.1</span> Shell Script</h4>
<div class="outline-text-4" id="text-4-5-1">
<pre class="example">
ID: org_gcr_2017-05-12_mara:68AC26B4-B52C-4A1F-AF1E-78AFE5A3D91D
</pre>
</div>
<ol class="org-ol">
