help.org
**** Editing
:PROPERTIES:
:ID:       org_gcr_2017-07-16_mara:D2B25F16-8384-4641-A2C0-C9D987A83E10
:END:
This ~Bash~ IDE appears less valuable because it automatically inherits its
best features unseen here (you are looking at the rest below this big block):
- Standard programming configuration
- ~ShellCheck~ integration
- Default to Bash
- Smart Hashbang line generation


#+NAME: org_gcr_2017-07-16_mara_FB8AD647-F0FA-4004-B930-A9CD97E97900
#+BEGIN_SRC emacs-lisp
(use-package sh-script
  :config
  (defun help/sh-mode-hook-fn ()
    (interactive)
    (setq sh-shell "bash")
    (setq sh-basic-offset 2))
  (add-hook 'sh-mode-hook #'help/sh-mode-hook-fn))
#+END_SRC

Toggle string quotes between single and double.

#+NAME: org_gcr_2017-07-16_mara_05CFE4C1-3363-42A3-A517-9A961282BB19
#+BEGIN_SRC emacs-lisp
(use-package toggle-quotes
  :ensure t
  :config
  (define-key sh-mode-map (kbd "C-'") #'toggle-quotes))
#+END_SRC

Sh-Mode Hydra.

#+NAME: org_gcr_2017-07-16_mara_B4B1E9B3-3146-46AA-80C8-20B28C352E55
#+BEGIN_SRC emacs-lisp
(defhydra help/hydra-sh-mode (:color blue
                                     :hint nil)
  "
sh-mode:
 _i_ insert #!-line
  _q_ quit
"
  ("i" sh-set-shell)
  ("q" nil))
(key-chord-define sh-mode-map "hh" #'help/hydra-sh-mode/body)
#+END_SRC
*** Make
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:4EC46A0A-2D59-4C21-8013-6A86CD46BC5F
   :END:
*** Vagrant
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:D8A25DB9-FFAD-4C06-95C8-948AB0AFC4DE
   :END:

~ruby-mode~ supports =Vagrantfile= OOTB.

*** Apache
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:719B95DC-1AF2-4581-BDEB-FC2430EAE076
:END:

#+NAME: org_gcr_2017-05-12_mara_96443D6C-1E5B-48C5-9853-544D0EE79B1E
#+BEGIN_SRC emacs-lisp
(use-package apache-mode
  :ensure t)
#+END_SRC

*** SSH
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:EF50829C-C6BA-4D22-ACD0-5386EF38155D
:END:

#+NAME: org_gcr_2017-05-12_mara_D12C607E-C07C-41F8-A0B0-02A228C7AED7
#+BEGIN_SRC emacs-lisp
(use-package ssh-config-mode
  :ensure t
  :mode (("/\\.ssh/config\\'"     . ssh-config-mode)
         ("/sshd?_config\\'"      . ssh-config-mode)
         ("/known_hosts\\'"       . ssh-known-hosts-mode)
         ("/authorized_keys2?\\'" . ssh-authorized-keys-mode))
  :config
  (add-hook 'ssh-config-mode-hook #'turn-on-font-lock)
  (add-hook 'ssh-config-mode-hook #'help/text-mode-fn))
#+END_SRC

*** CRON
:PROPERTIES:
:ID:       org_gcr_2017-06-13_mara:9B3AB875-4459-4EC7-A7C5-4C32EC3A5E18
:END:
#+NAME: org_gcr_2017-06-13_mara_350A94E2-4280-4D5E-BB58-24887D9A57CD
#+BEGIN_SRC emacs-lisp
(use-package crontab-mode
  :ensure t
  :config
  (add-to-list 'auto-mode-alist '("\\.cron\\(tab\\)?\\'" . crontab-mode))
  (add-hook 'crontab-mode-hook #'turn-on-stripe-buffer-mode))
#+END_SRC
** Multimedia
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:D3EE5DB5-EC7B-4D7C-9749-1BC351B8214D
   :END:
*** Artist
  :PROPERTIES:
  :ID:       org_gcr_2017-05-12_mara:4C5A0835-B5EE-4248-A04A-5F1E90FDC308
  :END:

#+NAME: org_gcr_2017-05-12_mara_AF516C01-3152-4194-954B-91A44A429972
#+BEGIN_SRC emacs-lisp
(add-to-list 'auto-mode-alist '("\\.asc" . artist-mode))
(add-to-list 'auto-mode-alist '("\\.art" . artist-mode))
(add-to-list 'auto-mode-alist '("\\.asc" . artist-mode))
#+END_SRC

*** DITAA
  :PROPERTIES:
  :ID:       org_gcr_2017-05-12_mara:6D7CE54F-D123-4C90-BFB6-374B2ACB1D1C
  :END:

#+NAME: org_gcr_2017-05-12_mara_9D0BBF2C-BB7C-4B72-BA10-0B497FE8CAA1
#+BEGIN_SRC emacs-lisp :wrap "RESULTS"
(defconst help/ditaa-jar (getenv "DITAA"))
(setq org-ditaa-jar-path help/ditaa-jar)
#+END_SRC

*** Graphviz
  :PROPERTIES:
  :ID:       org_gcr_2017-05-12_mara:8523DEE7-31C4-445A-B300-4923BCA3F7D7
  :END:

#+NAME: org_gcr_2017-05-12_mara_362D21E8-3D98-4905-8942-A146C4A555D1
#+BEGIN_SRC emacs-lisp :wrap "RESULTS"
(use-package graphviz-dot-mode
  :ensure t
  :config
  (setf (cdr (assoc "dot" org-src-lang-modes)) 'graphviz-dot))
#+END_SRC

*** PlantUML
  :PROPERTIES:
  :ID:       org_gcr_2017-05-12_mara:1AE2633B-E811-4117-ACE7-0D7D2F88EDEB
  :END:

#+NAME: org_gcr_2017-05-12_mara_91D0CFDF-6FC2-4F4A-9CFC-825CED0061B6
#+BEGIN_SRC emacs-lisp
(use-package plantuml-mode
  :ensure t
  :init
  (defconst help/plantuml-jar (getenv "PLANTUML"))
  (setq plantuml-jar-path help/plantuml-jar)
  :config
  (eval-after-load "ob-plantuml"
    (setq org-plantuml-jar-path help/plantuml-jar)))
#+END_SRC

*** X PixMap (XPM)
:PROPERTIES:
:ID:       org_gcr_2017-06-25_mara:53D58BE5-1E7D-4E75-8359-AF7EF001CE2B
:END:
[[https://en.wikipedia.org/wiki/X_PixMap][X PixMap (XPM)]]

Emacs' provide editing support.

#+NAME: org_gcr_2017-06-25_mara_B33E6DF0-8A18-4DBA-A39D-B16649F6E793
#+BEGIN_SRC emacs-lisp
(use-package xpm
  :ensure t)
#+END_SRC
