help.html
<li><a id="org60c3fde"></a>Editing<br>
<div class="outline-text-5" id="text-4-5-1-1">
<pre class="example">
ID: org_gcr_2017-07-16_mara:D2B25F16-8384-4641-A2C0-C9D987A83E10
</pre>
<p>
This <code>Bash</code> IDE appears less valuable because it automatically inherits its
best features unseen here (you are looking at the rest below this big block):
</p>
<ul class="org-ul">
<li>Standard programming configuration</li>
<li><code>ShellCheck</code> integration</li>
<li>Default to Bash</li>
<li>Smart Hashbang line generation</li>
</ul>


<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org3d15f7e">(<span class="org-keyword">use-package</span> <span class="org-constant">sh-script</span>
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">defun</span> <span class="org-function-name">help/sh-mode-hook-fn</span> ()
    (<span class="org-keyword">interactive</span>)
    (<span class="org-keyword">setq</span> sh-shell <span class="org-string">"bash"</span>)
    (<span class="org-keyword">setq</span> sh-basic-offset 2))
  (add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">sh-mode-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/sh-mode-hook-fn</span>))
</pre>
</div>

<p>
Toggle string quotes between single and double.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org7ccea0e">(<span class="org-keyword">use-package</span> <span class="org-constant">toggle-quotes</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (define-key sh-mode-map (kbd <span class="org-string">"C-'"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">toggle-quotes</span>))
</pre>
</div>

<p>
Sh-Mode Hydra.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgb573a8b">(<span class="org-keyword">defhydra</span> help/hydra-sh-mode (<span class="org-builtin">:color</span> <span class="custom-1"><span class="custom">blue</span></span>
                                     <span class="org-builtin">:hint</span> nil)
  <span class="org-doc">"</span>
<span class="org-doc">sh-mode:</span>
<span class="org-doc"> _i_ insert #!-line</span>
<span class="org-doc">  _q_ quit</span>
<span class="org-doc">"</span>
  (<span class="org-string">"i"</span> sh-set-shell)
  (<span class="org-string">"q"</span> nil))
(key-chord-define sh-mode-map <span class="org-string">"hh"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/hydra-sh-mode/body</span>)
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgcb160e2" class="outline-4">
<h4 id="orgcb160e2"><span class="section-number-4">4.5.2</span> Make</h4>
<div class="outline-text-4" id="text-4-5-2">
<pre class="example">
ID: org_gcr_2017-05-12_mara:4EC46A0A-2D59-4C21-8013-6A86CD46BC5F
</pre>
</div>
</div>
<div id="outline-container-org555d7d9" class="outline-4">
<h4 id="org555d7d9"><span class="section-number-4">4.5.3</span> Vagrant</h4>
<div class="outline-text-4" id="text-4-5-3">
<pre class="example">
ID: org_gcr_2017-05-12_mara:D8A25DB9-FFAD-4C06-95C8-948AB0AFC4DE
</pre>

<p>
<code>ruby-mode</code> supports <code>Vagrantfile</code> OOTB.
</p>
</div>
</div>

<div id="outline-container-org82163b1" class="outline-4">
<h4 id="org82163b1"><span class="section-number-4">4.5.4</span> Apache</h4>
<div class="outline-text-4" id="text-4-5-4">
<pre class="example">
ID: org_gcr_2017-05-12_mara:719B95DC-1AF2-4581-BDEB-FC2430EAE076
</pre>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgaa6ba1c">(<span class="org-keyword">use-package</span> <span class="org-constant">apache-mode</span>
  <span class="org-builtin">:ensure</span> t)
</pre>
</div>
</div>
</div>

<div id="outline-container-org61eca80" class="outline-4">
<h4 id="org61eca80"><span class="section-number-4">4.5.5</span> SSH</h4>
<div class="outline-text-4" id="text-4-5-5">
<pre class="example">
ID: org_gcr_2017-05-12_mara:EF50829C-C6BA-4D22-ACD0-5386EF38155D
</pre>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org466ba07">(<span class="org-keyword">use-package</span> <span class="org-constant">ssh-config-mode</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:mode</span> ((<span class="org-string">"/\\.ssh/config\\'"</span>     . ssh-config-mode)
         (<span class="org-string">"/sshd?_config\\'"</span>      . ssh-config-mode)
         (<span class="org-string">"/known_hosts\\'"</span>       . ssh-known-hosts-mode)
         (<span class="org-string">"/authorized_keys2?\\'"</span> . ssh-authorized-keys-mode))
  <span class="org-builtin">:config</span>
  (add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">ssh-config-mode-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">turn-on-font-lock</span>)
  (add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">ssh-config-mode-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/text-mode-fn</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-org1b2099f" class="outline-4">
<h4 id="org1b2099f"><span class="section-number-4">4.5.6</span> CRON</h4>
<div class="outline-text-4" id="text-4-5-6">
<pre class="example">
ID: org_gcr_2017-06-13_mara:9B3AB875-4459-4EC7-A7C5-4C32EC3A5E18
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org3ca2a42">(<span class="org-keyword">use-package</span> <span class="org-constant">crontab-mode</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">auto-mode-alist</span> <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">"\\.cron</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">tab</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">?\\'"</span> . crontab-mode))
  (add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">crontab-mode-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">turn-on-stripe-buffer-mode</span>))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgd70078e" class="outline-3">
<h3 id="orgd70078e"><span class="section-number-3">4.6</span> Multimedia</h3>
<div class="outline-text-3" id="text-4-6">
<pre class="example">
ID: org_gcr_2017-05-12_mara:D3EE5DB5-EC7B-4D7C-9749-1BC351B8214D
</pre>
</div>
<div id="outline-container-org8c21cb7" class="outline-4">
<h4 id="org8c21cb7"><span class="section-number-4">4.6.1</span> Artist</h4>
<div class="outline-text-4" id="text-4-6-1">
<pre class="example">
ID: org_gcr_2017-05-12_mara:4C5A0835-B5EE-4248-A04A-5F1E90FDC308
</pre>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org940a689">(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">auto-mode-alist</span> <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">"\\.asc"</span> . artist-mode))
(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">auto-mode-alist</span> <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">"\\.art"</span> . artist-mode))
(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">auto-mode-alist</span> <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">"\\.asc"</span> . artist-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org034316f" class="outline-4">
<h4 id="org034316f"><span class="section-number-4">4.6.2</span> DITAA</h4>
<div class="outline-text-4" id="text-4-6-2">
<pre class="example">
ID: org_gcr_2017-05-12_mara:6D7CE54F-D123-4C90-BFB6-374B2ACB1D1C
</pre>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org630f5d1">(<span class="org-keyword">defconst</span> <span class="org-variable-name">help/ditaa-jar</span> (getenv <span class="org-string">"DITAA"</span>))
(<span class="org-keyword">setq</span> org-ditaa-jar-path help/ditaa-jar)
</pre>
</div>
</div>
</div>

<div id="outline-container-org10d31f9" class="outline-4">
<h4 id="org10d31f9"><span class="section-number-4">4.6.3</span> Graphviz</h4>
<div class="outline-text-4" id="text-4-6-3">
<pre class="example">
ID: org_gcr_2017-05-12_mara:8523DEE7-31C4-445A-B300-4923BCA3F7D7
</pre>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orga89230e">(<span class="org-keyword">use-package</span> <span class="org-constant">graphviz-dot-mode</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">setf</span> (cdr (assoc <span class="org-string">"dot"</span> org-src-lang-modes)) <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">graphviz-dot</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-org71af76d" class="outline-4">
<h4 id="org71af76d"><span class="section-number-4">4.6.4</span> PlantUML</h4>
<div class="outline-text-4" id="text-4-6-4">
<pre class="example">
ID: org_gcr_2017-05-12_mara:1AE2633B-E811-4117-ACE7-0D7D2F88EDEB
</pre>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgbf5b8fe">(<span class="org-keyword">use-package</span> <span class="org-constant">plantuml-mode</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">defconst</span> <span class="org-variable-name">help/plantuml-jar</span> (getenv <span class="org-string">"PLANTUML"</span>))
  (<span class="org-keyword">setq</span> plantuml-jar-path help/plantuml-jar)
  <span class="org-builtin">:config</span>
  (eval-after-load <span class="org-string">"ob-plantuml"</span>
    (<span class="org-keyword">setq</span> org-plantuml-jar-path help/plantuml-jar)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org7566ee7" class="outline-4">
<h4 id="org7566ee7"><span class="section-number-4">4.6.5</span> X PixMap (XPM)</h4>
<div class="outline-text-4" id="text-4-6-5">
<pre class="example">
ID: org_gcr_2017-06-25_mara:53D58BE5-1E7D-4E75-8359-AF7EF001CE2B
</pre>
<p>
<a href="https://en.wikipedia.org/wiki/X_PixMap">X PixMap (XPM)</a>
</p>

<p>
Emacs&rsquo; provide editing support.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org0863b6a">(<span class="org-keyword">use-package</span> <span class="org-constant">xpm</span>
  <span class="org-builtin">:ensure</span> t)
</pre>
</div>
</div>
</div>
</div>
