help.org
** Computer-aided design
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:50E7A50A-4259-4B6C-8612-99671C6723CC
:END:
*** OpenSCAD
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:423A1845-3D84-45FB-8373-509033537F86
:END:

#+NAME: org_gcr_2017-05-12_mara_70B524CE-27DC-41D1-BB27-99FFE334B40B
#+BEGIN_SRC emacs-lisp
(use-package scad-mode
  :ensure t)
#+END_SRC
** Special
:PROPERTIES:
:ID:       org_gcr_2017-06-25_mara:BEC7C2AA-4602-4F1C-8AE5-2DAD6439C90F
:END:
~messages-mode~ inherits ~special-mode~ hooks but it didn't get stripe buffered so
I'm trying to set it up here with ~message-mode-hook~ but that didn't work either
* Quiet and Pleasant Appearance
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:298AA1C9-5745-464F-92A6-2FB04EFB079E
   :END:

Configure EMACS to personal-taste for "noise" and "form".

** Key Press
:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:EBAA168D-C2E9-40E3-B448-9AA076802029
:END:

Make key-presses sound like the ground-breaking Selectric typewriter.

#+NAME: org_gcr_2017-05-12_mara_7939B6EA-A76B-4A2A-B1B3-4EB1FEE2D9C2
#+BEGIN_SRC emacs-lisp
(use-package selectric-mode
  :ensure t)
#+END_SRC

** Line Number
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:5FFDA284-6C92-40C8-B23E-E345940DC6C4
   :END:

The nlinum gutter should not "shift" as it transitions between line numbers of
different magnitudes. For example going from line 99 to 100 will shift the
buffer contents by one character. That is distracting and interrupts the flow.
- Switched to ~nlinum~ from ~linum~ because of slowness with this file when headings
  are collapsed

Most files will be less than 100,000 lines.

#+NAME: org_gcr_2017-05-12_mara_7F3AF752-B4D1-4B55-85EC-C5E9B8DC13B9
#+BEGIN_SRC emacs-lisp
(use-package nlinum
  :ensure t
  :config
  (setq nlinum-format "%05d"))
#+END_SRC

** Buffer
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:4A3C9150-EC66-4462-B14A-92C8BE34FB94
   :END:

Never automatically convert the end of the line character. For most of us this
is between UNIX and DOS.

#+NAME: org_gcr_2017-05-12_mara_B1FCEF49-334F-4F64-B96F-A888ABE84BB0
#+BEGIN_SRC emacs-lisp
(setq inhibit-eol-conversion t)
#+END_SRC

Give buffers backed by identically named files distinguishable names.

#+NAME: org_gcr_2017-05-12_mara_5D771C42-CAAF-439D-BEC1-5A6559D168D2
#+BEGIN_SRC emacs-lisp
(use-package uniquify)
(setq uniquify-buffer-name-style 'forward)
#+END_SRC

Don't use audible bells, use visual bells.

#+NAME: org_gcr_2017-05-12_mara_C5DA95E6-0F38-450E-96C8-6CED005DE0D1
#+BEGIN_SRC emacs-lisp
(setq ring-bell-function 'ignore)
(setq visible-bell t)
#+END_SRC

Highlight s-expressions.

#+NAME: org_gcr_2017-05-12_mara_F6E5E796-E1A4-4599-B6D1-F0729C1619A0
#+BEGIN_SRC emacs-lisp
(setq blink-matching-paren nil)
(show-paren-mode)
(setq show-paren-delay 0)
(setq show-paren-style 'expression)
#+END_SRC

The cursor should not blink and distract you. On a graphic display make the
cursor a box and stretch it as wide as the character below it.

#+NAME: org_gcr_2017-05-12_mara_DD79CB65-2F96-40DD-8BD8-BECDCE8CD399
#+BEGIN_SRC emacs-lisp
(blink-cursor-mode 0)
(help/on-gui
 (setq-default cursor-type 'box)
 (setq x-stretch-cursor 1))
#+END_SRC

EMACS used UTF-8 by default. Make copying and pasting easier.

#+NAME: org_gcr_2017-05-12_mara_0BCAB755-9914-473F-9543-37130529809F
#+BEGIN_SRC emacs-lisp
(prefer-coding-system 'utf-8)
(help/on-gui
 (setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING))
 (help/on-windows
  (set-clipboard-coding-system 'utf-16le-dos)))
#+END_SRC

Make it very easy to see the line with the cursor.

#+NAME: org_gcr_2017-05-12_mara_C53AF7AE-494C-4916-83C8-F175554B1CAE
#+BEGIN_SRC emacs-lisp
(global-hl-line-mode t)
#+END_SRC

Make it very easy to input special-characters using TeX coding.

#+NAME: org_gcr_2017-05-12_mara_8B8F5CDF-A2FF-49C3-8DB1-3551942F7573
#+BEGIN_SRC emacs-lisp
(setq default-input-method 'TeX)
#+END_SRC

Automatically Copy Text Selected With The Mouse [[http://pragmaticemacs.com/emacs/automatically-copy-text-selected-with-the-mouse/][via]].

#+NAME: org_gcr_2017-05-12_mara_DD49BAEE-1C39-40E1-93B5-9CBDCD5E284A
#+BEGIN_SRC emacs-lisp
(setq mouse-drag-copy-region t)
#+END_SRC

The macro recorder and Multiple-Cursors provide two ways to do the right thing
in different situations. Be very thoughtful and allow every function. My
configuration /barely/ utilizes MC because I use all that I can handle right
now.

#+NAME: org_gcr_2017-05-12_mara_828D7008-4B78-44AE-B5B7-15B60B03B3A6
#+BEGIN_SRC emacs-lisp
(use-package multiple-cursors
  :ensure t
  :config
  (setq mc/always-run-for-all t))
#+END_SRC

Recenter near top of screen.

#+NAME: org_gcr_2017-05-12_mara_AA76B6F1-AC3F-42D8-B321-2BD1B05DDE2C
#+BEGIN_SRC emacs-lisp
(defun help/recenter-line-near-top-fn ()
  "Move current line near top"
  (interactive)
  (let ((recenter-positions '(5)))
    (recenter-top-bottom)))
#+END_SRC
** Color Theme
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:3C38AF9D-1905-4B33-A4F5-065D17E9B647
   :END:

[[https://github.com/bbatsov/solarized-emacs][Solarized Theme]]

- ~1,000 Faces Defined
- 110,003

- A distinct fringe provides a definition of space.
- The modeline is always at the bottom and doesn't need differentiation.
- Minimize bold and italic faces.
- Minimize fringe indicators.

#+NAME: org_gcr_2017-05-12_mara_1AD36955-5FAC-4794-A9B0-A8DC6639A04C
#+BEGIN_SRC emacs-lisp
(use-package solarized-theme
  :ensure t
  :config
  (setq solarized-distinct-fringe-background t)
  (setq solarized-use-variable-pitch nil)
  (setq solarized-use-less-bold t)
  (setq solarized-use-more-italic nil)
  (setq solarized-emphasize-indicators nil)
  (setq solarized-scale-org-headlines t)
  (load-theme 'solarized-dark t)
  (eval-after-load "smart-mode-line"
    '(sml/setup)))
#+END_SRC

