help.html
<div id="outline-container-orgd751019" class="outline-3">
<h3 id="orgd751019"><span class="section-number-3">4.7</span> Computer-aided design</h3>
<div class="outline-text-3" id="text-4-7">
<pre class="example">
ID: org_gcr_2017-05-12_mara:50E7A50A-4259-4B6C-8612-99671C6723CC
</pre>
</div>
<div id="outline-container-org87df2c2" class="outline-4">
<h4 id="org87df2c2"><span class="section-number-4">4.7.1</span> OpenSCAD</h4>
<div class="outline-text-4" id="text-4-7-1">
<pre class="example">
ID: org_gcr_2017-05-12_mara:423A1845-3D84-45FB-8373-509033537F86
</pre>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgb01b5a4">(<span class="org-keyword">use-package</span> <span class="org-constant">scad-mode</span>
  <span class="org-builtin">:ensure</span> t)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org1150c19" class="outline-3">
<h3 id="org1150c19"><span class="section-number-3">4.8</span> Special</h3>
<div class="outline-text-3" id="text-4-8">
<pre class="example">
ID: org_gcr_2017-06-25_mara:BEC7C2AA-4602-4F1C-8AE5-2DAD6439C90F
</pre>
<p>
<code>messages-mode</code> inherits <code>special-mode</code> hooks but it didn&rsquo;t get stripe buffered so
I&rsquo;m trying to set it up here with <code>message-mode-hook</code> but that didn&rsquo;t work either
</p>
</div>
</div>
</div>
<div id="outline-container-orgc8fa32f" class="outline-2">
<h2 id="orgc8fa32f"><span class="section-number-2">5</span> Quiet and Pleasant Appearance</h2>
<div class="outline-text-2" id="text-5">
<pre class="example">
ID: org_gcr_2017-05-12_mara:298AA1C9-5745-464F-92A6-2FB04EFB079E
</pre>

<p>
Configure EMACS to personal-taste for &ldquo;noise&rdquo; and &ldquo;form&rdquo;.
</p>
</div>

<div id="outline-container-orgc9e08b5" class="outline-3">
<h3 id="orgc9e08b5"><span class="section-number-3">5.1</span> Key Press</h3>
<div class="outline-text-3" id="text-5-1">
<pre class="example">
ID: org_gcr_2017-05-12_mara:EBAA168D-C2E9-40E3-B448-9AA076802029
</pre>

<p>
Make key-presses sound like the ground-breaking Selectric typewriter.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org623d88c">(<span class="org-keyword">use-package</span> <span class="org-constant">selectric-mode</span>
  <span class="org-builtin">:ensure</span> t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf18ed7c" class="outline-3">
<h3 id="orgf18ed7c"><span class="section-number-3">5.2</span> Line Number</h3>
<div class="outline-text-3" id="text-5-2">
<pre class="example">
ID: org_gcr_2017-05-12_mara:5FFDA284-6C92-40C8-B23E-E345940DC6C4
</pre>

<p>
The nlinum gutter should not &ldquo;shift&rdquo; as it transitions between line numbers of
different magnitudes. For example going from line 99 to 100 will shift the
buffer contents by one character. That is distracting and interrupts the flow.
</p>
<ul class="org-ul">
<li>Switched to <code>nlinum</code> from <code>linum</code> because of slowness with this file when headings
are collapsed</li>
</ul>

<p>
Most files will be less than 100,000 lines.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org955955e">(<span class="org-keyword">use-package</span> <span class="org-constant">nlinum</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">setq</span> nlinum-format <span class="org-string">"%05d"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-org5f73c50" class="outline-3">
<h3 id="org5f73c50"><span class="section-number-3">5.3</span> Buffer</h3>
<div class="outline-text-3" id="text-5-3">
<pre class="example">
ID: org_gcr_2017-05-12_mara:4A3C9150-EC66-4462-B14A-92C8BE34FB94
</pre>

<p>
Never automatically convert the end of the line character. For most of us this
is between UNIX and DOS.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgf7566cb">(<span class="org-keyword">setq</span> inhibit-eol-conversion t)
</pre>
</div>

<p>
Give buffers backed by identically named files distinguishable names.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org190a967">(<span class="org-keyword">use-package</span> <span class="org-constant">uniquify</span>)
(<span class="org-keyword">setq</span> uniquify-buffer-name-style <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">forward</span>)
</pre>
</div>

<p>
Don&rsquo;t use audible bells, use visual bells.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgdd7dd17">(<span class="org-keyword">setq</span> ring-bell-function <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">ignore</span>)
(<span class="org-keyword">setq</span> visible-bell t)
</pre>
</div>

<p>
Highlight s-expressions.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org7337f65">(<span class="org-keyword">setq</span> blink-matching-paren nil)
(show-paren-mode)
(<span class="org-keyword">setq</span> show-paren-delay 0)
(<span class="org-keyword">setq</span> show-paren-style <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">expression</span>)
</pre>
</div>

<p>
The cursor should not blink and distract you. On a graphic display make the
cursor a box and stretch it as wide as the character below it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org444e57a">(blink-cursor-mode 0)
(<span class="org-keyword">help/on-gui</span>
 (<span class="org-keyword">setq-default</span> cursor-type <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">box</span>)
 (<span class="org-keyword">setq</span> x-stretch-cursor 1))
</pre>
</div>

<p>
EMACS used UTF-8 by default. Make copying and pasting easier.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orge3bf774">(prefer-coding-system <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">utf-8</span>)
(<span class="org-keyword">help/on-gui</span>
 (<span class="org-keyword">setq</span> x-select-request-type <span class="org-highlight-quoted-quote">'</span>(UTF8_STRING COMPOUND_TEXT TEXT STRING))
 (<span class="org-keyword">help/on-windows</span>
  (set-clipboard-coding-system <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">utf-16le-dos</span>)))
</pre>
</div>

<p>
Make it very easy to see the line with the cursor.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org268c31e">(global-hl-line-mode t)
</pre>
</div>

<p>
Make it very easy to input special-characters using TeX coding.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org37b679e">(<span class="org-keyword">setq</span> default-input-method <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">TeX</span>)
</pre>
</div>

<p>
Automatically Copy Text Selected With The Mouse <a href="http://pragmaticemacs.com/emacs/automatically-copy-text-selected-with-the-mouse/">via</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org2d7745b">(<span class="org-keyword">setq</span> mouse-drag-copy-region t)
</pre>
</div>

<p>
The macro recorder and Multiple-Cursors provide two ways to do the right thing
in different situations. Be very thoughtful and allow every function. My
configuration <i>barely</i> utilizes MC because I use all that I can handle right
now.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org3dd6663">(<span class="org-keyword">use-package</span> <span class="org-constant">multiple-cursors</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">setq</span> mc/always-run-for-all t))
</pre>
</div>

<p>
Recenter near top of screen.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org55d9ae9">(<span class="org-keyword">defun</span> <span class="org-function-name">help/recenter-line-near-top-fn</span> ()
  <span class="org-doc">"Move current line near top"</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let</span> ((recenter-positions <span class="org-highlight-quoted-quote">'</span>(5)))
    (recenter-top-bottom)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org1ce8a4a" class="outline-3">
<h3 id="org1ce8a4a"><span class="section-number-3">5.4</span> Color Theme</h3>
<div class="outline-text-3" id="text-5-4">
<pre class="example">
ID: org_gcr_2017-05-12_mara:3C38AF9D-1905-4B33-A4F5-065D17E9B647
</pre>

<p>
<a href="https://github.com/bbatsov/solarized-emacs">Solarized Theme</a>
</p>

<ul class="org-ul">
<li>~1,000 Faces Defined</li>
<li>110,003</li>

<li>A distinct fringe provides a definition of space.</li>
<li>The modeline is always at the bottom and doesn&rsquo;t need differentiation.</li>
<li>Minimize bold and italic faces.</li>
<li>Minimize fringe indicators.</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org808c2b1">(<span class="org-keyword">use-package</span> <span class="org-constant">solarized-theme</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">setq</span> solarized-distinct-fringe-background t)
  (<span class="org-keyword">setq</span> solarized-use-variable-pitch nil)
  (<span class="org-keyword">setq</span> solarized-use-less-bold t)
  (<span class="org-keyword">setq</span> solarized-use-more-italic nil)
  (<span class="org-keyword">setq</span> solarized-emphasize-indicators nil)
  (<span class="org-keyword">setq</span> solarized-scale-org-headlines t)
  (load-theme <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">solarized-dark</span> t)
  (eval-after-load <span class="org-string">"smart-mode-line"</span>
    <span class="org-highlight-quoted-quote">'</span>(sml/setup)))
</pre>
</div>
</div>
</div>
