help.org
** Comint
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:EFB91C72-0036-49D8-B4B9-C7473C838E11
   :END:

=comint-mode= is only maybe the second most important thing for making Emacs
really, really special.

#+NAME: org_gcr_2017-05-12_mara_96BD218B-65E7-4ACA-98CE-108C3BFC29A3
#+begin_src emacs-lisp
(setq comint-scroll-to-bottom-on-input 'this)
(setq comint-scroll-to-bottom-on-output 'others)
(setq comint-move-point-for-output 'others)
(setq comint-show-maximum-output t)
(setq comint-scroll-show-maximum-output t)
(setq comint-move-point-for-output t)
#+end_src

This configuration had been working fine for a long time. The intent was for it
to be crystal clear that the prompt line in comint buffers would be read only.
This turned out to be a mistake; though I am not sure why, when, or how it
became a mistake. Nonetheless, this should be left alone. The way the issue here
manifested was that all R buffers opened by =ess= were 100% read only which
obviously is a *big issue* if you actually want to use! ROFL

#+NAME: org_gcr_2017-05-12_mara_F4517BF4-A876-4E3B-B636-9A60BED7174F
#+BEGIN_SRC emacs-lisp
(setq comint-prompt-read-only nil)
#+END_SRC

** Font
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:948F97ED-7FD3-4AC9-89D4-CB270CD0540C
   :END:

The best programming font is Deja Vu Sans Mono because it sans-serif and
support a lot of Unicode characters. Set it to a good default for an 80
character wide buffer and make it easy to adjust it.

#+NAME: org_gcr_2017-05-12_mara_6B639D09-DA18-40C5-ABA0-8647820507E6
#+BEGIN_SRC emacs-lisp
(help/on-gui
 (defvar help/font-size-current 10 "The preferred font size.")
 (help/on-osx (setq help/font-size-current 17))
 (help/on-windows (setq help/font-size-current 13))
 (defconst help/font-size-ideal help/font-size-current "The ideal font for this system.")
 (defconst help/font-base "DejaVu Sans Mono" "The preferred font name.")
 (defun help/font-ok-p ()
   "Is the configured font valid?"
   (interactive)
   (member help/font-base (font-family-list)))
 (defun help/font-name ()
   "Compute the font name and size string."
   (interactive)
   (let* ((size (number-to-string help/font-size-current))
          (name (concat help/font-base "-" size)))
     name))
 (defun help/update-font ()
   "Updates the current font given configuration values."
   (interactive)
   (if (help/font-ok-p)
       (progn
         (message "%s : Font Set" (help/font-name))
         (set-frame-font (help/font-name)))
     (message (concat "Your preferred font is not available: " help/font-base))))
 (defun help/font-size-reset ()
   "Restore the ideal font size."
   (interactive)
   (setq help/font-size-current help/font-size-ideal)
   (help/update-font))
 (help/update-font))
#+END_SRC

** Frame
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:8D473EA1-DFEE-408E-A1F5-AF1C7D03317D
   :END:
*** Inviting and familiar GUI features
:PROPERTIES:
:ID:       org_gcr_2017-06-23_mara:77B3D3E9-B7F7-44FB-8B82-A23CAC02C83B
:END:
Title.

#+NAME: org_gcr_2017-07-13_mara_A81CE2F3-CD06-40C9-AD1A-8AB74AB88016
#+BEGIN_SRC emacs-lisp
(setq frame-title-format '("" "%b - Super Text Editor "))
#+END_SRC
**** Bitmaps
:PROPERTIES:
:ID:       org_gcr_2017-07-11_mara:02FCF4D1-5613-49B3-A247-6BFA846D7EEA
:END:

Use local bitmaps.

#+NAME: org_gcr_2017-07-11_mara_27556B29-B77D-445F-8A54-00BDB89B452A
#+BEGIN_SRC emacs-lisp
(add-to-list 'image-load-path "~/src/help/xpm")
(add-to-list 'image-load-path "~/src/help/tiff")
#+END_SRC

Bitmap requirements
- 24x24 seems to be the most common dimension

Finding bitmaps
- Search for an existing bitmap [[https://commons.wikimedia.org/wiki/Category:Icons_by_subject][by subject]]
- Prefer SVG for flexibility
- [[https://github.com/encharm/Font-Awesome-SVG-PNG][Font Awesome]] seems like the best Font

Generating bitmaps
- By hand
  - Emacs already supports editing and visuaation
  - Gimp
- Convert SVG to XPM
  - Convert SVG to PNG
    #+BEGIN_EXAMPLE
rsvg-convert --width=24 --height=24 --format=png --keep-aspect-ratio --output new.png existing.svg
    #+END_EXAMPLE
  - Convert PNG to XPM
    #+BEGIN_EXAMPLE
convert new.png new.xpm
    #+END_EXAMPLE

Emacs added macOS support for TIFF. Emacs now prefers TIFF. XPM should work
everywhere so I want those to be the masters. They are the masters because
when I make corrections they go there. For example I had a 27x24 bitmap that I
had to trim to 24x24. So I converted XPMs to TIFF and use those.

**** Icons
:PROPERTIES:
:ID:       org_gcr_2017-07-11_mara:5E885B6C-66CF-4F58-8888-F257F4AB8AFA
:END:
Replace major mode lighters with icons.

#+NAME: org_gcr_2017-07-11_mara_90A13EAE-8941-4BDA-8937-DCE5759CBA5C
#+BEGIN_SRC emacs-lisp
(use-package mode-icons
  :ensure t
  :config
  (mode-icons-mode))
#+END_SRC
**** Menu bar
:PROPERTIES:
:ID:       org_gcr_2017-06-23_mara:47EF669D-E999-4573-AA5C-5CF038ADA870
:END:

Enable the menu bar.

#+NAME: org_gcr_2017-05-12_mara_03B4E8E1-083B-4F5D-A4A0-BAE8A0553FAF
#+BEGIN_SRC emacs-lisp
(menu-bar-mode nil)
#+END_SRC
