help.html

<div id="outline-container-org2e6e951" class="outline-3">
<h3 id="org2e6e951"><span class="section-number-3">5.5</span> Comint</h3>
<div class="outline-text-3" id="text-5-5">
<pre class="example">
ID: org_gcr_2017-05-12_mara:EFB91C72-0036-49D8-B4B9-C7473C838E11
</pre>

<p>
<code>comint-mode</code> is only maybe the second most important thing for making Emacs
really, really special.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org6f90ae6">(<span class="org-keyword">setq</span> comint-scroll-to-bottom-on-input <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">this</span>)
(<span class="org-keyword">setq</span> comint-scroll-to-bottom-on-output <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">others</span>)
(<span class="org-keyword">setq</span> comint-move-point-for-output <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">others</span>)
(<span class="org-keyword">setq</span> comint-show-maximum-output t)
(<span class="org-keyword">setq</span> comint-scroll-show-maximum-output t)
(<span class="org-keyword">setq</span> comint-move-point-for-output t)
</pre>
</div>

<p>
This configuration had been working fine for a long time. The intent was for it
to be crystal clear that the prompt line in comint buffers would be read only.
This turned out to be a mistake; though I am not sure why, when, or how it
became a mistake. Nonetheless, this should be left alone. The way the issue here
manifested was that all R buffers opened by <code>ess</code> were 100% read only which
obviously is a <b>big issue</b> if you actually want to use! ROFL
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org4ac1400">(<span class="org-keyword">setq</span> comint-prompt-read-only nil)
</pre>
</div>
</div>
</div>

<div id="outline-container-org6b3249c" class="outline-3">
<h3 id="org6b3249c"><span class="section-number-3">5.6</span> Font</h3>
<div class="outline-text-3" id="text-5-6">
<pre class="example">
ID: org_gcr_2017-05-12_mara:948F97ED-7FD3-4AC9-89D4-CB270CD0540C
</pre>

<p>
The best programming font is Deja Vu Sans Mono because it sans-serif and
support a lot of Unicode characters. Set it to a good default for an 80
character wide buffer and make it easy to adjust it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgddfaac7">(<span class="org-keyword">help/on-gui</span>
 (<span class="org-keyword">defvar</span> <span class="org-variable-name">help/font-size-current</span> 10 <span class="org-doc">"The preferred font size."</span>)
 (<span class="org-keyword">help/on-osx</span> (<span class="org-keyword">setq</span> help/font-size-current 17))
 (<span class="org-keyword">help/on-windows</span> (<span class="org-keyword">setq</span> help/font-size-current 13))
 (<span class="org-keyword">defconst</span> <span class="org-variable-name">help/font-size-ideal</span> help/font-size-current <span class="org-doc">"The ideal font for this system."</span>)
 (<span class="org-keyword">defconst</span> <span class="org-variable-name">help/font-base</span> <span class="org-string">"DejaVu Sans Mono"</span> <span class="org-doc">"The preferred font name."</span>)
 (<span class="org-keyword">defun</span> <span class="org-function-name">help/font-ok-p</span> ()
   <span class="org-doc">"Is the configured font valid?"</span>
   (<span class="org-keyword">interactive</span>)
   (member help/font-base (font-family-list)))
 (<span class="org-keyword">defun</span> <span class="org-function-name">help/font-name</span> ()
   <span class="org-doc">"Compute the font name and size string."</span>
   (<span class="org-keyword">interactive</span>)
   (<span class="org-keyword">let*</span> ((size (number-to-string help/font-size-current))
          (name (concat help/font-base <span class="org-string">"-"</span> size)))
     name))
 (<span class="org-keyword">defun</span> <span class="org-function-name">help/update-font</span> ()
   <span class="org-doc">"Updates the current font given configuration values."</span>
   (<span class="org-keyword">interactive</span>)
   (<span class="org-keyword">if</span> (help/font-ok-p)
       (<span class="org-keyword">progn</span>
         (message <span class="org-string">"%s : Font Set"</span> (help/font-name))
         (set-frame-font (help/font-name)))
     (message (concat <span class="org-string">"Your preferred font is not available: "</span> help/font-base))))
 (<span class="org-keyword">defun</span> <span class="org-function-name">help/font-size-reset</span> ()
   <span class="org-doc">"Restore the ideal font size."</span>
   (<span class="org-keyword">interactive</span>)
   (<span class="org-keyword">setq</span> help/font-size-current help/font-size-ideal)
   (help/update-font))
 (help/update-font))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf388008" class="outline-3">
<h3 id="orgf388008"><span class="section-number-3">5.7</span> Frame</h3>
<div class="outline-text-3" id="text-5-7">
<pre class="example">
ID: org_gcr_2017-05-12_mara:8D473EA1-DFEE-408E-A1F5-AF1C7D03317D
</pre>
</div>
<div id="outline-container-orgf54c580" class="outline-4">
<h4 id="orgf54c580"><span class="section-number-4">5.7.1</span> Inviting and familiar GUI features</h4>
<div class="outline-text-4" id="text-5-7-1">
<pre class="example">
ID: org_gcr_2017-06-23_mara:77B3D3E9-B7F7-44FB-8B82-A23CAC02C83B
</pre>
<p>
Title.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgddde414">(<span class="org-keyword">setq</span> frame-title-format <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">""</span> <span class="org-string">"%b - Super Text Editor "</span>))
</pre>
</div>
</div>
<ol class="org-ol">
<li><a id="org5500c6f"></a>Bitmaps<br>
<div class="outline-text-5" id="text-5-7-1-1">
<pre class="example">
ID: org_gcr_2017-07-11_mara:02FCF4D1-5613-49B3-A247-6BFA846D7EEA
</pre>

<p>
Use local bitmaps.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgcce9dc9">(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">image-load-path</span> <span class="org-string">"~/src/help/xpm"</span>)
(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">image-load-path</span> <span class="org-string">"~/src/help/tiff"</span>)
</pre>
</div>

<p>
Bitmap requirements
</p>
<ul class="org-ul">
<li>24x24 seems to be the most common dimension</li>
</ul>

<p>
Finding bitmaps
</p>
<ul class="org-ul">
<li>Search for an existing bitmap <a href="https://commons.wikimedia.org/wiki/Category:Icons_by_subject">by subject</a></li>
<li>Prefer SVG for flexibility</li>
<li><a href="https://github.com/encharm/Font-Awesome-SVG-PNG">Font Awesome</a> seems like the best Font</li>
</ul>

<p>
Generating bitmaps
</p>
<ul class="org-ul">
<li>By hand
<ul class="org-ul">
<li>Emacs already supports editing and visuaation</li>
<li>Gimp</li>
</ul></li>
<li>Convert SVG to XPM
<ul class="org-ul">
<li><p>
Convert SVG to PNG
</p>
<pre class="example">
rsvg-convert --width=24 --height=24 --format=png --keep-aspect-ratio --output new.png existing.svg
</pre></li>
<li><p>
Convert PNG to XPM
</p>
<pre class="example">
convert new.png new.xpm
</pre></li>
</ul></li>
</ul>

<p>
Emacs added macOS support for TIFF. Emacs now prefers TIFF. XPM should work
everywhere so I want those to be the masters. They are the masters because
when I make corrections they go there. For example I had a 27x24 bitmap that I
had to trim to 24x24. So I converted XPMs to TIFF and use those.
</p>
</div>
</li>

<li><a id="org07b6b20"></a>Icons<br>
<div class="outline-text-5" id="text-5-7-1-2">
<pre class="example">
ID: org_gcr_2017-07-11_mara:5E885B6C-66CF-4F58-8888-F257F4AB8AFA
</pre>
<p>
Replace major mode lighters with icons.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgf50bfd2">(<span class="org-keyword">use-package</span> <span class="org-constant">mode-icons</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (mode-icons-mode))
</pre>
</div>
</div>
</li>
<li><a id="orgaf490aa"></a>Menu bar<br>
<div class="outline-text-5" id="text-5-7-1-3">
<pre class="example">
ID: org_gcr_2017-06-23_mara:47EF669D-E999-4573-AA5C-5CF038ADA870
</pre>

<p>
Enable the menu bar.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgaaf93a2">(menu-bar-mode nil)
</pre>
</div>
</div>
</li>
