help.org
**** Tool bar
:PROPERTIES:
:ID:       org_gcr_2017-06-23_mara:EC50EB46-7878-4799-9805-EF0CB3D3E526
:END:

Disable the tool bar.

#+NAME: org_gcr_2017-05-12_mara_D462D343-9EA8-4BCF-BD08-8FDD4F3E11E9
#+BEGIN_SRC emacs-lisp
(tool-bar-mode 1)
#+END_SRC

Style the tool bar.

#+NAME: org_gcr_2017-07-13_mara_A03A79D4-52D0-40CC-8149-5E200FAF82FD
#+BEGIN_SRC emacs-lisp
(setq tool-bar-style 'both)
#+END_SRC

ibuffer.

#+NAME: org_gcr_2017-07-11_mara_F035C9D9-EAE9-48CF-BE67-5BFF1F0A23FD
#+BEGIN_SRC emacs-lisp
(tool-bar-add-item
 "list-alt"
 'ibuffer
 'Buffers
 :help "List buffers")
#+END_SRC

swap.

#+NAME: org_gcr_2017-07-11_mara_9D659239-693A-430C-A4CE-6003BD650A60
#+BEGIN_SRC emacs-lisp
(tool-bar-add-item
 "exchange"
 'help/safb-switch-to-previous-buffer
 'Swap
 :help "Swap buffers")
#+END_SRC

OS Banner.

#+NAME: org_gcr_2017-07-23_mara_949332F2-28B2-4BC3-B1E7-C7A24DF56269
#+BEGIN_SRC emacs-lisp
(help/on-osx
 (tool-bar-add-item
  "apple"
  'do-nothing
  'Powered-by-macOS
  :help "Powered by macOS"
  :enable nil))
(help/on-gnu/linux
 (tool-bar-add-item
  "linux"
  'do-nothing
  'Powered-by-GNU-Linux
  :help "Powered by GNU/Linux"
  :enable nil))
(help/on-windows
 (tool-bar-add-item
  "windows"
  'do-nothing
  'Powered-by-Microsoft-Windows
  :help "Powered by Microsoft Windows"
  :enable nil))
#+END_SRC

**** Scroll bar
:PROPERTIES:
:ID:       org_gcr_2017-06-23_mara:590AD87D-0567-454F-98AE-3AE64A171012
:END:

Enable both the vertical and horizontal scroll bar.

#+NAME: org_gcr_2017-05-12_mara_D967070F-06B7-4433-94A8-36E360600C9E
#+BEGIN_SRC emacs-lisp
(scroll-bar-mode nil)
(horizontal-scroll-bar-mode nil)
#+END_SRC
**** Transparency
:PROPERTIES:
:ID:       org_gcr_2017-06-23_mara:143A134C-02D9-412F-9D9C-FC6E7B43D505
:END:
#+NAME: org_gcr_2017-05-12_mara_A6D3E9FB-C601-401C-AFA7-B5410A36FDAF
#+BEGIN_SRC emacs-lisp
(use-package seethru
  :ensure t
  :config
  (defhydra hydra-transparency (:color blue :hint nil)
    "
this frame's opacity: %(frame-parameter nil 'alpha)
        _i_ reset!
 _j_ less _k_ 50/50   _l_ more
 _m_ quit
"
    ("j" (lambda () (interactive) (seethru-relative -1)) :exit nil)
    ("i" (lambda () (interactive) (seethru 100)) :exit nil)
    ("k" (lambda () (interactive) (seethru 50)) :exit nil)
    ("l" (lambda () (interactive) (seethru-relative 1)) :exit nil)
    ("m" nil)))

#+END_SRC
** Pointer
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:17DB4E08-F6C4-44AF-935B-27E8984F13DB
   :END:

Hide the pointer when typing.

#+NAME: org_gcr_2017-05-12_mara_DD263B9E-EFF2-49BF-B367-4F4505F8E618
#+BEGIN_SRC emacs-lisp
(setq make-pointer-invisible t)
#+END_SRC

** Version Control
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:09918DB9-3AE3-44DF-9E1F-A4A3918F3315
   :END:

Selectively provide VC file status indicators.

Sometimes it is worth interrupting the flow.

#+NAME: org_gcr_2017-05-12_mara_D6C905B3-76CD-4ABE-83D9-F1E708F0041F
#+BEGIN_SRC emacs-lisp
(use-package diff-hl
  :ensure t)
#+END_SRC

Ediff split frame horizontally.

#+NAME: org_gcr_2017-05-12_mara_2E9A617A-5D88-4E71-88EB-595AA1F16EC2
#+BEGIN_SRC emacs-lisp
(setq ediff-split-window-function 'split-window-horizontally)
#+END_SRC

