help.html
<li><a id="org77c7ff4"></a>Tool bar<br>
<div class="outline-text-5" id="text-5-7-1-4">
<pre class="example">
ID: org_gcr_2017-06-23_mara:EC50EB46-7878-4799-9805-EF0CB3D3E526
</pre>

<p>
Disable the tool bar.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org068bb7e">(tool-bar-mode 1)
</pre>
</div>

<p>
Style the tool bar.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org2baefe4">(<span class="org-keyword">setq</span> tool-bar-style <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">both</span>)
</pre>
</div>

<p>
ibuffer.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgb13c2b9">(tool-bar-add-item
 <span class="org-string">"list-alt"</span>
 <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">ibuffer</span>
 <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">Buffers</span>
 <span class="org-builtin">:help</span> <span class="org-string">"List buffers"</span>)
</pre>
</div>

<p>
swap.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org584f598">(tool-bar-add-item
 <span class="org-string">"exchange"</span>
 <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">help/safb-switch-to-previous-buffer</span>
 <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">Swap</span>
 <span class="org-builtin">:help</span> <span class="org-string">"Swap buffers"</span>)
</pre>
</div>

<p>
OS Banner.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orge24259f">(<span class="org-keyword">help/on-osx</span>
 (tool-bar-add-item
  <span class="org-string">"apple"</span>
  <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">do-nothing</span>
  <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">Powered-by-macOS</span>
  <span class="org-builtin">:help</span> <span class="org-string">"Powered by macOS"</span>
  <span class="org-builtin">:enable</span> nil))
(<span class="org-keyword">help/on-gnu/linux</span>
 (tool-bar-add-item
  <span class="org-string">"linux"</span>
  <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">do-nothing</span>
  <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">Powered-by-GNU-Linux</span>
  <span class="org-builtin">:help</span> <span class="org-string">"Powered by GNU/Linux"</span>
  <span class="org-builtin">:enable</span> nil))
(<span class="org-keyword">help/on-windows</span>
 (tool-bar-add-item
  <span class="org-string">"windows"</span>
  <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">do-nothing</span>
  <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">Powered-by-Microsoft-Windows</span>
  <span class="org-builtin">:help</span> <span class="org-string">"Powered by Microsoft Windows"</span>
  <span class="org-builtin">:enable</span> nil))
</pre>
</div>
</div>
</li>

<li><a id="org880a35f"></a>Scroll bar<br>
<div class="outline-text-5" id="text-5-7-1-5">
<pre class="example">
ID: org_gcr_2017-06-23_mara:590AD87D-0567-454F-98AE-3AE64A171012
</pre>

<p>
Enable both the vertical and horizontal scroll bar.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org6c35a4e">(scroll-bar-mode nil)
(horizontal-scroll-bar-mode nil)
</pre>
</div>
</div>
</li>
<li><a id="org6896b5d"></a>Transparency<br>
<div class="outline-text-5" id="text-5-7-1-6">
<pre class="example">
ID: org_gcr_2017-06-23_mara:143A134C-02D9-412F-9D9C-FC6E7B43D505
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org9005908">(<span class="org-keyword">use-package</span> <span class="org-constant">seethru</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">defhydra</span> hydra-transparency (<span class="org-builtin">:color</span> <span class="custom"><span class="custom-1">blue</span></span> <span class="org-builtin">:hint</span> nil)
    <span class="org-doc">"</span>
<span class="org-doc">this frame's opacity: %(frame-parameter nil 'alpha)</span>
<span class="org-doc">        _i_ reset!</span>
<span class="org-doc"> _j_ less _k_ 50/50   _l_ more</span>
<span class="org-doc"> _m_ quit</span>
<span class="org-doc">"</span>
    (<span class="org-string">"j"</span> (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>) (seethru-relative -1)) <span class="org-builtin">:exit</span> nil)
    (<span class="org-string">"i"</span> (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>) (seethru 100)) <span class="org-builtin">:exit</span> nil)
    (<span class="org-string">"k"</span> (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>) (seethru 50)) <span class="org-builtin">:exit</span> nil)
    (<span class="org-string">"l"</span> (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>) (seethru-relative 1)) <span class="org-builtin">:exit</span> nil)
    (<span class="org-string">"m"</span> nil)))

</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-org368c0f1" class="outline-3">
<h3 id="org368c0f1"><span class="section-number-3">5.8</span> Pointer</h3>
<div class="outline-text-3" id="text-5-8">
<pre class="example">
ID: org_gcr_2017-05-12_mara:17DB4E08-F6C4-44AF-935B-27E8984F13DB
</pre>

<p>
Hide the pointer when typing.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org038a3ff">(<span class="org-keyword">setq</span> make-pointer-invisible t)
</pre>
</div>
</div>
</div>

<div id="outline-container-org611e6a0" class="outline-3">
<h3 id="org611e6a0"><span class="section-number-3">5.9</span> Version Control</h3>
<div class="outline-text-3" id="text-5-9">
<pre class="example">
ID: org_gcr_2017-05-12_mara:09918DB9-3AE3-44DF-9E1F-A4A3918F3315
</pre>

<p>
Selectively provide VC file status indicators.
</p>

<p>
Sometimes it is worth interrupting the flow.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org538b5ee">(<span class="org-keyword">use-package</span> <span class="org-constant">diff-hl</span>
  <span class="org-builtin">:ensure</span> t)
</pre>
</div>

<p>
Ediff split frame horizontally.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orge71306a">(<span class="org-keyword">setq</span> ediff-split-window-function <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">split-window-horizontally</span>)
</pre>
</div>
</div>
</div>
