help.org
** Window
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:FBD41A4B-9764-49CB-8439-74581B2211A0
   :END:

Easily return to previous configurations. 2-4 windows are easily managed by
hand.

#+NAME: org_gcr_2017-05-12_mara_8E367FFF-FCF3-4AC8-9542-A20CE62081C4
#+BEGIN_SRC emacs-lisp
(winner-mode t)
#+END_SRC

Frequently use between 1 and 4 windows.

#+NAME: org_gcr_2017-05-12_mara_94DA6C06-BCBB-4231-B0C7-EFD4B1310530
#+BEGIN_SRC emacs-lisp
(defun help/1-window ()
  "Work with this buffer in 1 window."
  (interactive)
  (delete-other-windows))

(defun help/2-window ()
  "Work with this buffer in 2 windows."
  (interactive)
  (delete-other-windows)
  (split-window-right)
  (balance-windows))

(defun help/3-window ()
  "Work with this buffer in 3 windows."
  (interactive)
  (delete-other-windows)
  (split-window-below)
  (split-window-below)
  (balance-windows))

(defun help/4-window ()
  "Work with this buffer in 4 windows."
  (interactive)
  (delete-other-windows)
  (split-window-right)
  (split-window-below)
  (call-interactively #'other-window)
  (call-interactively #'other-window)
  (split-window-below)
  (call-interactively #'other-window)
  (call-interactively #'other-window)
  (balance-windows))
#+END_SRC

Most of the time when opening other buffers, go to them. This configuration
appears for different modes in this system. Modes distributed with Emacs are
configured here.

#+NAME: org_gcr_2017-05-12_mara_B5190A4E-4174-471F-9C82-C454D269B867
#+BEGIN_SRC emacs-lisp
(setq help-window-select t)
#+END_SRC

Select windows.

#+NAME: org_gcr_2017-05-12_mara_A165E3DB-37E7-49A7-84E4-1CB0D2A137C6
#+BEGIN_SRC emacs-lisp
(use-package ace-window
  :ensure t
  :config
  (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
  (setq aw-scope 'frame)
  (setq aw-background nil))
#+END_SRC

#+NAME: org_gcr_2017-07-08_mara_3D694F1B-EB4A-4724-A8E7-61F09C4773A5
#+BEGIN_SRC emacs-lisp
(use-package eyebrowse
  :ensure t
  :config
  (setq eyebrowse-wrap-around t)
  (eyebrowse-mode t)
  (defhydra help/hydra-left-side/eyebrowse (:color blue :hint nil)
    "
current eyebrowse slot: %(let* ((window-configs (eyebrowse--get 'window-configs))(match (assq (eyebrowse--get 'current-slot) window-configs))(desc (eyebrowse-format-slot match)))desc)
 _u_ create _i_ choose _o_ rename _q_ quit
  _j_ previous _k_ next _l_ last
   _a_ 00 _s_ 01 _d_ 02 _f_ 03 _g_ 04 _z_ 05 _x_ 06 _c_ 07 _v_ 08 _b_ 09 _~_ close "
    ("u" #'eyebrowse-create-window-config)
    ("i" #'eyebrowse-switch-to-window-config)
    ("o" #'eyebrowse-rename-window-config :exit nil)
    ("q" nil)
    ("j" #'eyebrowse-prev-window-config :exit nil)
    ("k" #'eyebrowse-next-window-config :exit nil)
    ("l" #'eyebrowse-last-window-config)
    ("a" #'eyebrowse-switch-to-window-config-0)
    ("s" #'eyebrowse-switch-to-window-config-1)
    ("d" #'eyebrowse-switch-to-window-config-2)
    ("f" #'eyebrowse-switch-to-window-config-3)
    ("g" #'eyebrowse-switch-to-window-config-4)
    ("z" #'eyebrowse-switch-to-window-config-5)
    ("x" #'eyebrowse-switch-to-window-config-6)
    ("c" #'eyebrowse-switch-to-window-config-7)
    ("v" #'eyebrowse-switch-to-window-config-8)
    ("b" #'eyebrowse-switch-to-window-config-9)
    ("~" #'eyebrowse-close-window-config :exit nil))
  (global-set-key (kbd "C-M-e") #'help/hydra-left-side/eyebrowse/body))
#+END_SRC

* Piano Lessons
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:B9C71531-F4DD-4180-950D-AD3494C5D566
   :END:

** A Fine Cup of EMACS
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:80EEF715-CC24-4B14-A12B-1CD4F16D13A9
   :END:

Every EMACS user ought to have a [[http://shop.fsf.org/product/gnu-emacs-reference-mugs/][Emacs Reference Mug]] at their desk. The mug
invites other users to ask questions. Give the mug as a gift to every user you
know who would benefit from learning EMACS. The mug reminds us all that EMACS is
the perfect configuration of EMACS. It is available on every machine. When you
break your system, you can always fall back to the good and reliable default
EMACS configuration to get your system up and running again. The OOTB
configuration of EMACS is one of the most important system configurations that
you will every find. That is why it is important never to ruin it.

This system wants to maximize accessibility for new users. It wants anyone to be
able to download and use it without surprises. It wants the mug to serve as a
fine reference for anyone to use. It wants to keep things simple and familiar so
that anyone who has learned EMACS OOTB can use it pleasantly and productively.
These goals are essential to configuring the keyboard for this system. This
system will always respect the POLA.

