help.html

<div id="outline-container-orgcb022da" class="outline-3">
<h3 id="orgcb022da"><span class="section-number-3">5.10</span> Window</h3>
<div class="outline-text-3" id="text-5-10">
<pre class="example">
ID: org_gcr_2017-05-12_mara:FBD41A4B-9764-49CB-8439-74581B2211A0
</pre>

<p>
Easily return to previous configurations. 2-4 windows are easily managed by
hand.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgfdbc0ac">(winner-mode t)
</pre>
</div>

<p>
Frequently use between 1 and 4 windows.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org0db7fc5">(<span class="org-keyword">defun</span> <span class="org-function-name">help/1-window</span> ()
  <span class="org-doc">"Work with this buffer in 1 window."</span>
  (<span class="org-keyword">interactive</span>)
  (delete-other-windows))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/2-window</span> ()
  <span class="org-doc">"Work with this buffer in 2 windows."</span>
  (<span class="org-keyword">interactive</span>)
  (delete-other-windows)
  (split-window-right)
  (balance-windows))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/3-window</span> ()
  <span class="org-doc">"Work with this buffer in 3 windows."</span>
  (<span class="org-keyword">interactive</span>)
  (delete-other-windows)
  (split-window-below)
  (split-window-below)
  (balance-windows))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/4-window</span> ()
  <span class="org-doc">"Work with this buffer in 4 windows."</span>
  (<span class="org-keyword">interactive</span>)
  (delete-other-windows)
  (split-window-right)
  (split-window-below)
  (call-interactively <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">other-window</span>)
  (call-interactively <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">other-window</span>)
  (split-window-below)
  (call-interactively <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">other-window</span>)
  (call-interactively <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">other-window</span>)
  (balance-windows))
</pre>
</div>

<p>
Most of the time when opening other buffers, go to them. This configuration
appears for different modes in this system. Modes distributed with Emacs are
configured here.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org2748b05">(<span class="org-keyword">setq</span> help-window-select t)
</pre>
</div>

<p>
Select windows.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org3da2cd3">(<span class="org-keyword">use-package</span> <span class="org-constant">ace-window</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">setq</span> aw-keys <span class="org-highlight-quoted-quote">'</span>(?a ?s ?d ?f ?g ?h ?j ?k ?l))
  (<span class="org-keyword">setq</span> aw-scope <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">frame</span>)
  (<span class="org-keyword">setq</span> aw-background nil))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orga2d2a10">(<span class="org-keyword">use-package</span> <span class="org-constant">eyebrowse</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">setq</span> eyebrowse-wrap-around t)
  (eyebrowse-mode t)
  (<span class="org-keyword">defhydra</span> help/hydra-left-side/eyebrowse (<span class="org-builtin">:color</span> <span class="custom"><span class="custom-1">blue</span></span> <span class="org-builtin">:hint</span> nil)
    <span class="org-doc">"</span>
<span class="org-doc">current eyebrowse slot: %(let* ((window-configs (eyebrowse--get 'window-configs))(match (assq (eyebrowse--get 'current-slot) window-configs))(desc (eyebrowse-format-slot match)))desc)</span>
<span class="org-doc"> _u_ create _i_ choose _o_ rename _q_ quit</span>
<span class="org-doc">  _j_ previous _k_ next _l_ last</span>
<span class="org-doc">   _a_ 00 _s_ 01 _d_ 02 _f_ 03 _g_ 04 _z_ 05 _x_ 06 _c_ 07 _v_ 08 _b_ 09 _~_ close "</span>
    (<span class="org-string">"u"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">eyebrowse-create-window-config</span>)
    (<span class="org-string">"i"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">eyebrowse-switch-to-window-config</span>)
    (<span class="org-string">"o"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">eyebrowse-rename-window-config</span> <span class="org-builtin">:exit</span> nil)
    (<span class="org-string">"q"</span> nil)
    (<span class="org-string">"j"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">eyebrowse-prev-window-config</span> <span class="org-builtin">:exit</span> nil)
    (<span class="org-string">"k"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">eyebrowse-next-window-config</span> <span class="org-builtin">:exit</span> nil)
    (<span class="org-string">"l"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">eyebrowse-last-window-config</span>)
    (<span class="org-string">"a"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">eyebrowse-switch-to-window-config-0</span>)
    (<span class="org-string">"s"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">eyebrowse-switch-to-window-config-1</span>)
    (<span class="org-string">"d"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">eyebrowse-switch-to-window-config-2</span>)
    (<span class="org-string">"f"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">eyebrowse-switch-to-window-config-3</span>)
    (<span class="org-string">"g"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">eyebrowse-switch-to-window-config-4</span>)
    (<span class="org-string">"z"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">eyebrowse-switch-to-window-config-5</span>)
    (<span class="org-string">"x"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">eyebrowse-switch-to-window-config-6</span>)
    (<span class="org-string">"c"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">eyebrowse-switch-to-window-config-7</span>)
    (<span class="org-string">"v"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">eyebrowse-switch-to-window-config-8</span>)
    (<span class="org-string">"b"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">eyebrowse-switch-to-window-config-9</span>)
    (<span class="org-string">"~"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">eyebrowse-close-window-config</span> <span class="org-builtin">:exit</span> nil))
  (global-set-key (kbd <span class="org-string">"C-M-e"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/hydra-left-side/eyebrowse/body</span>))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3fc2258" class="outline-2">
<h2 id="org3fc2258"><span class="section-number-2">6</span> Piano Lessons</h2>
<div class="outline-text-2" id="text-6">
<pre class="example">
ID: org_gcr_2017-05-12_mara:B9C71531-F4DD-4180-950D-AD3494C5D566
</pre>
</div>

<div id="outline-container-orgd61023e" class="outline-3">
<h3 id="orgd61023e"><span class="section-number-3">6.1</span> A Fine Cup of EMACS</h3>
<div class="outline-text-3" id="text-6-1">
<pre class="example">
ID: org_gcr_2017-05-12_mara:80EEF715-CC24-4B14-A12B-1CD4F16D13A9
</pre>

<p>
Every EMACS user ought to have a <a href="http://shop.fsf.org/product/gnu-emacs-reference-mugs/">Emacs Reference Mug</a> at their desk. The mug
invites other users to ask questions. Give the mug as a gift to every user you
know who would benefit from learning EMACS. The mug reminds us all that EMACS is
the perfect configuration of EMACS. It is available on every machine. When you
break your system, you can always fall back to the good and reliable default
EMACS configuration to get your system up and running again. The OOTB
configuration of EMACS is one of the most important system configurations that
you will every find. That is why it is important never to ruin it.
</p>

<p>
This system wants to maximize accessibility for new users. It wants anyone to be
able to download and use it without surprises. It wants the mug to serve as a
fine reference for anyone to use. It wants to keep things simple and familiar so
that anyone who has learned EMACS OOTB can use it pleasantly and productively.
These goals are essential to configuring the keyboard for this system. This
system will always respect the POLA.
</p>
</div>
</div>
