help.org
** A Keyboard on Every Desk
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:7A27D97D-9D7D-43DC-B961-A4AFC9032609
   :END:

The configuration of the keyboard on an EMACS system can completely change the
experience. No keyboard makes it impossible. A Kinesis Ergo makes it feel
really good. Soft keys make it feel soft; hard keys make it feel faster. The
[[http://xahlee.info/kbd/dvorak_and_all_keyboard_layouts.html][layout of letters]] is claimed to make you "more productive" using statistics.
You may even study the statistics of your own writing and choose a layout
optimized for you. The ways to configure your keyboard are limitless because
everyone is unique. How to get the best configuration tips for your system? Do
what works for everyone.

Choose a keyboard that will satisfy 80% of EMACS users using 80% of the
keyboards out there. Make this system easy to use on any one of those keyboards.
Make this system easy to use in English. Make this system easy to use with
average hand strength using two hands. These goals are essential to configuring
the keyboard for this system.

** A Display with Every Keyboard
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:ED485AD6-A185-465C-9B8A-2E9E848E02DA
   :END:

Every system requires an output. You have two options. The first is a terminal
that only displays characters. The second is a display that provides detailed
graphics. "Display" is the EMACS term for a GUI.

Some users prefer the former. Some users prefer the latter. Some users prefer to
use a $4000USD machine to emulate the latter. Both are good options.

This system is configured to work pleasantly for either type of output.

** A Full Pot of EMACS on Every Desk
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:3165655B-5F9B-4712-896B-32EE9EEEF946
   :END:

*** Keyboard Layout & Operation
    :PROPERTIES:
    :ID:       org_gcr_2017-05-12_mara:10CA1648-3A69-47DA-B20C-495E24D7E54A
    :END:

- Use QWERTY layout.
  - Everyone knows it.
  - Easy to learn.
  - Available on every keyboard.
  - Inexpensive.
  - When graduation time comes, plenty of great alternatives available like
    DVORAK and Colemak.
- Keep hands in home position as much as possible.
  - Every finger is strong in the home position so RSI reduced.
  - Single key presses are easy there.
- Table-bang the shift, caps-lock and enter keys.
  - Table-bang is a position of your hand. Make it by:
    - Starting with your hands in the home position.
    - Make a "high-five" with both of them parallel to the keyboard.
    - Turn your left hand counter-clockwise and right hand clockwise to make
      them perpendicular to the keyboard.
    - Squeeze all of your fingers together.
    - Push the keys using the side of your Pinky.
    - In this position you are using the strength of all of your fingers.
  - Never use those key using your Pinky alone.
  - Practice depends 100% on user-discipline.
- Try to achieve balance with meta keys.
  - Provide same key of each side of the keyboard.
- Be conscious of key operations [[http://ergoemacs.org/emacs/emacs_key_notation_return_vs_RET.html][on different outputs]].
  - Always provide both.
  - Note what is getting stomped on.
  - For return bind to:
    - =RET= in the terminal.
    - =<return>= in the GUI.
  - Also for tab =TAB= vs =C-i=.
  - Also for escape =ESC= vs =C-[=

*** Understanding Your Cognitive Landscape.
    :PROPERTIES:
    :ID:       org_gcr_2017-05-12_mara:7CAD36B9-85CC-4417-B1BF-34BF0E1FD704
    :END:

You operate within a cognitive landscape. Every moment you are in a single
=place=. While residing in each =place= you perform logically related =activities=.
Activities facilitate logical actions like modification within that =place=.
Modifications are performed objects. Objects include things like the contents of
a buffer, contents of memory, or the file that backs a buffer. While performing
those =activities= there is a logical sense of "flow". That should never be
interrupted. Usually an interruption occurs when you are going to go to a new
=place=. The =distance= between =places= is measured in the similarity between the
=actions= that you find there. As you develop these ides it will be obvious where
key-bindings should go

