help.html

<div id="outline-container-orgde56246" class="outline-3">
<h3 id="orgde56246"><span class="section-number-3">6.2</span> A Keyboard on Every Desk</h3>
<div class="outline-text-3" id="text-6-2">
<pre class="example">
ID: org_gcr_2017-05-12_mara:7A27D97D-9D7D-43DC-B961-A4AFC9032609
</pre>

<p>
The configuration of the keyboard on an EMACS system can completely change the
experience. No keyboard makes it impossible. A Kinesis Ergo makes it feel
really good. Soft keys make it feel soft; hard keys make it feel faster. The
<a href="http://xahlee.info/kbd/dvorak_and_all_keyboard_layouts.html">layout of letters</a> is claimed to make you &ldquo;more productive&rdquo; using statistics.
You may even study the statistics of your own writing and choose a layout
optimized for you. The ways to configure your keyboard are limitless because
everyone is unique. How to get the best configuration tips for your system? Do
what works for everyone.
</p>

<p>
Choose a keyboard that will satisfy 80% of EMACS users using 80% of the
keyboards out there. Make this system easy to use on any one of those keyboards.
Make this system easy to use in English. Make this system easy to use with
average hand strength using two hands. These goals are essential to configuring
the keyboard for this system.
</p>
</div>
</div>

<div id="outline-container-orgc1a941a" class="outline-3">
<h3 id="orgc1a941a"><span class="section-number-3">6.3</span> A Display with Every Keyboard</h3>
<div class="outline-text-3" id="text-6-3">
<pre class="example">
ID: org_gcr_2017-05-12_mara:ED485AD6-A185-465C-9B8A-2E9E848E02DA
</pre>

<p>
Every system requires an output. You have two options. The first is a terminal
that only displays characters. The second is a display that provides detailed
graphics. &ldquo;Display&rdquo; is the EMACS term for a GUI.
</p>

<p>
Some users prefer the former. Some users prefer the latter. Some users prefer to
use a $4000USD machine to emulate the latter. Both are good options.
</p>

<p>
This system is configured to work pleasantly for either type of output.
</p>
</div>
</div>

<div id="outline-container-org8c0222a" class="outline-3">
<h3 id="org8c0222a"><span class="section-number-3">6.4</span> A Full Pot of EMACS on Every Desk</h3>
<div class="outline-text-3" id="text-6-4">
<pre class="example">
ID: org_gcr_2017-05-12_mara:3165655B-5F9B-4712-896B-32EE9EEEF946
</pre>
</div>

<div id="outline-container-org24d306e" class="outline-4">
<h4 id="org24d306e"><span class="section-number-4">6.4.1</span> Keyboard Layout &amp; Operation</h4>
<div class="outline-text-4" id="text-6-4-1">
<pre class="example">
ID: org_gcr_2017-05-12_mara:10CA1648-3A69-47DA-B20C-495E24D7E54A
</pre>

<ul class="org-ul">
<li>Use QWERTY layout.
<ul class="org-ul">
<li>Everyone knows it.</li>
<li>Easy to learn.</li>
<li>Available on every keyboard.</li>
<li>Inexpensive.</li>
<li>When graduation time comes, plenty of great alternatives available like
DVORAK and Colemak.</li>
</ul></li>
<li>Keep hands in home position as much as possible.
<ul class="org-ul">
<li>Every finger is strong in the home position so RSI reduced.</li>
<li>Single key presses are easy there.</li>
</ul></li>
<li>Table-bang the shift, caps-lock and enter keys.
<ul class="org-ul">
<li>Table-bang is a position of your hand. Make it by:
<ul class="org-ul">
<li>Starting with your hands in the home position.</li>
<li>Make a &ldquo;high-five&rdquo; with both of them parallel to the keyboard.</li>
<li>Turn your left hand counter-clockwise and right hand clockwise to make
them perpendicular to the keyboard.</li>
<li>Squeeze all of your fingers together.</li>
<li>Push the keys using the side of your Pinky.</li>
<li>In this position you are using the strength of all of your fingers.</li>
</ul></li>
<li>Never use those key using your Pinky alone.</li>
<li>Practice depends 100% on user-discipline.</li>
</ul></li>
<li>Try to achieve balance with meta keys.
<ul class="org-ul">
<li>Provide same key of each side of the keyboard.</li>
</ul></li>
<li>Be conscious of key operations <a href="http://ergoemacs.org/emacs/emacs_key_notation_return_vs_RET.html">on different outputs</a>.
<ul class="org-ul">
<li>Always provide both.</li>
<li>Note what is getting stomped on.</li>
<li>For return bind to:
<ul class="org-ul">
<li><code>RET</code> in the terminal.</li>
<li><code>&lt;return&gt;</code> in the GUI.</li>
</ul></li>
<li>Also for tab <code>TAB</code> vs <code>C-i</code>.</li>
<li>Also for escape <code>ESC</code> vs <code>C-[</code></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org7c20148" class="outline-4">
<h4 id="org7c20148"><span class="section-number-4">6.4.2</span> Understanding Your Cognitive Landscape.</h4>
<div class="outline-text-4" id="text-6-4-2">
<pre class="example">
ID: org_gcr_2017-05-12_mara:7CAD36B9-85CC-4417-B1BF-34BF0E1FD704
</pre>

<p>
You operate within a cognitive landscape. Every moment you are in a single
<code>place</code>. While residing in each <code>place</code> you perform logically related <code>activities</code>.
Activities facilitate logical actions like modification within that <code>place</code>.
Modifications are performed objects. Objects include things like the contents of
a buffer, contents of memory, or the file that backs a buffer. While performing
those <code>activities</code> there is a logical sense of &ldquo;flow&rdquo;. That should never be
interrupted. Usually an interruption occurs when you are going to go to a new
<code>place</code>. The <code>distance</code> between <code>places</code> is measured in the similarity between the
<code>actions</code> that you find there. As you develop these ides it will be obvious where
key-bindings should go
</p>
</div>
</div>
