help.org
*** Key-Bindings Take You to Places to Perform Activities
    :PROPERTIES:
    :ID:       org_gcr_2017-05-12_mara:B2C6C0E2-03F4-4C9E-828D-E972EF84F7AB
    :END:

OOTB you wil be visiting many =places= and performing many =activities=. EMACS comes
with a good configuration that minimizes =distance=. This isn't worth changing.
You can use EMACS for a lifetime without ever having to customize any of the
key-bindings. This is what lets anyone use your system. This is what lets you
use the system with =-Q= when you break it. You need to decide if you every want
to alter the default configuration. This system does not want to. It wants to
keep EMACS true to EMACS and your hands happy. To satisfy those goals the
following practices were defined.

- 99.999% of the time never bind to the =C= or =M= or ~C-M-s~ name-space.
  - They are for system key-bindings. You can break them. Don't.
  - In theory =C-c= is the "user name-space" but packages stomp on this all of the
    time anyway so don't use it.
  - Some bindings are just too valuable to pass up:
    - =C-;=
      - Your hands are in the home position already.
    - Every modifier key with return.
  - ~C-M-s~ is for the operating system
    - Discovered this in macOS
- Never bind to =F= keys.
  - They are a painful stretch on most keyboards.
  - Some require a lone Pinky with is worse.
  - Most operating systems bind actions to them OOTB anyway.
  - EMACS comes with key-bindings OOTB.
- Don't try to set up a Hyper-key.
  - I tried it. It is great to open another namespace. But it ruins
    cross-platform portability.
  - However I'm leaving it available for anything possible.
- Use shift as a name-space expansion vehicle.
  - Shift doubles every name-space in which you use it.
  - Use cautiously, not every name-space vehicle supports it.
- About the =s= (super) name-space.
  - In theory it is the best place for user-defined key-bindings because
    EMACS OOTB uses =C= and =M= completely leaving =s= mostly open.
  - In practice =C= and =M= are running out of space because there are a lot of
    new packages being added to EMACS. Most new packages are binding key
    in the =s= name-space.
  - This system reserves =s= completely for Sysop.

These practices say nothing about the =places= or =activities= that you choose to
peform. The practices only look at the key-binding configuration. There are a
limited number of keys on a keyboard and there are physical limitations on your
hands. Along with the previous assuptions it may look like there are less.
Fortunately it just looks that way and it isn't true. There are a lot of
powerful ways to "go places" with EMACS. The next heading contains my attempt.

*** How to Get There Pleasantly and Quickly
    :PROPERTIES:
    :ID:       org_gcr_2017-05-12_mara:28C3C38D-A81D-4E09-8AEA-38C8E7F05CC4
    :END:

You need to learn how to use EMACS. You need to develop a personal preference.
You need to develop an idea of =places= and =activities= and =distance=. The following
headings are delineated by breaks in flow.

The examples try to talk about doing those things and do it by exploring:

- "going places to do things".
- "how quickly I will get there and how long I will be there"
- "how quickly I want to go somewhere else".

They were initially described by the properties:

- Actions :: The number of related actions in that place.
- Expertise :: The level of skill and speed with which you are performing the
  activity.
- Relationship :: How closely those activities are related in the current place.
- Frequency :: How many times you perform these actions when you here.

The relationship between "doing those things" and those 4 properties is still
unclear and being explored.

**** =s=
      :PROPERTIES:
      :Actions:          High
      :Expertise:        High
      :Relationship:     High
      :Frequency:        High
      :ID:       org_gcr_2017-05-12_mara:6477D74C-FC51-4722-A665-B26F33541078
      :END:

- =Actions= here are for the =place= inside of the buffer itself. They are for
  immediate acting upon the contents of the buffer. They are logically
  related, used frequently, and likely to be memorized.
- When you come here, you are likely to stay for some time before getting
  out.
- Only use single key bindings; anything more may be a new logical
  name-space and may use a Hydra.
- Split the home sides of the keyboard in half.
- The left side of the keyboard should be use for operations common to
  every mode.
  - For example ~goto-line~ and ~ispell~.
  - It has 15 bindings available; 20 if you use 1-5. 40 if you shift them.
- The right side of the keyboard should be used operations specific to the
  current major mode.
  - For example in Org-Mode navigating between source-blocks and
    evaluating them.
  - It has 19 bindings available; 26 if you use 6-=. 52 if you shift them.
- 2017-07-24
  - This worked out well and close to expected. The ~s(uper)~ name-space is
    mostly free. Any package using it well I stomped on its bindings without
    even looking at them. They are supposed to be free but the ~C-c~ and ~C-x~
    name-space is running out and people get mad about it (I did, and my
    solution is below). Despite my approach I still ran out of namesake for
    my super bindings. That surprised me. So I tried using ~H(yper)~ but isn't
    easily on every keyboard so I converted all of those bindings to ~C-M-~ and
    that worked out great but now I can't use that for more specific bindings.
    The whole =left= and =right= zones of the keyboard has worked out well when I
    remember and it is pretty easy to remember. The only problem with this
    approach is that I still ran out of name-space despite my approach below.
    So between key-chords and using the super key and moving a bunch of stuff
    into Hydras I still ran out of space. That leaves ~C-s~ for more name-space
    for the left and right side. I'm glad to try this out.

For example, in Org-Mode:

- I traverse the entire document very quickly with
  ~org-babel-previous-src-block~ and and ~org-babel-next-src-block.~
- I execute source-blocks.
- I edit source-blocks.

Every activity is related to reading, modifying, executing, and tangling code.

