help.html

<div id="outline-container-orge97dd08" class="outline-4">
<h4 id="orge97dd08"><span class="section-number-4">6.4.3</span> Key-Bindings Take You to Places to Perform Activities</h4>
<div class="outline-text-4" id="text-6-4-3">
<pre class="example">
ID: org_gcr_2017-05-12_mara:B2C6C0E2-03F4-4C9E-828D-E972EF84F7AB
</pre>

<p>
OOTB you wil be visiting many <code>places</code> and performing many <code>activities</code>. EMACS comes
with a good configuration that minimizes <code>distance</code>. This isn&rsquo;t worth changing.
You can use EMACS for a lifetime without ever having to customize any of the
key-bindings. This is what lets anyone use your system. This is what lets you
use the system with <code>-Q</code> when you break it. You need to decide if you every want
to alter the default configuration. This system does not want to. It wants to
keep EMACS true to EMACS and your hands happy. To satisfy those goals the
following practices were defined.
</p>

<ul class="org-ul">
<li>99.999% of the time never bind to the <code>C</code> or <code>M</code> or <code>C-M-s</code> name-space.
<ul class="org-ul">
<li>They are for system key-bindings. You can break them. Don&rsquo;t.</li>
<li>In theory <code>C-c</code> is the &ldquo;user name-space&rdquo; but packages stomp on this all of the
time anyway so don&rsquo;t use it.</li>
<li>Some bindings are just too valuable to pass up:
<ul class="org-ul">
<li><code>C-;</code>
<ul class="org-ul">
<li>Your hands are in the home position already.</li>
</ul></li>
<li>Every modifier key with return.</li>
</ul></li>
<li><code>C-M-s</code> is for the operating system
<ul class="org-ul">
<li>Discovered this in macOS</li>
</ul></li>
</ul></li>
<li>Never bind to <code>F</code> keys.
<ul class="org-ul">
<li>They are a painful stretch on most keyboards.</li>
<li>Some require a lone Pinky with is worse.</li>
<li>Most operating systems bind actions to them OOTB anyway.</li>
<li>EMACS comes with key-bindings OOTB.</li>
</ul></li>
<li>Don&rsquo;t try to set up a Hyper-key.
<ul class="org-ul">
<li>I tried it. It is great to open another namespace. But it ruins
cross-platform portability.</li>
<li>However I&rsquo;m leaving it available for anything possible.</li>
</ul></li>
<li>Use shift as a name-space expansion vehicle.
<ul class="org-ul">
<li>Shift doubles every name-space in which you use it.</li>
<li>Use cautiously, not every name-space vehicle supports it.</li>
</ul></li>
<li>About the <code>s</code> (super) name-space.
<ul class="org-ul">
<li>In theory it is the best place for user-defined key-bindings because
EMACS OOTB uses <code>C</code> and <code>M</code> completely leaving <code>s</code> mostly open.</li>
<li>In practice <code>C</code> and <code>M</code> are running out of space because there are a lot of
new packages being added to EMACS. Most new packages are binding key
in the <code>s</code> name-space.</li>
<li>This system reserves <code>s</code> completely for Sysop.</li>
</ul></li>
</ul>

<p>
These practices say nothing about the <code>places</code> or <code>activities</code> that you choose to
peform. The practices only look at the key-binding configuration. There are a
limited number of keys on a keyboard and there are physical limitations on your
hands. Along with the previous assuptions it may look like there are less.
Fortunately it just looks that way and it isn&rsquo;t true. There are a lot of
powerful ways to &ldquo;go places&rdquo; with EMACS. The next heading contains my attempt.
</p>
</div>
</div>

<div id="outline-container-orgf3229aa" class="outline-4">
<h4 id="orgf3229aa"><span class="section-number-4">6.4.4</span> How to Get There Pleasantly and Quickly</h4>
<div class="outline-text-4" id="text-6-4-4">
<pre class="example">
ID: org_gcr_2017-05-12_mara:28C3C38D-A81D-4E09-8AEA-38C8E7F05CC4
</pre>

<p>
You need to learn how to use EMACS. You need to develop a personal preference.
You need to develop an idea of <code>places</code> and <code>activities</code> and <code>distance</code>. The following
headings are delineated by breaks in flow.
</p>

<p>
The examples try to talk about doing those things and do it by exploring:
</p>

<ul class="org-ul">
<li>&ldquo;going places to do things&rdquo;.</li>
<li>&ldquo;how quickly I will get there and how long I will be there&rdquo;</li>
<li>&ldquo;how quickly I want to go somewhere else&rdquo;.</li>
</ul>

<p>
They were initially described by the properties:
</p>

<dl class="org-dl">
<dt>Actions</dt><dd>The number of related actions in that place.</dd>
<dt>Expertise</dt><dd>The level of skill and speed with which you are performing the
activity.</dd>
<dt>Relationship</dt><dd>How closely those activities are related in the current place.</dd>
<dt>Frequency</dt><dd>How many times you perform these actions when you here.</dd>
</dl>

<p>
The relationship between &ldquo;doing those things&rdquo; and those 4 properties is still
unclear and being explored.
</p>
</div>

<ol class="org-ol">
<li><a id="orgc7e3f46"></a><code>s</code><br>
<div class="outline-text-5" id="text-6-4-4-1">
<pre class="example">
Actions: High
Expertise: High
Relationship: High
Frequency: High
ID: org_gcr_2017-05-12_mara:6477D74C-FC51-4722-A665-B26F33541078
</pre>

<ul class="org-ul">
<li><code>Actions</code> here are for the <code>place</code> inside of the buffer itself. They are for
immediate acting upon the contents of the buffer. They are logically
related, used frequently, and likely to be memorized.</li>
<li>When you come here, you are likely to stay for some time before getting
out.</li>
<li>Only use single key bindings; anything more may be a new logical
name-space and may use a Hydra.</li>
<li>Split the home sides of the keyboard in half.</li>
<li>The left side of the keyboard should be use for operations common to
every mode.
<ul class="org-ul">
<li>For example <code>goto-line</code> and <code>ispell</code>.</li>
<li>It has 15 bindings available; 20 if you use 1-5. 40 if you shift them.</li>
</ul></li>
<li>The right side of the keyboard should be used operations specific to the
current major mode.
<ul class="org-ul">
<li>For example in Org-Mode navigating between source-blocks and
evaluating them.</li>
<li>It has 19 bindings available; 26 if you use 6-=. 52 if you shift them.</li>
</ul></li>
<li>2017-07-24
<ul class="org-ul">
<li>This worked out well and close to expected. The <code>s(uper)</code> name-space is
mostly free. Any package using it well I stomped on its bindings without
even looking at them. They are supposed to be free but the <code>C-c</code> and <code>C-x</code>
name-space is running out and people get mad about it (I did, and my
solution is below). Despite my approach I still ran out of namesake for
my super bindings. That surprised me. So I tried using <code>H(yper)</code> but isn&rsquo;t
easily on every keyboard so I converted all of those bindings to <code>C-M-</code> and
that worked out great but now I can&rsquo;t use that for more specific bindings.
The whole <code>left</code> and <code>right</code> zones of the keyboard has worked out well when I
remember and it is pretty easy to remember. The only problem with this
approach is that I still ran out of name-space despite my approach below.
So between key-chords and using the super key and moving a bunch of stuff
into Hydras I still ran out of space. That leaves <code>C-s</code> for more name-space
for the left and right side. I&rsquo;m glad to try this out.</li>
</ul></li>
</ul>

<p>
For example, in Org-Mode:
</p>

<ul class="org-ul">
<li>I traverse the entire document very quickly with
<code>org-babel-previous-src-block</code> and and <code>org-babel-next-src-block.</code></li>
<li>I execute source-blocks.</li>
<li>I edit source-blocks.</li>
</ul>

<p>
Every activity is related to reading, modifying, executing, and tangling code.
</p>
</div>
</li>
