help.org
**** =Key-Chord=
     :PROPERTIES:
     :ID:       org_gcr_2017-05-12_mara:D7EDA057-1289-4EB9-8A72-3B00DC3C87BA
     :END:

Key-Chord is intriguing because it works on every keyboard. It is powerful
because it can you bring you to any =place= easily. It is good for taking you
places in two differnt kinds of scenarios.

One example is grammar-checking. There are a few ways to do that. I don't
remember them all. In a given mode I want to see a list of all the ways.
I really just want to see all of the stuff that I value for a given mode and
don't use frequently.

Another example are things that I value for a mode and use a lot but are not
logically related to other activities in that place. For example moving the
mark around and going to lines are performed a lot so they need to be done
quickly and left. This is a place where key-chords and the shift modifier are
a fast and intuitive way to go places.

***** Single-Key Key-Chord Name-Space.
      :PROPERTIES:
      :ID:       org_gcr_2017-05-12_mara:13704474-DDBB-4D3E-995B-51B7860535DD
      :END:
      :Actions:          High
      :Expertise:        Low
      :Frequency:        High
      :Relationship:     Low

- Nice if you don't mind hitting the same key twice.
- You will use come here often, perform your single =action=, and be done
  and leave very frequently and quickly.
- Using alphabetical characters always results in unpleasant surprises.
- Harder for breakage but it still occurs.
  - =#FF= color code.
  - =cc= carbon copy.
  - =JJ= nick-name.
    - Rare! Using.
  - =dd= add
- Symbols are more likely to be safer bets.
  - Only use the symbols.
    - 8 if you use rows 3-4; 16 if you shift.
    - Fifth row has 13; 26 with shift.
- Good vehicle to reach a Hydra.

***** Two-Key Key-Chord Name-Space.
      :PROPERTIES:
      :ID:       org_gcr_2017-05-12_mara:033FD965-8C1D-46E4-87FC-4A1E50C746A9
      :END:
      :Actions:          Low
      :Expertise:        High
      :Frequency:        High
      :Relationship:     Low

- Very attractive.
- Nice if you don't like hitting the same key twice.
- Easy to use all fingers.
  - Finger strength is not an issue here; use any of them.
- Unexpected breakage very easy.
  - =cd= in ~=eshell=~.
- Use sparingly.
- Not worth analyzing ideal combinations; just use it and see if it
  doesn't break.
- Bringing over existing bindings. They are all for every mode so I will
  keep it that way.

**** =Hydra=
      :PROPERTIES:
      :Actions:          High
      :Expertise:        Low
      :Frequency:        Low
      :Relationship:     High
      :ID:       org_gcr_2017-05-12_mara:631201BF-3F66-4C64-A7DC-00B46A3B39ED
      :END:

- Sometimes you want to do something in a =place= but you aren't sure what
  and you aren't sure where you will go next from there. For example you
  might want to perform an Org-Mode =action= that is important but you don't
  really use much. For example exporting to HTML might not be common for
  you but you value.
- =Hydras= can be used for very related actions too. The difference between
  the =s= name-space is the distance between them and where you are now.
  In the =s= namespace you go there very quickly. For =Hydras= sometimes you
  can get the fast and sometimes more slowly. They are complementary to
  every name-space.
- =SHIFT= doubles your key-space.
- Use =C-g= to exit the Hydra.

For example, in Org-Mode I am still learning about functions and haven't used
them much and forget their names. It is faster to put them in a Hydra. If they
get used a lot, I will add them to =s=.

