help.html

<li><a id="orge036eee"></a><code>Key-Chord</code><br>
<div class="outline-text-5" id="text-6-4-4-2">
<pre class="example">
ID: org_gcr_2017-05-12_mara:D7EDA057-1289-4EB9-8A72-3B00DC3C87BA
</pre>

<p>
Key-Chord is intriguing because it works on every keyboard. It is powerful
because it can you bring you to any <code>place</code> easily. It is good for taking you
places in two differnt kinds of scenarios.
</p>

<p>
One example is grammar-checking. There are a few ways to do that. I don&rsquo;t
remember them all. In a given mode I want to see a list of all the ways.
I really just want to see all of the stuff that I value for a given mode and
don&rsquo;t use frequently.
</p>

<p>
Another example are things that I value for a mode and use a lot but are not
logically related to other activities in that place. For example moving the
mark around and going to lines are performed a lot so they need to be done
quickly and left. This is a place where key-chords and the shift modifier are
a fast and intuitive way to go places.
</p>
</div>

<ol class="org-ol">
<li><a id="org749d63c"></a>Single-Key Key-Chord Name-Space.<br>
<div class="outline-text-6" id="text-6-4-4-2-1">
<pre class="example">
ID: org_gcr_2017-05-12_mara:13704474-DDBB-4D3E-995B-51B7860535DD
</pre>
<p>
:Actions:          High
:Expertise:        Low
:Frequency:        High
:Relationship:     Low
</p>

<ul class="org-ul">
<li>Nice if you don&rsquo;t mind hitting the same key twice.</li>
<li>You will use come here often, perform your single <code>action</code>, and be done
and leave very frequently and quickly.</li>
<li>Using alphabetical characters always results in unpleasant surprises.</li>
<li>Harder for breakage but it still occurs.
<ul class="org-ul">
<li><code>#FF</code> color code.</li>
<li><code>cc</code> carbon copy.</li>
<li><code>JJ</code> nick-name.
<ul class="org-ul">
<li>Rare! Using.</li>
</ul></li>
<li><code>dd</code> add</li>
</ul></li>
<li>Symbols are more likely to be safer bets.
<ul class="org-ul">
<li>Only use the symbols.
<ul class="org-ul">
<li>8 if you use rows 3-4; 16 if you shift.</li>
<li>Fifth row has 13; 26 with shift.</li>
</ul></li>
</ul></li>
<li>Good vehicle to reach a Hydra.</li>
</ul>
</div>
</li>

<li><a id="org2c2add9"></a>Two-Key Key-Chord Name-Space.<br>
<div class="outline-text-6" id="text-6-4-4-2-2">
<pre class="example">
ID: org_gcr_2017-05-12_mara:033FD965-8C1D-46E4-87FC-4A1E50C746A9
</pre>
<p>
:Actions:          Low
:Expertise:        High
:Frequency:        High
:Relationship:     Low
</p>

<ul class="org-ul">
<li>Very attractive.</li>
<li>Nice if you don&rsquo;t like hitting the same key twice.</li>
<li>Easy to use all fingers.
<ul class="org-ul">
<li>Finger strength is not an issue here; use any of them.</li>
</ul></li>
<li>Unexpected breakage very easy.
<ul class="org-ul">
<li><code>cd</code> in <code>=eshell=</code>.</li>
</ul></li>
<li>Use sparingly.</li>
<li>Not worth analyzing ideal combinations; just use it and see if it
doesn&rsquo;t break.</li>
<li>Bringing over existing bindings. They are all for every mode so I will
keep it that way.</li>
</ul>
</div>
</li>
</ol>
</li>

<li><a id="org1ee447e"></a><code>Hydra</code><br>
<div class="outline-text-5" id="text-6-4-4-3">
<pre class="example">
Actions: High
Expertise: Low
Frequency: Low
Relationship: High
ID: org_gcr_2017-05-12_mara:631201BF-3F66-4C64-A7DC-00B46A3B39ED
</pre>

<ul class="org-ul">
<li>Sometimes you want to do something in a <code>place</code> but you aren&rsquo;t sure what
and you aren&rsquo;t sure where you will go next from there. For example you
might want to perform an Org-Mode <code>action</code> that is important but you don&rsquo;t
really use much. For example exporting to HTML might not be common for
you but you value.</li>
<li><code>Hydras</code> can be used for very related actions too. The difference between
the <code>s</code> name-space is the distance between them and where you are now.
In the <code>s</code> namespace you go there very quickly. For <code>Hydras</code> sometimes you
can get the fast and sometimes more slowly. They are complementary to
every name-space.</li>
<li><code>SHIFT</code> doubles your key-space.</li>
<li>Use <code>C-g</code> to exit the Hydra.</li>
</ul>

<p>
For example, in Org-Mode I am still learning about functions and haven&rsquo;t used
them much and forget their names. It is faster to put them in a Hydra. If they
get used a lot, I will add them to <code>s</code>.
</p>
</div>
</li>
</ol>
</div>
