help.org
*** Building Your Own Keyboard
    :PROPERTIES:
    :ID:       org_gcr_2017-05-12_mara:BED4C08B-260A-4FC5-B5FF-AFEC420E9C66
    :END:

As your mastery of EMACS grows so too will your desire to build your own
keyboard. It is natural. As you explore various dimensions of expression you
will have a lot of fun. You will act more quickly and skillfully. Even with the
goals of this system in place the desire grows.

3D printing is one area worth exploring. A lot of EMACS users design and print
their own custom keyboards. That looks very fun. [[http://scripts.sil.org/cms/scripts/page.php?site_id%3Dnrsi&id%3Dukelele][Ukulele]] is softer way to
explore your keyboard. Reading its user manual is important. It contains ideas
about stack-able-environments for bindings. You may use Ukulele or Hydras to do
the same thing. [[https://pqrs.org/osx/karabiner/][Karabiner]] is a nice way to re-map your keys. It's easiest
adjustment is to make return act as return when pressed alone and as control
when pressed with another key. That introduces a symmetry to your keyboard which
can be helpful. All of those dimensions are worth exploring.

When I explored them I felt that they led me further away from the majority of
users. Every time explored a different key-mapping (not key-binding) it reduced
accessibility for new users. Each time I tried to work around that hiccup. The
last pursuit was =;= and space.

It would be great to set up your keyboard with the meta keys on the bottom
like this:

#+BEGIN_EXAMPLE
+---------------------------------------+
| +-----+                       +-----+ |
| |RET  |                       |  RET| |
| +-----+                       +-----+ |
| +------+                     +------+ |
| |SHIFT |                     | SHIFT| |
| +------+                     +------+ |
|        +-+ +-+ +-----+ +-+ +-+        |
|        |s| |M| |C/spc| |M| |s|        |
|        +-+ +-+ +-----+ +-+ +-+        |
|                                       |
+---------------------------------------+
#+END_EXAMPLE

Karabiner was too slow for my typing speed though. It [[https://www.reddit.com/r/emacs/comments/38qllb/karabiner_space_as_control/][happens]]. It seemed like a
minimal change to use Ukelele to:

- Make space send =C=
- Make =;= send space
- Make ='= a dead key
  - In it's dead key state make
    - =;= \rarr =;=
    - =:= \rarr =:=
    - ='= \rarr ='=
    - ="= \rarr ="=

The trouble is that it violates the POLA. Therefore, I left it alone and stuck
with a simple "Get C on both sides".

That has worked out very well. It is very easy to do on every operating system.
It holds true to the values of this system. When you develop an idea of =places= and
how often you go there the key-mapping becomes more obvious. Make it easy to get
to key-bindings that take you to familiar places. For this system it is the home
keys, =s=, and =key-chord=. Make those keys more easily accessible. =C= and =M= often
have symmetric-definitions. =s= and =SHIFT= also often have symmetric definitions in
this system (mostly through Key-Chords). Therefore those key-mappings are kept
close together

#+BEGIN_EXAMPLE
+---------------------------------------+
| +-----+                       +-----+ |
| |s    |                       |s/ret| |
| +-----+                       +-----+ |
| +------+                     +------+ |
| |SHIFT |                     | SHIFT| |
| +------+                     +------+ |
|        +-+ +-+ +-----+ +-+ +-+        |
|        |M| |C| |spc  | |C| |M|        |
|        +-+ +-+ +-----+ +-+ +-+        |
|                                       |
+---------------------------------------+
#+END_EXAMPLE

On OS X Dyalog uses an input source for entering APL symbols. Enable its input
source, press option-i, and you get the symbol ⍳ (APL FUNCTIONAL SYMBOL IOTA).
It should work in every OS X application. When I tried to use it in Emacs
though it didn't work. This configuration swallows the option key and
translates it to the Emacs Super key. Any option chords are never sent to
OS X. This had worked fine because I'd never used command. Most of the time I
want Emacs to work this way, but some of the time I want to pass command
through to OS X. How can I do this?

When I read the Emacs documentation they explained that you can choose whether
or not you want ALT or GUI (option and command on OS X) to be swallowed by
Emacs or passed through to the OS. Most of us already have this in our config.
How can we switch it back and forth then?

Elisp is of course the solution so I wrote some code to toggle this behavior.
It didn't work! Didn't look like a bug in my code so I dug a little further
into the documentation. Around the same time I was reading the USB HID
specification. The spec explains that for every modifier there is both a left
and a right code. When I got to the relevant document for Emacs it all started
to make sense: the toggling modifier keys in Emacs only works for the right
keys!

It is exciting to learn that Emacs makes this distinction. What I found next
though was that it only works when the OS tells Emacs which modifier it is,
but not from Karabiner. It makes sense, Emacs expects to be told at a lower
level than Karabiner runs. Long story short I had to change the layout to get
the toggling behavior that I wanted.

For simplicity I added a Hydra to toggle both the option and the function key
between being sent to the OS or swallowed by Emacs.

Function started making a place in my config as Hyper after I got tired of
searching for combinations of Hydras for common actions.

These changes helped guide the custom keyboard design.

#+BEGIN_EXAMPLE
+---------------------------------------+
| +-----+                       +-----+ |
| |C    |                       |C/ret| |
| +-----+                       +-----+ |
| +------+                     +------+ |
| |SHIFT |                     | SHIFT| |
| +------+                     +------+ |
| +-+    +-+ +-+ +-----+ +-+ +-+        |
| |H|    |s| |M| |spc  | |M| |s|        |
| +-+    +-+ +-+ +-----+ +-+ +-+        |
|                                       |
+---------------------------------------+
#+END_EXAMPLE

** Take a Sip
   :PROPERTIES:
   :ID:       org_gcr_2017-05-12_mara:D33533BC-3E1F-4E7E-B9B3-2C0D0518400E
   :END:

*** Left Side
    :PROPERTIES:
    :ID:       org_gcr_2017-05-12_mara:6F293EA2-D2D4-42F7-8684-D5B53CB849DA
    :END:

Keybindings for every mode. Starts and stop:

- 1-5
- Q-T
- A-G
- Z-B

