help.html

<div id="outline-container-org7dd1e91" class="outline-4">
<h4 id="org7dd1e91"><span class="section-number-4">6.4.5</span> Building Your Own Keyboard</h4>
<div class="outline-text-4" id="text-6-4-5">
<pre class="example">
ID: org_gcr_2017-05-12_mara:BED4C08B-260A-4FC5-B5FF-AFEC420E9C66
</pre>

<p>
As your mastery of EMACS grows so too will your desire to build your own
keyboard. It is natural. As you explore various dimensions of expression you
will have a lot of fun. You will act more quickly and skillfully. Even with the
goals of this system in place the desire grows.
</p>

<p>
3D printing is one area worth exploring. A lot of EMACS users design and print
their own custom keyboards. That looks very fun. <a href="http://scripts.sil.org/cms/scripts/page.php?site_id=nrsi&amp;id=ukelele">Ukulele</a> is softer way to
explore your keyboard. Reading its user manual is important. It contains ideas
about stack-able-environments for bindings. You may use Ukulele or Hydras to do
the same thing. <a href="https://pqrs.org/osx/karabiner/">Karabiner</a> is a nice way to re-map your keys. It&rsquo;s easiest
adjustment is to make return act as return when pressed alone and as control
when pressed with another key. That introduces a symmetry to your keyboard which
can be helpful. All of those dimensions are worth exploring.
</p>

<p>
When I explored them I felt that they led me further away from the majority of
users. Every time explored a different key-mapping (not key-binding) it reduced
accessibility for new users. Each time I tried to work around that hiccup. The
last pursuit was <code>;</code> and space.
</p>

<p>
It would be great to set up your keyboard with the meta keys on the bottom
like this:
</p>

<pre class="example">
+---------------------------------------+
| +-----+                       +-----+ |
| |RET  |                       |  RET| |
| +-----+                       +-----+ |
| +------+                     +------+ |
| |SHIFT |                     | SHIFT| |
| +------+                     +------+ |
|        +-+ +-+ +-----+ +-+ +-+        |
|        |s| |M| |C/spc| |M| |s|        |
|        +-+ +-+ +-----+ +-+ +-+        |
|                                       |
+---------------------------------------+
</pre>

<p>
Karabiner was too slow for my typing speed though. It <a href="https://www.reddit.com/r/emacs/comments/38qllb/karabiner_space_as_control/">happens</a>. It seemed like a
minimal change to use Ukelele to:
</p>

<ul class="org-ul">
<li>Make space send <code>C</code></li>
<li>Make <code>;</code> send space</li>
<li>Make <code>'</code> a dead key
<ul class="org-ul">
<li>In it&rsquo;s dead key state make
<ul class="org-ul">
<li><code>;</code> &rarr; <code>;</code></li>
<li><code>:</code> &rarr; <code>:</code></li>
<li><code>'</code> &rarr; <code>'</code></li>
<li><code>"</code> &rarr; <code>"</code></li>
</ul></li>
</ul></li>
</ul>

<p>
The trouble is that it violates the POLA. Therefore, I left it alone and stuck
with a simple &ldquo;Get C on both sides&rdquo;.
</p>

<p>
That has worked out very well. It is very easy to do on every operating system.
It holds true to the values of this system. When you develop an idea of <code>places</code> and
how often you go there the key-mapping becomes more obvious. Make it easy to get
to key-bindings that take you to familiar places. For this system it is the home
keys, <code>s</code>, and <code>key-chord</code>. Make those keys more easily accessible. <code>C</code> and <code>M</code> often
have symmetric-definitions. <code>s</code> and <code>SHIFT</code> also often have symmetric definitions in
this system (mostly through Key-Chords). Therefore those key-mappings are kept
close together
</p>

<pre class="example">
+---------------------------------------+
| +-----+                       +-----+ |
| |s    |                       |s/ret| |
| +-----+                       +-----+ |
| +------+                     +------+ |
| |SHIFT |                     | SHIFT| |
| +------+                     +------+ |
|        +-+ +-+ +-----+ +-+ +-+        |
|        |M| |C| |spc  | |C| |M|        |
|        +-+ +-+ +-----+ +-+ +-+        |
|                                       |
+---------------------------------------+
</pre>

<p>
On OS X Dyalog uses an input source for entering APL symbols. Enable its input
source, press option-i, and you get the symbol  (APL FUNCTIONAL SYMBOL IOTA).
It should work in every OS X application. When I tried to use it in Emacs
though it didn&rsquo;t work. This configuration swallows the option key and
translates it to the Emacs Super key. Any option chords are never sent to
OS X. This had worked fine because I&rsquo;d never used command. Most of the time I
want Emacs to work this way, but some of the time I want to pass command
through to OS X. How can I do this?
</p>

<p>
When I read the Emacs documentation they explained that you can choose whether
or not you want ALT or GUI (option and command on OS X) to be swallowed by
Emacs or passed through to the OS. Most of us already have this in our config.
How can we switch it back and forth then?
</p>

<p>
Elisp is of course the solution so I wrote some code to toggle this behavior.
It didn&rsquo;t work! Didn&rsquo;t look like a bug in my code so I dug a little further
into the documentation. Around the same time I was reading the USB HID
specification. The spec explains that for every modifier there is both a left
and a right code. When I got to the relevant document for Emacs it all started
to make sense: the toggling modifier keys in Emacs only works for the right
keys!
</p>

<p>
It is exciting to learn that Emacs makes this distinction. What I found next
though was that it only works when the OS tells Emacs which modifier it is,
but not from Karabiner. It makes sense, Emacs expects to be told at a lower
level than Karabiner runs. Long story short I had to change the layout to get
the toggling behavior that I wanted.
</p>

<p>
For simplicity I added a Hydra to toggle both the option and the function key
between being sent to the OS or swallowed by Emacs.
</p>

<p>
Function started making a place in my config as Hyper after I got tired of
searching for combinations of Hydras for common actions.
</p>

<p>
These changes helped guide the custom keyboard design.
</p>

<pre class="example">
+---------------------------------------+
| +-----+                       +-----+ |
| |C    |                       |C/ret| |
| +-----+                       +-----+ |
| +------+                     +------+ |
| |SHIFT |                     | SHIFT| |
| +------+                     +------+ |
| +-+    +-+ +-+ +-----+ +-+ +-+        |
| |H|    |s| |M| |spc  | |M| |s|        |
| +-+    +-+ +-+ +-----+ +-+ +-+        |
|                                       |
+---------------------------------------+
</pre>
</div>
</div>
</div>

<div id="outline-container-org8168196" class="outline-3">
<h3 id="org8168196"><span class="section-number-3">6.5</span> Take a Sip</h3>
<div class="outline-text-3" id="text-6-5">
<pre class="example">
ID: org_gcr_2017-05-12_mara:D33533BC-3E1F-4E7E-B9B3-2C0D0518400E
</pre>
</div>

<div id="outline-container-org0915e41" class="outline-4">
<h4 id="org0915e41"><span class="section-number-4">6.5.1</span> Left Side</h4>
<div class="outline-text-4" id="text-6-5-1">
<pre class="example">
ID: org_gcr_2017-05-12_mara:6F293EA2-D2D4-42F7-8684-D5B53CB849DA
</pre>

<p>
Keybindings for every mode. Starts and stop:
</p>

<ul class="org-ul">
<li>1-5</li>
<li>Q-T</li>
<li>A-G</li>
<li>Z-B</li>
</ul>
</div>

<ol class="org-ol">
