help.org
**** Row 5
     :PROPERTIES:
     :ID:       org_gcr_2017-05-12_mara:5E250B06-C35C-4AEE-90C6-F5333A2D1BE3
     :END:

#+NAME: org_gcr_2017-05-12_mara_8125C96A-8971-45FC-A8D2-30FDC438B71C
#+BEGIN_SRC emacs-lisp
(defun help/go-there-or-back (name)
  (if (equal (buffer-name) name)
      (help/safb-switch-to-previous-buffer)
    (switch-to-buffer name)))
(global-set-key (kbd "C-9") (lambda () (interactive) (help/go-there-or-back
                                                 "projects.org")))
(global-set-key (kbd "C-0") (lambda () (interactive) (help/go-there-or-back
                                                 "scratch.org")))
(global-set-key (kbd "M-9") (lambda () (interactive) (help/go-there-or-back
                                                 "help.org")))
(global-set-key (kbd "M-0") (lambda () (interactive) (help/go-there-or-back
                                                 "*scratch*")))
(global-set-key (kbd "C-5") #'ido-kill-buffer)
(global-set-key (kbd "C--") (lambda () (interactive) (insert "Vigneswari")))
(global-set-key (kbd "s-5") #'mc/mark-previous-like-this)
(global-set-key (kbd "s-4") #'mc/mark-next-like-this)
(global-set-key (kbd "s-3") #'mc/mark-previous-like-this)
(global-set-key (kbd "s-2") #'mc/mark-all-like-this)
(global-set-key (kbd "s-1") #'mc/edit-lines)
(global-set-key (kbd "s--") #'decrement-integer-at-point)
(global-set-key (kbd "s-+") #'increment-integer-at-point)
#+END_SRC

Checking things.

#+NAME: org_gcr_2017-06-13_mara_2DFDC64B-DBF2-473E-979F-D7D8D0DD2206
#+BEGIN_SRC emacs-lisp
(defhydra help/hydra-checking (:color blue
                                      :hint nil)
  "
Flycheck On? %(bound-and-true-p flycheck-mode)
 WriteGood On? %(bound-and-true-p writegood-mode)
  _j_ checker/toggle _k_ checker/run _l_ checker/list
   _u_ writegood/toggle _i_ grade-level _o_ reading-ease
    _q_ quit
"
  ("j" flycheck-mode :exit nil)
  ("k" flycheck-buffer :exit nil)
  ("l" help/safb-flycheck-list-errors)
  ("u" writegood-mode)
  ("i" writegood-grade-level :exit nil)
  ("o" writegood-reading-ease :exit nil)
  ("q" nil))
(global-set-key (kbd "C-M-9") #'help/hydra-checking/body)
#+END_SRC

**** Row 4
     :PROPERTIES:
     :ID:       org_gcr_2017-05-12_mara:20E96ACD-1D91-480C-BA3B-D5730EA2173C
     :END:

#+NAME: org_gcr_2017-05-12_mara_1251CF6D-E4D3-45D9-A3DB-FF68D814E389
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-M-1") #'help/1-window)
(global-set-key (kbd "C-M-2") #'help/2-window)
(global-set-key (kbd "C-M-3") #'help/3-window)
(global-set-key (kbd "C-M-4") #'help/4-window)
(defun help/copy-entire-buffer ()
  (interactive)
  (save-excursion
    (call-interactively 'mark-whole-buffer)
    (call-interactively 'kill-ring-save)
    (message "Buffer contents copied")))
(global-set-key (kbd "s-w") #'help/copy-entire-buffer)
(global-set-key (kbd "s-q") #'kill-buffer)
(global-set-key (kbd "s-t") #'ert)
(global-set-key (kbd "C-M-y") #'insert-char)
(global-set-key [(control meta ?p)] #'help/insert-datestamp)
(global-set-key [(control meta shift ?p)] #'help/insert-timestamp*-no-colons)
(global-set-key (kbd "C-M-o") #'help/occur-dwim)
(global-set-key (kbd "M-i") nil)
(global-set-key (kbd "M-i") #'help/hydra/left/describe/body)
(defhydra help/hydra/left/describe (:color blue
                                           :hint nil)
  "
Describe Something
 _t_ theme _i_ input method _o_ lighter indicator _O_ lighter symbol _p_ package _P_ text properties
  _s_ symbol _f_ function _F_ flycheck checker _k_ key briefly _K_ key _l_ language environment
   _c_ char _C_ coding system _v_ variable _b_ bindings _B_ personal bindings _n_ current coding system briefly _N_ current coding system full _m_ major mode _M_ minor mode
    _q_ quit
"
  ("b" describe-bindings)
  ("B" describe-personal-keybindings)
  ("C" describe-categories)
  ("c" describe-char)
  ("C" describe-coding-system)
  ("f" describe-function)
  ("F" flycheck-describe-checker)
  ("i" describe-input-method)
  ("K" describe-key)
  ("k" describe-key-briefly)
  ("l" describe-language-environment)
  ("M" describe-minor-mode)
  ("m" describe-mode)
  ("N" describe-current-coding-system)
  ("n" describe-current-coding-system-briefly)
  ("o" describe-minor-mode-from-indicator)
  ("O" describe-minor-mode-from-symbol)
  ("p" describe-package)
  ("P" describe-text-properties)
  ("q" nil)
  ("s" describe-symbol)
  ("t" describe-theme)
  ("v" describe-variable))
#+END_SRC

Org handle ~TAB~ correctly and nothing is bound to it like ~Auto-Complete~ or
~yasnippet~ so this doesn't /need/ ot use ~C-i~ freeing it up. Rebinding ~C-g~ seems
to make the minibuffer, ~eval-*~ and ~smex~ become confused \rarr quit working.

