help.html
<li><a id="org3d67883"></a>Row 5<br>
<div class="outline-text-5" id="text-6-5-1-1">
<pre class="example">
ID: org_gcr_2017-05-12_mara:5E250B06-C35C-4AEE-90C6-F5333A2D1BE3
</pre>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgf254da9">(<span class="org-keyword">defun</span> <span class="org-function-name">help/go-there-or-back</span> (name)
  (<span class="org-keyword">if</span> (equal (buffer-name) name)
      (help/safb-switch-to-previous-buffer)
    (switch-to-buffer name)))
(global-set-key (kbd <span class="org-string">"C-9"</span>) (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>) (help/go-there-or-back
                                                 <span class="org-string">"projects.org"</span>)))
(global-set-key (kbd <span class="org-string">"C-0"</span>) (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>) (help/go-there-or-back
                                                 <span class="org-string">"scratch.org"</span>)))
(global-set-key (kbd <span class="org-string">"M-9"</span>) (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>) (help/go-there-or-back
                                                 <span class="org-string">"help.org"</span>)))
(global-set-key (kbd <span class="org-string">"M-0"</span>) (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>) (help/go-there-or-back
                                                 <span class="org-string">"*scratch*"</span>)))
(global-set-key (kbd <span class="org-string">"C-5"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">ido-kill-buffer</span>)
(global-set-key (kbd <span class="org-string">"C--"</span>) (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>) (insert <span class="org-string">"Vigneswari"</span>)))
(global-set-key (kbd <span class="org-string">"s-5"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">mc/mark-previous-like-this</span>)
(global-set-key (kbd <span class="org-string">"s-4"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">mc/mark-next-like-this</span>)
(global-set-key (kbd <span class="org-string">"s-3"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">mc/mark-previous-like-this</span>)
(global-set-key (kbd <span class="org-string">"s-2"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">mc/mark-all-like-this</span>)
(global-set-key (kbd <span class="org-string">"s-1"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">mc/edit-lines</span>)
(global-set-key (kbd <span class="org-string">"s--"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">decrement-integer-at-point</span>)
(global-set-key (kbd <span class="org-string">"s-+"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">increment-integer-at-point</span>)
</pre>
</div>

<p>
Checking things.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgf2afa46">(<span class="org-keyword">defhydra</span> help/hydra-checking (<span class="org-builtin">:color</span> <span class="custom-1"><span class="custom">blue</span></span>
                                      <span class="org-builtin">:hint</span> nil)
  <span class="org-doc">"</span>
<span class="org-doc">Flycheck On? %(bound-and-true-p flycheck-mode)</span>
<span class="org-doc"> WriteGood On? %(bound-and-true-p writegood-mode)</span>
<span class="org-doc">  _j_ checker/toggle _k_ checker/run _l_ checker/list</span>
<span class="org-doc">   _u_ writegood/toggle _i_ grade-level _o_ reading-ease</span>
<span class="org-doc">    _q_ quit</span>
<span class="org-doc">"</span>
  (<span class="org-string">"j"</span> flycheck-mode <span class="org-builtin">:exit</span> nil)
  (<span class="org-string">"k"</span> flycheck-buffer <span class="org-builtin">:exit</span> nil)
  (<span class="org-string">"l"</span> help/safb-flycheck-list-errors)
  (<span class="org-string">"u"</span> writegood-mode)
  (<span class="org-string">"i"</span> writegood-grade-level <span class="org-builtin">:exit</span> nil)
  (<span class="org-string">"o"</span> writegood-reading-ease <span class="org-builtin">:exit</span> nil)
  (<span class="org-string">"q"</span> nil))
(global-set-key (kbd <span class="org-string">"C-M-9"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/hydra-checking/body</span>)
</pre>
</div>
</div>
</li>

<li><a id="orga516a2d"></a>Row 4<br>
<div class="outline-text-5" id="text-6-5-1-2">
<pre class="example">
ID: org_gcr_2017-05-12_mara:20E96ACD-1D91-480C-BA3B-D5730EA2173C
</pre>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org6eacfe4">(global-set-key (kbd <span class="org-string">"C-M-1"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/1-window</span>)
(global-set-key (kbd <span class="org-string">"C-M-2"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/2-window</span>)
(global-set-key (kbd <span class="org-string">"C-M-3"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/3-window</span>)
(global-set-key (kbd <span class="org-string">"C-M-4"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/4-window</span>)
(<span class="org-keyword">defun</span> <span class="org-function-name">help/copy-entire-buffer</span> ()
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">save-excursion</span>
    (call-interactively <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">mark-whole-buffer</span>)
    (call-interactively <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">kill-ring-save</span>)
    (message <span class="org-string">"Buffer contents copied"</span>)))
(global-set-key (kbd <span class="org-string">"s-w"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/copy-entire-buffer</span>)
(global-set-key (kbd <span class="org-string">"s-q"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">kill-buffer</span>)
(global-set-key (kbd <span class="org-string">"C-M-y"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">insert-char</span>)
(global-set-key [(control meta ?p)] <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/insert-datestamp</span>)
(global-set-key [(control meta shift ?p)] <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/insert-timestamp*-no-colons</span>)
(global-set-key (kbd <span class="org-string">"C-M-o"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/occur-dwim</span>)
(global-set-key (kbd <span class="org-string">"M-i"</span>) nil)
(global-set-key (kbd <span class="org-string">"M-i"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/hydra/left/describe/body</span>)
(<span class="org-keyword">defhydra</span> help/hydra/left/describe (<span class="org-builtin">:color</span> <span class="custom"><span class="custom-1">blue</span></span>
                                           <span class="org-builtin">:hint</span> nil)
  <span class="org-doc">"</span>
<span class="org-doc">Describe Something</span>
<span class="org-doc"> _t_ theme _i_ input method _o_ lighter indicator _O_ lighter symbol _p_ package _P_ text properties</span>
<span class="org-doc">  _s_ symbol _f_ function _F_ flycheck checker _k_ key briefly _K_ key _l_ language environment</span>
<span class="org-doc">   _c_ char _C_ coding system _v_ variable _b_ bindings _B_ personal bindings _n_ current coding system briefly _N_ current coding system full _m_ major mode _M_ minor mode</span>
<span class="org-doc">    _q_ quit</span>
<span class="org-doc">"</span>
  (<span class="org-string">"b"</span> describe-bindings)
  (<span class="org-string">"B"</span> describe-personal-keybindings)
  (<span class="org-string">"C"</span> describe-categories)
  (<span class="org-string">"c"</span> describe-char)
  (<span class="org-string">"C"</span> describe-coding-system)
  (<span class="org-string">"f"</span> describe-function)
  (<span class="org-string">"F"</span> flycheck-describe-checker)
  (<span class="org-string">"i"</span> describe-input-method)
  (<span class="org-string">"K"</span> describe-key)
  (<span class="org-string">"k"</span> describe-key-briefly)
  (<span class="org-string">"l"</span> describe-language-environment)
  (<span class="org-string">"M"</span> describe-minor-mode)
  (<span class="org-string">"m"</span> describe-mode)
  (<span class="org-string">"N"</span> describe-current-coding-system)
  (<span class="org-string">"n"</span> describe-current-coding-system-briefly)
  (<span class="org-string">"o"</span> describe-minor-mode-from-indicator)
  (<span class="org-string">"O"</span> describe-minor-mode-from-symbol)
  (<span class="org-string">"p"</span> describe-package)
  (<span class="org-string">"P"</span> describe-text-properties)
  (<span class="org-string">"q"</span> nil)
  (<span class="org-string">"s"</span> describe-symbol)
  (<span class="org-string">"t"</span> describe-theme)
  (<span class="org-string">"v"</span> describe-variable))
</pre>
</div>

<p>
Org handle <code>TAB</code> correctly and nothing is bound to it like <code>Auto-Complete</code> or
<code>yasnippet</code> so this doesn&rsquo;t <i>need</i> ot use <code>C-i</code> freeing it up. Rebinding <code>C-g</code> seems
to make the minibuffer, <code>eval-*</code> and <code>smex</code> become confused &rarr; quit working.
</p>
</div>
</li>
