help.org
**** Row 3
     :PROPERTIES:
     :ID:       org_gcr_2017-05-12_mara:C0B604C5-F530-4770-9061-92E8468C8557
     :END:

Eval expression.

#+NAME: org_gcr_2017-06-13_mara_8E6A3551-A1CE-4879-AC6F-EF74EA1D8A7D
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-M-j"))
(global-set-key (kbd "M-:") #'my-eval-expression)
(global-set-key (kbd "C-c C-k") #'help/delete-this-buffer-and-file)
#+END_SRC

#+NAME: org_gcr_2017-05-12_mara_E8ABDA7D-AC92-4C24-8287-1505E2377B2C
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-h") nil)
(global-set-key (kbd "C-h") #'ace-window)
#+END_SRC

In Org-Mode I constantly use ~s-h~ for tangling. When I forget that I am /out of/
Org-Mode and I hit ~s-h~ it hides Emacs. Oops!

#+NAME: org_gcr_2017-05-12_mara_A26325F2-9D6C-49EE-8CBE-DC552C6F315F
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "s-h") nil)
#+END_SRC

#+NAME: org_gcr_2017-05-12_mara_20330335-75E6-4AB4-A661-D291315FAFD7
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-M-j") #'help/safb-switch-to-previous-buffer)
(global-set-key (kbd "s-d") #'er/expand-region)
#+END_SRC

#+NAME: org_gcr_2017-05-12_mara_095E1EC7-12A2-43BB-8ED5-CF2BC6E7D158
#+BEGIN_SRC emacs-lisp
(defhydra help/hydra/left-side/global (:color blue
                                              :hint nil)
  "
_O_ base64-encode-region _P_ base64-decode-region _|_ split-window-horizontally _-_ split-window-vertically
_1_ reset-font _2_ -font  _3_ +font _4_ ellipsis _5_ UUID _6_ bfr-cdng-systm
_w_ widen _=_ reposition-window _t_ rectangle-mark _y_ yas tables _Y_ transparency _u_ ucs-insert _i_ scrollUp _I_ prevLogLine _o_ dbgOnErr _p_ query-replace _}_ transliterate
_Q_ exit-Emacs _q_uit T_ trademarks
_A_ apropo'ish _s_ help/toggle-mac-right-option-modifier _S_ help/toggle-mac-function-modifier _d_ dash-at-point  _D_ detangle _g_ grep _j_ obtj2o _k_ scrollDown _K_ nextLogLine  _;_ toggle-lax-whitespace
_l_ visual-line-mode _L_ aggressive-indent-mode
_x_ delete-indentation _X_pm grok _c_ fill-paragraph _V_ view-mode _b_ erase-buffer _B_ibtex _n_ normal _m_ checks _M_ hide modeline
_<_ cmtIn _>_ cmtOut _?_ snp"
  ("Q" help/safb-save-buffers-kill-terminal)
  ("q" nil)
  ("|" split-window-horizontally)
  ("-" split-window-vertically)
  ("1" help/font-size-reset :exit nil)
  ("2" help/text-scale-decrease :exit nil)
  ("3" help/text-scale-increase :exit nil)
  ("4" help/insert-ellipsis)
  ("r" count-words)
  ("R" help/rename-current-buffer-file)
  ("T" help/trademark/body)
  ("=" reposition-window)
  ("5" help/uuid)
  ("6" set-buffer-file-coding-system)
  ("A" hydra-apropos-ish/body)
  ("s" help/toggle-mac-right-option-modifier)
  ("g" grep)
  ("h" hack-local-variable)
  ("l" visual-line-mode)
  ("L" aggressive-indent-mode)
  ("S" help/toggle-mac-function-modifier)
  ("x" delete-indentation)
  ("X" xpm-grok)
  ("f" help/hydra/ag/body)
  ("V" view-mode)
  ("w" widen)
  ("t" rectangle-mark-mode)
  ("y" yas-describe-tables)
  ("Y" hydra-transparency/body)
  ("j" org-babel-tangle-jump-to-org)
  ("u" ucs-insert)
  ("i" scroll-down-command :exit nil)
  ("d" dash-at-point)
  ("D" help/safb-org-babel-detangle)
  ("k" scroll-up-command :exit nil)
  ("I" previous-logical-line :exit nil)
  ("K" next-logical-line :exit nil)
  ("n" help/safb-normal-mode)
  ("m" help/checks/body)
  ("M" hidden-mode-line-mode)
  ("<" help/chs)
  (">" help/che)
  ("." help/parent-mode-display)
  ("?" help/insert-noticeable-snip-comment-line)
  (";" isearch-toggle-lax-whitespace)
  ("o" toggle-debug-on-error)
  ("p" anzu-query-replace)
  ("O" base64-encode-region)
  ("P" base64-decode-region)
  ("}" help/hydra/transliterate/body)
  ("c" fill-paragraph )
  ("b" erase-buffer)
  ("B" help/bibtex/body)
  ("'" help/move-file)
  ("\"" imenu-list-minor-mode))
#+END_SRC

#+NAME: org_gcr_2017-05-12_mara_28B4A661-E888-4EFA-ADE3-4B1C05F6E92B
#+BEGIN_SRC emacs-lisp
(key-chord-define-global "vv" #'help/hydra/left-side/global/body)
#+END_SRC

[[https://github.com/abo-abo/hydra/blob/master/hydra-examples.el][Attribution.]]

#+NAME: org_gcr_2017-05-12_mara_C93A4DB7-1441-4DBA-B586-76266C5C30DF
#+BEGIN_SRC emacs-lisp
(defhydra hydra-apropos-ish (:color blue
                                    :hint nil)
  "
_a_propos        _c_ommand
_d_ocumentation  _l_ibrary
_v_ariable       _u_ser-option
valu_e_          _i_nfo
e_m_acs          elis_p_
"
  ("a" apropos)
  ("d" apropos-documentation)
  ("v" apropos-variable)
  ("c" apropos-command)
  ("l" apropos-library)
  ("u" apropos-user-option)
  ("i" info-apropos)
  ("e" apropos-value)
  ("m" emacs-index-search)
  ("p" elisp-index-search))
#+END_SRC

Trademark.


#+NAME: org_gcr_2017-05-12_mara_EE5F8793-8604-4041-8D91-DBC419809947
#+BEGIN_SRC emacs-lisp
(defhydra help/trademark (:color blue :hint nil)
  "
American _R_egistered Trademark
American _U_nregistered Trademark
American _S_ervice Mark
_J_apanese Industrial Standard
_K_orean Standard
"
  ("R" (lambda () (interactive) (insert "®")))
  ("U" (lambda () (interactive) (insert "™")))
  ("S" (lambda () (interactive) (insert "℠")))
  ("J" (lambda () (interactive) (insert "〄")))
  ("K" (lambda () (interactive) (insert "㉿"))))
#+END_SRC

Kinds of checks.

#+NAME: org_gcr_2017-05-12_mara_E4413D83-9743-468B-BBAF-3FAF9E31F491
#+BEGIN_SRC emacs-lisp
(defhydra help/checks (:color blue :hint nil)
  "
_q_ ✓ _w_ ✗ _e_ ☐ _r_ ☑ _t_ ☒_
"
  ("q" (lambda () (interactive) (insert "✓")) :exit nil)
  ("w" (lambda () (interactive) (insert "✗")) :exit nil)
  ("e" (lambda () (interactive) (insert "☐")) :exit nil)
  ("r" (lambda () (interactive) (insert "☑")) :exit nil)
  ("t" (lambda () (interactive) (insert "☒")) :exit nil))
#+END_SRC

BibTeX stuff.

#+NAME: org_gcr_2017-05-12_mara_D0F37886-4355-478C-A141-93F48E531CE5
#+BEGIN_SRC emacs-lisp
(defhydra help/bibtex (:color blue :hint nil)
  "
_c_ Clean Entry _C_ Clean Entry & Create New Reference
_f_ Reindent Field _F_ Reindent Buffer/Region
_m_ Disable Unhelpful Modes _M_ Enable Unhelpful Modes
"
  ("c" bibtex-clean-entry)
  ("C" (lambda () (interactive) (bibtex-clean-entry 't)))
  ("f" #'bibtex-fill-entry)
  ("F" #'bibtex-reformat)
  ;; Disable them
  ("m" (lambda () (interactive)
         (progn (aggressive-indent-mode 'toggle)
                (visual-line-mode 't))))
  ;; Enable them
  ("M" (lambda () (interactive)
         (progn (aggressive-indent-mode nil)
                (visual-line-mode nil)))))
#+END_SRC

