help.html

<li><a id="org2b99788"></a>Row 3<br>
<div class="outline-text-5" id="text-6-5-1-3">
<pre class="example">
ID: org_gcr_2017-05-12_mara:C0B604C5-F530-4770-9061-92E8468C8557
</pre>

<p>
Eval expression.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgc567176">(global-unset-key (kbd <span class="org-string">"C-M-j"</span>))
(global-set-key (kbd <span class="org-string">"M-:"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">my-eval-expression</span>)
(global-set-key (kbd <span class="org-string">"C-c C-k"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/delete-this-buffer-and-file</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org7d5eebd">(global-set-key (kbd <span class="org-string">"C-h"</span>) nil)
(global-set-key (kbd <span class="org-string">"C-h"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">ace-window</span>)
</pre>
</div>

<p>
In Org-Mode I constantly use <code>s-h</code> for tangling. When I forget that I am <i>out of</i>
Org-Mode and I hit <code>s-h</code> it hides Emacs. Oops!
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgb7bde98">(global-set-key (kbd <span class="org-string">"s-h"</span>) nil)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org4f83cb6">(global-set-key (kbd <span class="org-string">"C-M-j"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/safb-switch-to-previous-buffer</span>)
(global-set-key (kbd <span class="org-string">"s-d"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">er/expand-region</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgd4f45c4">(<span class="org-keyword">defhydra</span> help/hydra/left-side/global (<span class="org-builtin">:color</span> <span class="custom-1"><span class="custom">blue</span></span>
                                              <span class="org-builtin">:hint</span> nil)
  <span class="org-doc">"</span>
<span class="org-doc">_O_ base64-encode-region _P_ base64-decode-region _|_ split-window-horizontally _-_ split-window-vertically</span>
<span class="org-doc">_1_ reset-font _2_ -font  _3_ +font _4_ ellipsis _5_ UUID _6_ bfr-cdng-systm</span>
<span class="org-doc">_w_ widen _=_ reposition-window _t_ rectangle-mark _y_ yas tables _Y_ transparency _u_ ucs-insert _i_ scrollUp _I_ prevLogLine _o_ dbgOnErr _p_ query-replace _}_ transliterate</span>
<span class="org-doc">_Q_ exit-Emacs _q_uit T_ trademarks</span>
<span class="org-doc">_A_ apropo'ish _s_ help/toggle-mac-right-option-modifier _S_ help/toggle-mac-function-modifier _d_ dash-at-point  _D_ detangle _g_ grep _j_ obtj2o _k_ scrollDown _K_ nextLogLine  _;_ toggle-lax-whitespace</span>
<span class="org-doc">_l_ visual-line-mode _L_ aggressive-indent-mode</span>
<span class="org-doc">_x_ delete-indentation _X_pm grok _c_ fill-paragraph _V_ view-mode _b_ erase-buffer _B_ibtex _n_ normal _m_ desc/mode _M_ checks</span>
<span class="org-doc">_&lt;_ cmtIn _&gt;_ cmtOut _?_ snp"</span>
  (<span class="org-string">"Q"</span> help/safb-save-buffers-kill-terminal)
  (<span class="org-string">"q"</span> nil)
  (<span class="org-string">"|"</span> split-window-horizontally)
  (<span class="org-string">"-"</span> split-window-vertically)
  (<span class="org-string">"1"</span> help/font-size-reset <span class="org-builtin">:exit</span> nil)
  (<span class="org-string">"2"</span> help/text-scale-decrease <span class="org-builtin">:exit</span> nil)
  (<span class="org-string">"3"</span> help/text-scale-increase <span class="org-builtin">:exit</span> nil)
  (<span class="org-string">"4"</span> help/insert-ellipsis)
  (<span class="org-string">"r"</span> count-words)
  (<span class="org-string">"R"</span> help/rename-current-buffer-file)
  (<span class="org-string">"T"</span> help/trademark/body)
  (<span class="org-string">"="</span> reposition-window)
  (<span class="org-string">"5"</span> help/uuid)
  (<span class="org-string">"6"</span> set-buffer-file-coding-system)
  (<span class="org-string">"A"</span> hydra-apropos-ish/body)
  (<span class="org-string">"s"</span> help/toggle-mac-right-option-modifier)
  (<span class="org-string">"g"</span> grep)
  (<span class="org-string">"h"</span> hack-local-variable)
  (<span class="org-string">"l"</span> visual-line-mode)
  (<span class="org-string">"L"</span> aggressive-indent-mode)
  (<span class="org-string">"S"</span> help/toggle-mac-function-modifier)
  (<span class="org-string">"x"</span> delete-indentation)
  (<span class="org-string">"X"</span> xpm-grok)
  (<span class="org-string">"f"</span> describe-key)
  (<span class="org-string">"V"</span> view-mode)
  (<span class="org-string">"w"</span> widen)
  (<span class="org-string">"t"</span> rectangle-mark-mode)
  (<span class="org-string">"y"</span> yas-describe-tables)
  (<span class="org-string">"Y"</span> hydra-transparency/body)
  (<span class="org-string">"j"</span> org-babel-tangle-jump-to-org)
  (<span class="org-string">"u"</span> ucs-insert)
  (<span class="org-string">"i"</span> scroll-down-command <span class="org-builtin">:exit</span> nil)
  (<span class="org-string">"d"</span> dash-at-point)
  (<span class="org-string">"D"</span> help/safb-org-babel-detangle)
  (<span class="org-string">"k"</span> scroll-up-command <span class="org-builtin">:exit</span> nil)
  (<span class="org-string">"I"</span> previous-logical-line <span class="org-builtin">:exit</span> nil)
  (<span class="org-string">"K"</span> next-logical-line <span class="org-builtin">:exit</span> nil)
  (<span class="org-string">"n"</span> help/safb-normal-mode)
  (<span class="org-string">"m"</span> describe-mode)
  (<span class="org-string">"M"</span> help/checks/body)
  (<span class="org-string">"&lt;"</span> help/chs)
  (<span class="org-string">"&gt;"</span> help/che)
  (<span class="org-string">"."</span> help/parent-mode-display)
  (<span class="org-string">"?"</span> help/insert-noticeable-snip-comment-line)
  (<span class="org-string">";"</span> isearch-toggle-lax-whitespace)
  (<span class="org-string">"o"</span> toggle-debug-on-error)
  (<span class="org-string">"p"</span> anzu-query-replace)
  (<span class="org-string">"O"</span> base64-encode-region)
  (<span class="org-string">"P"</span> base64-decode-region)
  (<span class="org-string">"}"</span> help/hydra/transliterate/body)
  (<span class="org-string">"c"</span> fill-paragraph )
  (<span class="org-string">"b"</span> erase-buffer)
  (<span class="org-string">"B"</span> help/bibtex/body)
  (<span class="org-string">"'"</span> help/move-file)
  (<span class="org-string">"\""</span> imenu-list-minor-mode))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org7742540">(key-chord-define-global <span class="org-string">"vv"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/hydra/left-side/global/body</span>)
</pre>
</div>

<p>
<a href="https://github.com/abo-abo/hydra/blob/master/hydra-examples.el">Attribution.</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org88db31d">(<span class="org-keyword">defhydra</span> hydra-apropos-ish (<span class="org-builtin">:color</span> <span class="custom-1"><span class="custom">blue</span></span>
                                    <span class="org-builtin">:hint</span> nil)
  <span class="org-doc">"</span>
<span class="org-doc">_a_propos        _c_ommand</span>
<span class="org-doc">_d_ocumentation  _l_ibrary</span>
<span class="org-doc">_v_ariable       _u_ser-option</span>
<span class="org-doc">valu_e_          _i_nfo</span>
<span class="org-doc">e_m_acs          elis_p_</span>
<span class="org-doc">"</span>
  (<span class="org-string">"a"</span> apropos)
  (<span class="org-string">"d"</span> apropos-documentation)
  (<span class="org-string">"v"</span> apropos-variable)
  (<span class="org-string">"c"</span> apropos-command)
  (<span class="org-string">"l"</span> apropos-library)
  (<span class="org-string">"u"</span> apropos-user-option)
  (<span class="org-string">"i"</span> info-apropos)
  (<span class="org-string">"e"</span> apropos-value)
  (<span class="org-string">"m"</span> emacs-index-search)
  (<span class="org-string">"p"</span> elisp-index-search))
</pre>
</div>

<p>
Trademark.
</p>


<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org70fa0a7">(<span class="org-keyword">defhydra</span> help/trademark (<span class="org-builtin">:color</span> <span class="custom-1"><span class="custom">blue</span></span> <span class="org-builtin">:hint</span> nil)
  <span class="org-doc">"</span>
<span class="org-doc">American _R_egistered Trademark</span>
<span class="org-doc">American _U_nregistered Trademark</span>
<span class="org-doc">American _S_ervice Mark</span>
<span class="org-doc">_J_apanese Industrial Standard</span>
<span class="org-doc">_K_orean Standard</span>
<span class="org-doc">"</span>
  (<span class="org-string">"R"</span> (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>) (insert <span class="org-string">"&#174;"</span>)))
  (<span class="org-string">"U"</span> (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>) (insert <span class="org-string">"&#8482;"</span>)))
  (<span class="org-string">"S"</span> (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>) (insert <span class="org-string">"&#8480;"</span>)))
  (<span class="org-string">"J"</span> (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>) (insert <span class="org-string">"&#12292;"</span>)))
  (<span class="org-string">"K"</span> (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>) (insert <span class="org-string">"&#12927;"</span>))))
</pre>
</div>

<p>
Kinds of checks.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgc452858">(<span class="org-keyword">defhydra</span> help/checks (<span class="org-builtin">:color</span> <span class="custom-1"><span class="custom">blue</span></span> <span class="org-builtin">:hint</span> nil)
  <span class="org-doc">"</span>
<span class="org-doc">_q_ &#10003; _w_ &#10007; _e_ &#9744; _r_ &#9745; _t_ &#9746;_</span>
<span class="org-doc">"</span>
  (<span class="org-string">"q"</span> (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>) (insert <span class="org-string">"&#10003;"</span>)) <span class="org-builtin">:exit</span> nil)
  (<span class="org-string">"w"</span> (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>) (insert <span class="org-string">"&#10007;"</span>)) <span class="org-builtin">:exit</span> nil)
  (<span class="org-string">"e"</span> (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>) (insert <span class="org-string">"&#9744;"</span>)) <span class="org-builtin">:exit</span> nil)
  (<span class="org-string">"r"</span> (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>) (insert <span class="org-string">"&#9745;"</span>)) <span class="org-builtin">:exit</span> nil)
  (<span class="org-string">"t"</span> (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>) (insert <span class="org-string">"&#9746;"</span>)) <span class="org-builtin">:exit</span> nil))
</pre>
</div>

<p>
BibTeX stuff.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org6231ee3">(<span class="org-keyword">defhydra</span> help/bibtex (<span class="org-builtin">:color</span> <span class="custom-1"><span class="custom">blue</span></span> <span class="org-builtin">:hint</span> nil)
  <span class="org-doc">"</span>
<span class="org-doc">_c_ Clean Entry _C_ Clean Entry &amp; Create New Reference</span>
<span class="org-doc">_f_ Reindent Field _F_ Reindent Buffer/Region</span>
<span class="org-doc">_m_ Disable Unhelpful Modes _M_ Enable Unhelpful Modes</span>
<span class="org-doc">"</span>
  (<span class="org-string">"c"</span> bibtex-clean-entry)
  (<span class="org-string">"C"</span> (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>) (bibtex-clean-entry <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">t</span>)))
  (<span class="org-string">"f"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">bibtex-fill-entry</span>)
  (<span class="org-string">"F"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">bibtex-reformat</span>)
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Disable them</span>
  (<span class="org-string">"m"</span> (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>)
         (<span class="org-keyword">progn</span> (aggressive-indent-mode <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">toggle</span>)
                (visual-line-mode <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">t</span>))))
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Enable them</span>
  (<span class="org-string">"M"</span> (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>)
         (<span class="org-keyword">progn</span> (aggressive-indent-mode nil)
                (visual-line-mode nil)))))
</pre>
</div>
</div>
</li>
