help.org
**** Row 2
:PROPERTIES:
:ID:       org_gcr_2017-07-17_mara:B91C9779-B2AD-403B-A11F-5847EF8883C6
:END:

:PROPERTIES:
:ID:       org_gcr_2017-05-12_mara:8CA5EED7-5301-43E2-B6B9-C92AC66A2BE6
:END:

#+NAME: org_gcr_2017-05-12_mara_63E4B554-A5C6-46AB-9A34-E93FAF8B848B
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-x C-c") #'help/safb-save-buffers-kill-terminal)
(define-key org-mode-map (kbd "C-j") nil)
(global-set-key (kbd "C-j") nil)
(global-set-key (kbd "C-j") #'ido-switch-buffer)
(global-set-key (kbd "M-j") nil)
(define-key org-mode-map (kbd "M-j") nil)
(global-set-key (kbd "M-j") #'smex)
(global-set-key (kbd "C-M-,") #'ibuffer)
(define-key org-mode-map (kbd "C-o") nil)
(global-set-key (kbd "C-o") nil)
(global-set-key (kbd "C-o") #'ido-find-file)
(global-set-key (kbd "C-M-.") nil)
(global-set-key (kbd "C-M-.") #'dired)
#+END_SRC

Mcan't re-use =<<= and =>>=.

#+NAME: org_gcr_2017-07-28_mara_2A9CEE58-31E9-4DC8-B2EB-D3232D9DD9F7
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "s-<") (lambda () (interactive) (insert "«")))
(global-set-key (kbd "s->") (lambda () (interactive) (insert "»")))
#+END_SRC

**** Row 1
     :PROPERTIES:
     :ID:       org_gcr_2017-05-12_mara:A791BE09-ED4B-46F4-8225-EE73C15C1DD0
     :END:

Cycle through common options for removing space between characters. Thank you
[[http://pragmaticemacs.com/emacs/cycle-spacing/][Pragmatic Emacs]].

#+NAME: org_gcr_2017-05-12_mara_5FAD516B-B4C1-4F47-A6B9-7CA12F9AFF5D
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "s-SPC") #'cycle-spacing)
#+END_SRC

**** Unsorted
     :PROPERTIES:
     :ID:       org_gcr_2017-05-12_mara:4FEBE5F3-3B9E-438D-9E7F-DA337FB43BB7
     :END:


Powerful buffer movement. Split between home and lower because
- It is important if you have multiple windows
  - So it is close to home
- It interrupts flow naturally
  - So it isn't on the home row but it is close

Can't use ~nv~ because of:
- Canvas
- Conve*
- Envision
- Inverse

There are a lot. [[http://www.wordfind.com/ends-with/nv/][Ways]] to [[https://www.morewords.com/contains/nv/][find]] [[https://www.morewords.com/pair/nv/][them]] [[http://www.thefreedictionary.com/words-containing-nv][and]] [[http://www.wordhippo.com/what-is/containing/6-letter-words-nv.html][where]]

Toggle utility buffers ("logical F" key, so left side; "logical J" key on
right).

#+NAME: org_gcr_2017-05-12_mara_0CA60630-37AA-4192-91A1-FFC1B16DC3E4
#+BEGIN_SRC emacs-lisp
(key-chord-define-global "f9" #'help/util-cycle)
#+END_SRC

Hide and show code blocks.

#+NAME: org_gcr_2017-05-12_mara_8B031C72-2005-4FAF-A9F4-DE8D613DA01D
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "s-z") #'hs-toggle-hiding)
(global-set-key [(super shift ?z)] #'help/my-toggle-hideshow-all)
#+END_SRC

*** Left & Right Side
    :PROPERTIES:
    :ID:       org_gcr_2017-05-12_mara:AF27A71C-C30D-45C8-B3E7-BB044506B534
    :END:

Exploratory programming in EMACS.

Don't use "qi"; "unique".

Make =ispell= accessible.

#+NAME: org_gcr_2017-05-12_mara_921A07BB-6FBA-46E3-824D-F9F0B92F48B3
#+BEGIN_SRC emacs-lisp
(key-chord-define-global "qp" #'ispell)
(key-chord-define-global "qo" #'ispell-word)
#+END_SRC

Easily kill buffers. Can't use "df" because of "PDF".

Can't use "fr" because of "fright" and "France".

Can't use "dc" because of =cd (change directory)=.

Can't use "gr" brecause of "Grant" and "Great.

Go to a word.

#+NAME: org_gcr_2017-05-12_mara_2C04C038-F246-4E90-92C6-15ABF018BCD3
#+BEGIN_SRC emacs-lisp
(key-chord-define-global "fj" #'avy-goto-word-1)
(key-chord-define-global "fm" #'avy-goto-char)
(key-chord-define-global "FJ" #'avy-pop-mark)
#+END_SRC

Go to a line.

#+NAME: org_gcr_2017-05-12_mara_0729FB1D-FE71-417C-A3F7-AC1A92D71FBC
#+BEGIN_SRC emacs-lisp
(key-chord-define-global "fk" #'help/safb-help/goto-line)
#+END_SRC

Pop the mark back.

#+NAME: org_gcr_2017-05-12_mara_ED3BE98E-B863-447A-AB97-F4E878F2C483
#+BEGIN_SRC emacs-lisp
(key-chord-define-global "FK" #'pop-to-mark-command)
#+END_SRC

*** Right Side
    :PROPERTIES:
    :ID:       org_gcr_2017-05-12_mara:6F9375AB-C92C-4986-AECE-ABC945375CA2
    :END:

Reserve the right side for mode-specific activities.

It starts with:
- 6
- Y
- H
- N

Try to use ~s-i~ for things like ~info-at-point~.

