help.html

<li><a id="orgf3d5c66"></a>Row 2<br>
<div class="outline-text-5" id="text-6-5-1-4">
<pre class="example">
ID: org_gcr_2017-07-17_mara:B91C9779-B2AD-403B-A11F-5847EF8883C6
</pre>

<p>
:ID:       org<sub>gcr</sub><sub>2017</sub>-05-12<sub>mara</sub>:8CA5EED7-5301-43E2-B6B9-C92AC66A2BE6
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org593ef9f">(global-set-key (kbd <span class="org-string">"C-x C-c"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/safb-save-buffers-kill-terminal</span>)
(define-key org-mode-map (kbd <span class="org-string">"C-j"</span>) nil)
(global-set-key (kbd <span class="org-string">"C-j"</span>) nil)
(global-set-key (kbd <span class="org-string">"C-j"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">ido-switch-buffer</span>)
(global-set-key (kbd <span class="org-string">"M-j"</span>) nil)
(define-key org-mode-map (kbd <span class="org-string">"M-j"</span>) nil)
(global-set-key (kbd <span class="org-string">"M-j"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">smex</span>)
(global-set-key (kbd <span class="org-string">"C-M-,"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">ibuffer</span>)
(define-key org-mode-map (kbd <span class="org-string">"C-o"</span>) nil)
(global-set-key (kbd <span class="org-string">"C-o"</span>) nil)
(global-set-key (kbd <span class="org-string">"C-o"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">ido-find-file</span>)
(global-set-key (kbd <span class="org-string">"C-M-."</span>) nil)
(global-set-key (kbd <span class="org-string">"C-M-."</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">dired</span>)
</pre>
</div>

<p>
Mcan&rsquo;t re-use <code>&lt;&lt;</code> and <code>&gt;&gt;</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgf1bb0f4">(global-set-key (kbd <span class="org-string">"s-&lt;"</span>) (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>) (insert <span class="org-string">"&#171;"</span>)))
(global-set-key (kbd <span class="org-string">"s-&gt;"</span>) (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>) (insert <span class="org-string">"&#187;"</span>)))
</pre>
</div>
</div>
</li>

<li><a id="orgff0fe47"></a>Row 1<br>
<div class="outline-text-5" id="text-6-5-1-5">
<pre class="example">
ID: org_gcr_2017-05-12_mara:A791BE09-ED4B-46F4-8225-EE73C15C1DD0
</pre>

<p>
Cycle through common options for removing space between characters. Thank you
<a href="http://pragmaticemacs.com/emacs/cycle-spacing/">Pragmatic Emacs</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org4bf7037">(global-set-key (kbd <span class="org-string">"s-SPC"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">cycle-spacing</span>)
</pre>
</div>
</div>
</li>

<li><a id="orgd3cee0f"></a>Unsorted<br>
<div class="outline-text-5" id="text-6-5-1-6">
<pre class="example">
ID: org_gcr_2017-05-12_mara:4FEBE5F3-3B9E-438D-9E7F-DA337FB43BB7
</pre>


<p>
Powerful buffer movement. Split between home and lower because
</p>
<ul class="org-ul">
<li>It is important if you have multiple windows
<ul class="org-ul">
<li>So it is close to home</li>
</ul></li>
<li>It interrupts flow naturally
<ul class="org-ul">
<li>So it isn&rsquo;t on the home row but it is close</li>
</ul></li>
</ul>

<p>
Can&rsquo;t use <code>nv</code> because of:
</p>
<ul class="org-ul">
<li>Canvas</li>
<li>Conve*</li>
<li>Envision</li>
<li>Inverse</li>
</ul>

<p>
There are a lot. <a href="http://www.wordfind.com/ends-with/nv/">Ways</a> to <a href="https://www.morewords.com/contains/nv/">find</a> <a href="https://www.morewords.com/pair/nv/">them</a> <a href="http://www.thefreedictionary.com/words-containing-nv">and</a> <a href="http://www.wordhippo.com/what-is/containing/6-letter-words-nv.html">where</a>
</p>

<p>
Toggle utility buffers (&ldquo;logical F&rdquo; key, so left side; &ldquo;logical J&rdquo; key on
right).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org6491029">(key-chord-define-global <span class="org-string">"f9"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/util-cycle</span>)
</pre>
</div>

<p>
Hide and show code blocks.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgc491667">(global-set-key (kbd <span class="org-string">"s-z"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">hs-toggle-hiding</span>)
(global-set-key [(super shift ?z)] <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/my-toggle-hideshow-all</span>)
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org7507cb3" class="outline-4">
<h4 id="org7507cb3"><span class="section-number-4">6.5.2</span> Left &amp; Right Side</h4>
<div class="outline-text-4" id="text-6-5-2">
<pre class="example">
ID: org_gcr_2017-05-12_mara:AF27A71C-C30D-45C8-B3E7-BB044506B534
</pre>

<p>
Exploratory programming in EMACS.
</p>

<p>
Don&rsquo;t use &ldquo;qi&rdquo;; &ldquo;unique&rdquo;.
</p>

<p>
Make <code>ispell</code> accessible.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgea1ac20">(key-chord-define-global <span class="org-string">"qp"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">ispell</span>)
(key-chord-define-global <span class="org-string">"qo"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">ispell-word</span>)
</pre>
</div>

<p>
Easily kill buffers. Can&rsquo;t use &ldquo;df&rdquo; because of &ldquo;PDF&rdquo;.
</p>

<p>
Can&rsquo;t use &ldquo;fr&rdquo; because of &ldquo;fright&rdquo; and &ldquo;France&rdquo;.
</p>

<p>
Can&rsquo;t use &ldquo;dc&rdquo; because of <code>cd (change directory)</code>.
</p>

<p>
Can&rsquo;t use &ldquo;gr&rdquo; brecause of &ldquo;Grant&rdquo; and &ldquo;Great.
</p>

<p>
Go to a word.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org15c0383">(key-chord-define-global <span class="org-string">"fj"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">avy-goto-word-1</span>)
(key-chord-define-global <span class="org-string">"fm"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">avy-goto-char</span>)
(key-chord-define-global <span class="org-string">"FJ"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">avy-pop-mark</span>)
</pre>
</div>

<p>
Go to a line.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgcf3364d">(key-chord-define-global <span class="org-string">"fk"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/safb-help/goto-line</span>)
</pre>
</div>

<p>
Pop the mark back.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org4a6423b">(key-chord-define-global <span class="org-string">"FK"</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">pop-to-mark-command</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb28095e" class="outline-4">
<h4 id="orgb28095e"><span class="section-number-4">6.5.3</span> Right Side</h4>
<div class="outline-text-4" id="text-6-5-3">
<pre class="example">
ID: org_gcr_2017-05-12_mara:6F9375AB-C92C-4986-AECE-ABC945375CA2
</pre>

<p>
Reserve the right side for mode-specific activities.
</p>

<p>
It starts with:
</p>
<ul class="org-ul">
<li>6</li>
<li>Y</li>
<li>H</li>
<li>N</li>
</ul>

<p>
Try to use <code>s-i</code> for things like <code>info-at-point</code>.
</p>
</div>
</div>
