help.org
*** Exceptions
    :PROPERTIES:
    :ID:       org_gcr_2017-05-12_mara:187B7649-D799-4E41-9DE7-448BC50E0250
    :END:

Return.

Do smart new line inside, indenting given the mode.

#+NAME: org_gcr_2017-05-12_mara_9302B01F-93C0-4D21-8BB6-53ECF1478153
#+BEGIN_SRC emacs-lisp
(help/not-on-gui (global-set-key (kbd "s-RET") #'help/smart-open-line))
(help/on-gui (global-set-key (kbd "s-<return>") #'help/smart-open-line))
#+END_SRC

Move the buffer contents and cursor up or down by one line

#+NAME: org_gcr_2017-05-12_mara_EB0E9368-41FE-4827-9EE2-5CDFCDC1C2BA
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "M-p") (kbd "C-u 1 C-v"))
(global-set-key (kbd "M-n") (kbd "C-u 1 M-v"))
#+END_SRC

#+NAME: org_gcr_2017-05-12_mara_078C604D-5762-4763-AD17-A397C5E224E7
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-n") #'next-logical-line)
(global-set-key (kbd "C-s-n") #'next-line)
(global-set-key (kbd "C-p") #'previous-logical-line)
(global-set-key (kbd "C-s-p") #'previous-line)
#+END_SRC

Ansu.

#+NAME: org_gcr_2017-05-12_mara_BF926B57-9097-483F-AB90-E3F55869B0D9
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "M-%") #'anzu-query-replace)
(global-set-key (kbd "C-M-%") #'anzu-query-replace-regexp)
#+END_SRC
