help.html

<div id="outline-container-orgde63d3a" class="outline-4">
<h4 id="orgde63d3a"><span class="section-number-4">6.5.4</span> Exceptions</h4>
<div class="outline-text-4" id="text-6-5-4">
<pre class="example">
ID: org_gcr_2017-05-12_mara:187B7649-D799-4E41-9DE7-448BC50E0250
</pre>

<p>
Return.
</p>

<p>
Do smart new line inside, indenting given the mode.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org06f9ea5">(<span class="org-keyword">help/not-on-gui</span> (global-set-key (kbd <span class="org-string">"s-RET"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/smart-open-line</span>))
(<span class="org-keyword">help/on-gui</span> (global-set-key (kbd <span class="org-string">"s-&lt;return&gt;"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/smart-open-line</span>))
</pre>
</div>

<p>
Move the buffer contents and cursor up or down by one line
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org83e153a">(global-set-key (kbd <span class="org-string">"M-p"</span>) (kbd <span class="org-string">"C-u 1 C-v"</span>))
(global-set-key (kbd <span class="org-string">"M-n"</span>) (kbd <span class="org-string">"C-u 1 M-v"</span>))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orge9a4ae4">(global-set-key (kbd <span class="org-string">"C-n"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">next-logical-line</span>)
(global-set-key (kbd <span class="org-string">"C-s-n"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">next-line</span>)
(global-set-key (kbd <span class="org-string">"C-p"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">previous-logical-line</span>)
(global-set-key (kbd <span class="org-string">"C-s-p"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">previous-line</span>)
</pre>
</div>

<p>
Ansu.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org45ff279">(global-set-key (kbd <span class="org-string">"M-%"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">anzu-query-replace</span>)
(global-set-key (kbd <span class="org-string">"C-M-%"</span>) <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">anzu-query-replace-regexp</span>)
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Grant Rettke</p>
<p class="date">Created: 2017-10-13 Fri 15:58</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
